[
{
  "title": "Python语言程序设计",
  "url": "https://www.chinaooc.com.cn/course/685c63bcf8462332e071aa49",
  "teacher": "嵩天",
  "school": "北京理工大学",
  "description": "快讯：这是本课程第28次开课，课程累计学习者已经超过548万！课程经过百万学习者检验，更专业、更丰富、更高质量! 课程设置了微信群，帮助天南海北的学习者建立直接的沟通学习方式，更轻松有效掌握一门Python语言~    —— 为什么要学习计算机编程？     —— 因为编程是件很有趣的事儿，能启迪思维，还有诗和远方... 2025年，“Python系列国家精品课”时间表如下，供同学们参考！     Python [paɪθən] 语言，由Guido van Rossum大牛在1990年发明，它是当今世界最受欢迎的计算机编程语言，也是一门对大多数人“学了能用、学了有用、学会能久用”的计算生态语言。    本课程是一门体现大学水平的Python 语言入门课程，采用“理解和运用计算生态”为教学理念，面向Python零基础学习者，不要求学习者有任何编程基础。本课程将帮助大家快速、轻松且系统的学习Python语言，高效编写程序，掌握利用计算机解决问题的基本方法和过程。    本课程主要讲解“Python基础语法”全体系，包括3个教学部分，共9周内容，教学安排如下： ·        第一部分，共2周：Python快速入门，初识Python语言，讲解基本的程序设计方法、熟悉Python语法元素。·        第二部分，共5周：Python基础语法，深入Python语言，讲解Python基础语法全貌、实践计算问题求解。·        第三部分，共2周：Python编程思维，运用Python语言，讲解计算生态、程序设计方法学等内容、显著提高编程思维。     本课程共讲解16个经典案例，提供50道以上编程题和100道以上单选题作为课后练习（可选，由学习者可自主完成），帮助大家熟练Python语言编程能力。本课程需要一个9周的学习计划表，完成后将掌握一门可用20年以上的编程语言，学习里程碑如下： ·        第2周结束：将学会编写010行左右Python程序，有输入、有输出、带文字、有图形；·        第7周结束，将熟练编写050行左右Python程序，正式成为程序员(业余)一族；·        第9周结束，将能够编写100行以上Python程序，拿个证书同时开始像专业程序员一样思考。    —— 学了Python能有什么用？     —— 买房买车找工作、交友美食游世界，似乎都不行... 但却可以：谈理想、谋职业、去创新。    【画朵玫瑰花送给TA】某一天，送给TA一朵与众不同的玫瑰花，从此以后就可以尽情虐狗了！这源于真实的校园爱情故事，向青春致敬、向爱情致敬，向Python致敬！    【体会蒙特卡洛方法的魅力】人人都知道圆周率π，你可知道怎么求解圆周率吗？听说过求解圆周率背后的“蒙特卡洛方法”吗？这可是工程领域的必杀技，不告诉你这用Python实现就是小case。    【宏观到微观的神秘几何学】分形几何是高等数学的神秘分支，它完美诠释了宏观和微观、全局和局部、战略和战术的大一统。有个叫“科赫”的曲线，小名“雪花”，19行Python代码展示0阶到n阶雪花曲线的全过程。        【专业到爆的雷达图展示】雷达图是展示多维属性的有效工具，既可用它表示专业化内容，又可用它展示游戏人物技能点。用21行Python代码实现专业雷达图，要不要来试试？    —— 学了Python还能做什么？     —— 请你来告诉大家...",
  "learners": 5000000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "程序设计入门——C语言",
  "url": "https://www.chinaooc.com.cn/course/67b516a9225d72705e3c3200",
  "teacher": "翁恺",
  "school": "浙江大学",
  "description": "程序设计是一门基础课程。对于计算机相关专业而言，程序设计是专业基础知识，是进一步学习其他专业知识的第一步阶梯；对于非计算机专业而言，程序设计的学习有助于理解计算机的能力所在，理解哪些是计算机擅长解决的问题，怎样的方式方法是计算机擅长的手段，从而能更好地利用计算机来解决本专业领域内的问题。C语言是古老而长青的编程语言，它具备了现代程序设计的基础要求，它的语法是很多其他编程语言的基础，在系统程序、嵌入式系统等领域依然是无可替代的编程语言，在各类编程语言排行榜上常年占据前两名的位置。对于非计算机专业的学生，学习本课程的主要目的是掌握程序设计的基本方法，C语言是教学媒介。但是对于计算机专业的学生，本课程是向后续的计算机组成、操作系统、编译原理、体系结构等课程前进的基石，对于C语言本身甚至程序设计语言基础原理的深入理解都是应该掌握的。本课程是零基础的入门课程，完成本课程之后，就能具有初步的运用C语言编写程序的能力。要想完整的学习C语言，还需要进一步学习本课程的后续课程——《C语言程序设计进阶》。程序设计是实践性很强的课程，该课程的学习有其自身的特点，听不会，也看不会，只能练会。你必须通过大量的编程训练，在实践中掌握编程知识，培养编程能力，并逐步理解和掌握程序设计的思想和方法。在这里所提供的，只是基础的知识讲解，要想学会编程，还需要更多时间的投入和努力。为了学习编程，你需要有一台计算机，安装必要的编程软件。无论是MS Windows、Mac OS X还是Linux，都有适合C语言编程的软件。如果搞不定自己电脑上的编程软件，我们也会提供在网页中编写、运行C语言程序的方法。",
  "learners": 2000000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据结构",
  "url": "https://www.chinaooc.com.cn/course/6844cd04b836e5522ac7abc3",
  "teacher": "陈越",
  "school": "浙江大学",
  "description": "“数据结构”是计算机科学与技术专业、软件工程专业甚至于其它电气信息类专业的重要专业基础课程。它所讨论的知识内容和提倡的技术方法，无论对进一步学习计算机领域的其它课程，还是对从事大型信息工程的开发，都是重要而必备的基础。   程序设计解决问题往往有多种方法，且不同方法之间的效率可能相差甚远。程序的时间和空间效率，不仅跟数据的组织方式有关，也跟处理流程的巧妙程度有关。本课程将介绍并探讨有关数据组织、算法设计、时间和空间效率的概念和通用分析方法，帮助学员学会数据的组织方法和一些典型算法的实现，能够针对问题的应用背景分析，选择合适的数据结构，从而培养高级程序设计技能。   注意：本课程只涉及最基础的数据结构和与之关联的最基本的算法，更多更复杂的数据结构和经典的解决优化问题的算法，将在后续课程中介绍。   本课程的特点是，对每一种重要的经典数据结构，我们都会从实际应用问题出发，导出其定义、实现（存储）方法以及操作实现，并以更丰富的综合应用案例和练习题帮助学员增强对理论的感性认识，从而明白这些数据结构为什么存在以及在什么情况下可以最好地解决什么样的问题。为了兼顾起点不同的学员，课程中特意设计了“小白专场”系列，手把手教授如何将解决问题的抽象算法用具体的代码实现，从而引导初学者更好地入门。   坚持完成本课程学习、并按照要求完成所有练习的学员，应该具备了攀拓（PAT - Professional Ability Test）甲级需要的所有基础知识，辅以充分的英语阅读能力和熟练的编程能力，应可以取得优良成绩。",
  "learners": 1000000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大学计算机",
  "url": "https://www.chinaooc.com.cn/course/67b517c3225d72705e3c3298",
  "teacher": "李凤霞",
  "school": "北京理工大学",
  "description": "1. 《大学计算机》课程与其它类似的课程有什么不同？《大学计算机》是面向大学一年级学生开设的计算机通识类课程，类似的还有《大学计算机基础》、《计算机应用基础》，或者《计算机文化基础》、《信息技术基础》等课程，它和这些不同名字的课程有什么不同呢？《大学计算机》是根据教育部高教司2012年提出的“以计算思维能力培养为切入点”的教改意见，按照教指委自2013年推出并逐步完善的“计算思维教学体系”，从内容上支持计算机思维能力培养，从体系上完善课程和实验一体化教学设计，从形式上兼顾研究型和应用型学习者的不同需求。《大学计算机》更强调“概念、系统和计算”，而不是传统“应用基础”课程中的工具软件；更强调“理论、方法和实验”，而不是“文化”课程中的“体系、技术和实践”。 2. 《大学计算机》与中学的计算机课程有什么不同？ 你一定有这样的疑问：从小学到中学，我们已知道了二进制，熟练了Windows，既会上网，也会使用Office，《大学计算机》课程又该学什么呢？若说学“计算机的原理概念、系统平台、信息处理、计算文化”，你是否觉得和以前学过的差不多？那到底差得多还是差不多呢？当然是差得多！这就如同我们在中学物理和大学物理中都学“力学”，但是前者是用初等数学为工具来解释力学知识，而大学则必须用微积分的方法研究力学问题。大学计算机从问题视角、讲授内容、研究方法、培养目标都和中学有本质的区别。同时，《大学计算机》关注的是专业需要的 “计算支持”，而中学大都是学习“软件应用”，这就如同中学物理只关注安培力的物理意义，而大学却会研究安培力对电磁炮发射的影响。同样，本课程在关注基本原理的同时，会更关注系统概念和技术变革以及计算思维能力的提升。3. 《大学计算机》如此之多的内容该怎样学呢？看到下面的目录和教材，你一定会有这样的担忧：内容如此之多，课时非常有限，该怎样学呢？我们是国家级优秀教学团队，不仅为大家提供了视频、教材、练习、讨论和测验，而且每章还提供了“知识扩展、虚拟实验、软件应用”三个栏目，在“知识扩展”中每周讲一个故事，其内容与章节核心技术相关，追求技术落地，引导创新；在“虚拟实验”中每周提供一个实验，解决本讲重点难点内容的实验验证，追求深刻理解，启发思维；在“软件应用”中每周讲一个实用软件案例，适用更高端的OA需求，追求需求牵引 ，举一反三。通过这些课程配置，希望程度不一的读者能找到自己的切入点，按需选择，轻松学习。除此之外，我们有教育部《大学计算机虚拟仿真实验教学中心》的支持，为课程量身打造了虚拟实验体系，实现了：摸得到的系统结构，看得见的信息流动，可实现的原理概念。解决重点难点问题的教和学，目的在于求精探深，培养计算思维，启发创新意识。课程教学理念和方法：基于理论，面向问题，掌握知识；化整为零，循序渐进，引导自学，启发思维。在快乐中学习，在成长中收获！课程组织形式：该课程由一个教学团队完成支持，讲什么内容找什么专家。所以有讲原理概念的、讲系统平台的、讲信息处理的、讲计算与算法的；三个专栏有讲故事的，也有讲软件的，还有讲实验的，分工协作，各扬其长。另外，为了不同需求的同学能够获取更多的教学资源，本课程设置了一个“百家视点”专栏，在这个栏目里，大家将分享不同专家的见解。这样课程每周提供2学时的课内教学视频和1学时课外学习资源，从而你可自由的选择学习内容，裁剪出自己的需求。",
  "learners": 1000000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Java程序设计",
  "url": "https://www.chinaooc.com.cn/course/6892729bf57d20271c59a4ca",
  "teacher": "唐大仕",
  "school": "北京大学",
  "description": "本课程的先修课程：最好是学过一门程序设计语言（如C、C++、C#、Python、VB等任何一门语言）。  本课程是在已有的基础上让学习者能够以Java语言编写具有一定规模、综合性的应用程序。对后面的操作系统、编译原理、数据库等课程来说，该课程是一个承上启下的课程。  从课时内容而言，主要有三部分：  第一部分是Java语言部分，包括Java概述，简单的Java程序，变量、语句、数组，类、包、接口，深入理解Java语言，异常处理等。这部分内容的目的是掌握Java语言的语法，能够较为深入理解Java语言机制，掌握Java语言面向对象的特点。   第二部分是Java的类库及应用，包括工具类及常用算法、多线程、流、文件及基于文本的应用、图形用户界面、网络、多媒体和数据库编程等，这部分的目标是掌握JavaSE中基本的API，掌握在集合、线程、输入输出、图形用户界面、网络等方面的应用。  第三部分是关于如何写出出高质量的代码，包括集成开发环境的使用，单元测试、日志、质量管理工具的使用，掌握重构和设计模式，这部分的目标是综合应用本课程的知识，能够编写有一定规模的应用程序，养成良好的编程习惯，能够编写高代码的质量。  课程一方面重视语言的基础和原理，另一方面注意实际编程能力的培养。  课程中除了视频、讨论区外，每周都有一些测验、还有一些小的作业，在课程结束还要求开发有一定工作量、有中等难度的项目。      本课程为国家精品在线开放课程；是教育部-华为“智能基座”精品慕课之一。自2021年秋季学期起，该课程加入 教育部-华为“智能基座” 精品慕课建设项目， 将Java与华为资源有机结合起来，包括Java在毕昇JDK、鲲鹏平台、华为云、鸿蒙、欧拉、华为认证、人才在线、教育资源等方面的体现与应用。具体所在的章节如下：1.1\t华为毕昇JDK 及 鲲鹏计算产业2.4\t华为云平台上进行Java程序的编译与运行5.9\t华为鲲鹏平台上 Java 调用 C 程序8.6\tJava线程原理及其在鲲鹏上的实现 8.6\tJVM内存调优及其在鲲鹏上的应用 9.2\t华为OpenEuler (Linux)平台上的文件与目录9.4\t华为鲲鹏平台上开发Java资金管理小系统10.6\tJava移动开发与鸿蒙应用11.1\t华为鲲鹏平台上用socket开发多人在线聊天室11.3\t华为鲲鹏平台上开发Java Web小应用 12.5\tJava认证考试及华为的教育资源     本课程在“阿里云计算有限公司教育部产学合作协同育人项目”的支持下进行了升级，补充了18个实验及11个视频。所有的实验都可以在阿里云起实验室免费实验，所有补充的视频都可以在慕课中免费观看。  这18个实验是：1\t阿里云起实验室的使用2\t阿里云平台上进行Java程序的编译与运行3\t使用阿里的JDK：Dragonwell4\t使用Java中的数组：埃氏筛法求素数5\tJava中面向对象的分析与设计：银行系统6\tJava中类的初始化过程7\tJava中stream及lambda表达式8\t自定义异常9\t自定义集合：使用链表10\t阿里云Arthas调优工具的使用11\t文本与正则表达式的应用：背单词小软件12\tGUI组件、布局与事件：排块游戏13\t常用组件应用示例：文本编辑器14\t用 JDBC 访问Sqlite数据库：小小通讯录15\t使用阿里云RDS数据库16\t使用阿里云OSS进行文件的云存储17\t代码重构及阿里Java代码规约扫描插件P3C的使用18\t文本、数据库、图形用户界面的综合应用     补充的视频如下：补充视频：阿里开源JDK Dragonwell补充视频：阿里弹性云服务器ECS补充视频：龙蜥开源操作系统Anolis OS补充视频：阿里云存储OSS补充视频：阿里开源Fast Json 2补充视频：阿里云数据库RDS 及PolarDB补充视频：消息队列RocketMQ补充视频：阿里开源中间件Spring Cloud Alibaba补充视频：阿里开源组件ByteKit及JVM-Sandbox补充视频：阿里Java编码惯例及阿里的Java开发手册补充视频：阿里云培训与认证",
  "learners": 900000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Office高级应用",
  "url": "https://www.chinaooc.com.cn/course/67ca2267225d72705ea1dc63",
  "teacher": "张伟利",
  "school": "成都信息工程大学",
  "description": "本课程以WPS Office为软件运行环境，结合日常办公应用需求讲解最常用的文字、表格、演示三个应用组件。本课程主要教学内容包括：WPS文字基本操作、WPS文字图文混排、WPS文字表格与公式、WPS文字长文档排版、WPS文字高级应用、WPS表格基础、WPS表格数据处理、WPS表格综合应用、WPS表格提高、WPS演示基础、WPS演示进阶。",
  "learners": 900000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Python网络爬虫与信息提取",
  "url": "https://www.chinaooc.com.cn/course/685b1f1cf8462332e06b173b",
  "teacher": "嵩天",
  "school": "北京理工大学",
  "description": "快讯：本课程是国家精品在线开放课程“Python网络爬虫与数据分析”的上半部分，当前为第23次开课，欢迎大家前来学习！     —— 为什么要学习网络爬虫？     —— 因为数据都在网上，先要爬下来才能挖掘淘金 ...\t\t\t\t\t\t\t\t\t\t“The website is the API.” （网页即接口）网络爬虫是获取数据的必备本领，不要犹豫！       本课程面向具有Python编程基础的各类学习者，讲解利用Python语言爬取网络数据并提取关键信息的技术和方法，帮助学习者掌握定向网络数据爬取和网页解析的基本能力。    本课程介绍Python计算生态中最优秀的网络数据爬取和解析技术，具体讲授构建网络爬虫功能的两条重要技术路线：requests-bs4-re和Scrapy，所讲述内容广泛应用于Amazon、Google、PayPal、Twitter等国际知名公司。课程内容是进入大数据处理、数据挖掘、以数据为中心人工智能领域的必备实践基础。    本课程教学内容包括：·         Python第三方库Requests，讲解通过HTTP/HTTPS协议自动从互联网获取数据并向其提交请求的方法；·         Python第三方库Beautiful Soup，讲解从所爬取HTML页面中解析完整Web信息的方法；·     Python标准库Re，讲解从所爬取HTML页面中提取关键信息的方法；·     Python第三方库Scrapy，介绍通过网络爬虫框架构造专业网络爬虫的基本方法。     本课程希望传递“理解和运用计算生态”的理念，重点培养学习者运用当代最优秀第三方专业资源，快速分析和解决问题的能力。\"人生苦短，不要刀耕火种“，嵩老师教你直面问题和需求，用最好的工具解决它！    本课程是国家精品在线开放课程“Python网络爬虫与数据分析”课程的上半部分。“Python网络爬虫与数据分析”课程由“Python网络爬虫与信息提取”和“Python数据分析与展示”两门MOOC课程组成，完整地讲解了数据获取、清洗、统计、分析、可视化等数据处理周期的主要技术内容，培养计算思维、数据思维及采用程序设计方法解决计算问题的实战能力技术。",
  "learners": 800000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C语言程序设计进阶",
  "url": "https://www.chinaooc.com.cn/course/65496ec0f296af4743e42d09",
  "teacher": "翁恺",
  "school": "浙江大学",
  "description": "课程以一个Windows下的图形游戏程序入手，借助一个C语言图形库，展开全部的教学内容。作为计算机的基础语言，C语言有许多独特的地方。从1970年代诞生起，它的历史使命就是编写系统程序，它被设计成非常贴近底层、贴近硬件。它的很多独特的设计都是为了能够准确地反映硬件操作。但是历史又和C语言开了一个玩笑，它被当作了第一个通用型语言，曾经广泛地用于各种场合，解决各种问题。可是它之后的语言，再也没有像它那样贴近硬件，它们拿掉了那些硬件相关的东西，变得越来越远离底层了。这门课，就是要告诉你C语言到底有哪些独特的地方，为什么能长期占据15%上下的编程语言份额。它是在前序课程——《程序设计入门-C语言》或《程序设计入门-Java语言》的基础上，让你完全掌握C语言本身的课程。虽然我们会借助一个Windows下的图形库来展开教学内容，但是用C语言写Windows程序已经是过去式了，我们并不是要教大家如何用C语言来写Windows程序，只是借一下故事而已。",
  "learners": 800000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "零基础学Java语言",
  "url": "https://www.chinaooc.com.cn/course/67b516a7225d72705e3c31ff",
  "teacher": "翁恺",
  "school": "浙江大学",
  "description": "程序设计是一门基础课程。对于计算机相关专业而言，程序设计是专业基础知识，是进一步学习其他专业知识的第一步阶梯；对于非计算机专业而言，程序设计的学习有助于理解计算机的能力所在，理解哪些是计算机擅长解决的问题，怎样的方式方法是计算机擅长的手段，从而能更好地利用计算机来解决本专业领域内的问题。Java是近10年来最流行的编程语言，在各类编程语言排行榜上长年占据前两名的位置。本课程是以Java语言来讲授程序设计的入门知识的。程序设计是实践性很强的课程，该课程的学习有其自身的特点，听不会，也看不会，只能练会。你必须通过大量的编程训练，在实践中掌握编程知识，培养编程能力，并逐步理解和掌握程序设计的思想和方法。在这里所提供的，只是基础的知识讲解，要想学会编程，还需要更多时间的投入和努力。",
  "learners": 700000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C语言程序设计精髓",
  "url": "https://www.chinaooc.com.cn/course/67aa8b8b225d72705e0954e2",
  "teacher": "苏小红",
  "school": "哈尔滨工业大学",
  "description": "对于这个地球上大多数人来说，真正的数字化革命还没有开始。在接下来的10年里，变化将无处不在，让我们一起来给这个世界编码吧！——Eric Schmidt Google执行主席    我们会用15周的时间来深入讲解C语言，在授课过程中，我们会注重多解释一些“为什么”以及错误程序的分析，从环环相扣的问题入手，将一些易被忽视且对高水平程序设计很重要的“点”，沿着数据结构从简单到复杂的主线逐一展开，在实例的“不断深化和提升”中引出知识点，通过对问题的举一反三和前后知识点的融会贯通，由浅入深地引导你循序渐进地编写规模逐步增大的程序。在过去40年90%的时间里，C语言独领风骚，仅偶尔被其他语言超越，可见其魅力。C语言作为一种高级语言，其实并不高级，但正是这种“低级”给我们更多思考的机会。期望通过本课程的学习，你不只是简单地能够掌握一种语言的语法，还能理解隐含在语法背后的思想，并初步具备灵活使用这些思想进行编写程序解决实际问题的能力。如果你掌握了这些，你会发现，迈向成功的最后一步不过是选择一种合适的编程工具而已。 你想从“菜鸟”升级为“程序猿”吗？那就加入“稀饭”的行列，和我们一起踏上爱上C语言之旅吧。自2021年秋季学期起，该课程加入教育部-华为“智能基座”精品慕课建设项目，将C语言与华为资源有机结合起来，包括鲲鹏平台软件开发、华为编程实践与编程规范等。具体所在的章节如下：1.1.2 计算的未来和未来的计算（9分半）1.1.3 编译型语言与解释型语言及其运行差异（7分）1.1.4 现代主流计算机指令（8分）1.2.3 鲲鹏平台介绍——如何在华为云上申请弹性云服务器（6分）1.2.4 鲲鹏平台介绍——远程登陆（3分半）1.2.5 鲲鹏平台介绍——linux指令（4分）1.2.6 鲲鹏平台介绍——运行Hello World（5分）1.6 进阶：华为编程实践与编码规范1.6.1 编程实践—数据类型（4分）1.6.2 编程实践—常量（4分）1.6.3 编程实践—变量（10分）1.6.4 编程实践—声明与初始化（1分）2.6 进阶：华为编程实践与编码规范2.6.1 编程实践—表达式（4分）2.6.2 代码风格—整数（16分）5.7 进阶：华为编程实践与编码规范5.7.1 编程实践—控制语句（8分半）6.1.3 鲲鹏平台ARM处理器的函数优化（8分）6.5 进阶：华为编程实践与编码规范6.5.1 代码风格—命名（6分半）6.5.2 代码风格—注释（6分）6.5.3 代码风格—格式（17分）6.5.4 编程实践—预处理（19分）6.5.5 编程实践—头文件（9分半）11.5 进阶：华为编程实践与代码风格11.5.1 代码风格—指针和数组（10分半）11.5.2 代码风格—字符串（5分）11.5.3 代码风格—断言（6分）11.5.4 代码风格—函数设计（17分）11.5.5 代码风格—函数使用（19分）13.4 鲲鹏多核体系与弱内存模型（17分）15.7 进阶：华为编程实践与编码规范15.7.1 编程规范—内存（6分）15.7.2 编程规范—文件（3分半）15.7.3 编程规范—其它（4分）",
  "learners": 700000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机网络",
  "url": "https://www.chinaooc.com.cn/course/67ad2ee3225d72705e160e2e",
  "teacher": "李全龙",
  "school": "哈尔滨工业大学",
  "description": "《计算机网络》课程分为三个单元：“计算机网络之网尽其用”、“计算机网络之探赜索隐”和“计算机网络之危机四伏”。“计算机网络之网尽其用”将带你快速了解、认识计算机网络，理解并掌握计算机网络与网络协议等基本概念、网络组成与网络体系结构，剖析你每天都在使用的网络应用的类型、运行原理以及应用层协议，帮助你理解绝大多数网络应用所采用的应用编程接口-套接字（Socket），学习并掌握Socket编程技术基础，具备开发简单网络应用的能力。“计算机网络之探赜索隐”将带你深入计算机网络内部，探究计算机网络深层奥秘，了解并掌握计算机网络深层次的原理、协议及网络技术，让你不仅知其然而且知其所以然，真正成为计算机网络的行家里手。这部分主要讲授：可靠数据传输基本原理、停-等协议与滑动窗口协议、典型传输层协议（UDP与TCP）、虚电路网络与数据报网络、路由与转发、IP协议与IP地址、CIDR、子网划分与路由聚集、ICMP协议、DHCP协议、NAT、IPv6、路由算法、路由协议、差错编码、MAC协议、ARP协议、以太网、VLAN、PPP协议、无线局域网等。“计算机网络之危机四伏”将带你一起认识网络安全威胁，理解并掌握保障网络安全的基本原理、网络协议以及技术措施，让你认识到如何在享受网络带给你诸多便利的同时尽可能避免令自身处于重重危机之中。这部分主要讲授：网络安全基本概念；网络安全威胁；密码学基础；信息完整性与数字签名；身份认证；安全电子邮件；SSL；IPsec与VPN；无线网局域网安全；防火墙；入侵检测等。",
  "learners": 600000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Python数据分析与展示",
  "url": "https://www.chinaooc.com.cn/course/685b1f19f8462332e06b173a",
  "teacher": "嵩天",
  "school": "北京理工大学",
  "description": "快讯：这是本课程第22次开课~~本课程是国家精品在线开放课程“Python网络爬虫与数据分析”的下半部分，欢迎大家加入学习！\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t“我们正步入一个数据或许比软件更重要的新时代。——Tim O'Reilly”\t\t\t\t\t\t\t运用数据是精准刻画事物、呈现发展规律的主要手段，分析数据展示规律，\t把思想变得更精细！\t\t\t\t\t\t\t本课程面向各类编程学习者，讲解利用Python语言表达N维数据并结合数据特点合理展示数据的技术和方法，帮助学习者掌握表示、清洗、统计和展示数据的能力。\t\t\t\t\t\t\t本课程介绍Python计算生态中最优秀的数据分析和展示技术，所讲授内容\t是数据领域最优秀的编程模块，在理学、工程、信息、管理、经济等学科领域具有极其广泛的应用潜力。\t\t\t\t\t\t\t本课程共包括4周内容，分别讲解：\t\t\t\t\t\t\t（1）Python第三方库NumPy，讲解N维数据的表达及科学计算的基本概念和运算方法；\t\t\t\t\t\t\t（2）Python第三方库Matplotlib，讲解绘制坐标系、散点图、极坐标图等直观展示数据趋势和特点的方法；\t\t\t\t\t\t\t（3）Python第三方库Pandas，强大的专业级数据分析和处理第三方库，介绍并讲解Series和DataFrame数据类型的表示和基本使用。\t\t\t\t\t\t\t\t\t\t\t\t\t\t该课程希望传递\t“理解和运用计算生态，培养集成创新思维”的理念，重点培养学习者运用当代最优秀第三方专业资源，快速分析和解决问题的能力。\t\t\t\t\t\t\t“人生苦短，不要刀耕火种”，嵩老师教你直面问题和需求，用最好的工具解决它！\t\t\t\t\t\t\t本课程是“Python网络爬虫与数据分析”课程的下半部分。“Python网络爬虫与数据分析”课程由“Python网络爬虫与信息提取”和“Python数据分析与展示”两门MOOC课程组成，完整地讲解了数据获取、清洗、统计、分析、可视化等数据处理周期的主要技术内容，培养计算思维、数据思维及采用程序设计方法解决计算问题的实战能力技术。  \t\t\t\t\t\t\t>>Python 网络爬虫与信息提取（国家精品在线开放课程）https://www.icourse163.org/course/BIT-1001870001>>Python 科学计算三维可视化（国家精品在线开放课程）https://www.icourse163.org/course/BIT-1001871001",
  "learners": 600000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C++语言程序设计基础",
  "url": "https://www.chinaooc.com.cn/course/687eb38316c43a09c0e581d4",
  "teacher": "郑莉",
  "school": "清华大学",
  "description": "C++是从C语言发展演变而来的一种面向对象的程序设计语言。面向对象的程序设计方法将数据及对数据的操作方法封装在一起，作为一个相互依存、不可分离的整体——对象。对同类型对象抽象出其共性，形成类。类通过外部接口，与外界发生关系，对象与对象之间通过消息进行通讯。这样，程序模块间的关系简单，程序模块的独立性、数据的安全性具有良好的保障，通过继承与多态性，使程序具有很高的可重用性，使得软件的开发和维护都更为方便。\n\n\t由于面向对象方法的突出优点，目前它已经成为开发大型软件时所采用的主要方法。而C++语言是应用最广泛的面向对象的程序设计语言之一。\n\n\t本课程是一门面向广大初学者的入门课程，自1999年开始在清华大学开设，本课程的教材已经在清华大学等一百多所学校的不同专业中使用，取得了良好的教学效果。\n\n\t本课程将C++语言作为大学生的计算机编程入门语言，不仅详细介绍语言本身，而且介绍常用的数据结构和算法、面向对象的设计思想和编程方法。课程以面向对象的程序设计方法贯穿始终，每一章都是首先阐述面向对象的程序设计思想和方法，由实际问题入手，然后引出必要的语法知识，在讲解语法时着重从程序设计方法学的角度讲述其意义和用途。",
  "learners": 500000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C语言程序设计(上)",
  "url": "https://www.chinaooc.com.cn/course/67b517c9225d72705e3c329b",
  "teacher": "李凤霞",
  "school": "北京理工大学",
  "description": "我们一如既往还说C，因为它称霸于计算机语言，超乎我们的想象。如果想深刻的理解这个时代，就要理解计算机编程! 编程完成了基于计算机的计算实现，改变着我们的思维方式！ 编程的日子上演着种种惊喜，让我们实现着梦想！C语言具备了面向过程程序设计的基本要求，在诸多领域无可替代，也适合于构建程序设计基础。所以它是一门程序设计的公共基础课程，相信也是热爱程序设计的朋友们会青睐的一门课。对于计算机类专业，程序设计是专业基础课，它是后续专业课程的基础；对于非计算机类专业，程序设计将会改变我们的思维，教给我们信息时代如何思考问题，从而能更好地利用计算机科学与技术解决本专业领域的计算相关、信息处理相关的问题。为了循序渐进，我们将《C语言程序设计》这门课程分为上、下两部分完成。以数组为分割点，由《C语言程序设计（上）》和《C语言程序设计（下）》，前者8周，后者10周。采用分而治之，旨在由浅入深，坚固基础，追求完备。我们的课堂将从零基础开始，为大家介绍“什么是程序设计？如何实现程序设计？”。本课程以计算思维为导向，以应用问题为牵引，以能力培养为目标，实施 “传授知识与思维训练相结合，编程语言与程序设计相结合，自主学习与平台引导相结合”的教学模式。为了使大家对重点难点内容易于学习，对算法设计有直观理解，我们在课程里增设了虚拟实验栏目，大家注意每周的内容发布。也欢迎大家到北京理工科惠提供的虚拟实验工场平台去尝试更多的虚拟实验学习（https://www.vrsygc.com/index）。温馨提示：《C语言程序设计（上）》和《C语言程序设计（下）》是一个系统的课程，考虑学期时间限制和大家的时间安排才分为两个相对独立的部分。（上）完成的是程序设计的基础部分教学，可以独立学习。尤其对于初学程序设计的读者，可以先尝试学习，循序渐进。而《C语言程序设计（下）》则最好是在有了上的基础上进行学习，这样便于理解和有效跟进。我们安排先开放 （上），五周之后再开放（下），这样大家既可以系统学习，也可以按需选择。当然，对于有C语言基础的朋友，可以直接从（下）开始，或者通篇选择学习。（上）、（下）按两门课程管理，成绩和证书都是分别计入。欢迎大家在这里学习课程，分享快乐，贡献精彩！",
  "learners": 500000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据结构(上)",
  "url": "https://www.chinaooc.com.cn/course/687eb37816c43a09c0e581bc",
  "teacher": "邓俊辉",
  "school": "清华大学",
  "description": "数据结构是计算机科学的关键内容，也是构建高效算法的必要基础。其中涉及的知识，在相关专业的课程系统中始终处于核心位置。本课程旨在围绕各类数据结构的设计与实现，揭示其中的规律原理与方法技巧；同时针对算法设计及其性能分析，使学生了解并掌握主要的套路与手段。讲授的主题从基础的数据结构，一直延伸至新近的研究成果。",
  "learners": 500000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大学计算机基础",
  "url": "https://www.chinaooc.com.cn/course/678ed626225d72705e840285",
  "teacher": "周海芳",
  "school": "国防科技大学",
  "description": "人要成功融入社会，其所必备的思维能力是由其所处时代能够获得的工具决定的。计算机是信息社会的必备工具之一。2006年，美国计算机科学家Jeannette M. Wing正式提出了计算思维的概念和体系，该理论被认为是近十年来产生的最具有基础性、长期性的学术思想。未来不论是计算机科学家、专业人士、甚至每个普通人，必须学会运用计算思维解决工作和生活遇到的问题。“大学计算机基础”，作为高等教育的第一门计算机公共基础课程，承载着培养计算思维“第一课”的重任，已从过去唯工具论的应用时代全面进入围绕问题求解的思维训练时代，从知识传递的科普时代逐步转为能力导向的实训时代。\t\t国防科技大学的《大学计算机基础》课程，自2014年登陆中国大学MOOC以来，累计已受到超过20万人次的关注，并在2017年被首批认证为国家精品课程。2020年，本课程又重新起航全新改版，以前瞻的视角再次打造后信息时代的新“金课”。\t\t你一定问过自己这样的问题：信息在计算机里是以什么形式存在的？计算机是怎么工作的？我能让计算机为我所用吗？本课程正是围绕这些问题，以计算思维为主线，串联编排相关知识和技能模块，采用“问题引导”、“知识植入”、“增量设计”的讲授思路，设计了环环相扣的实践环节，以通俗易懂的语言、 精心制作的教具、生动有趣的案例和充满挑战的实验，试图帮助你深刻地认识计算和信息的本质、计算机运行工作的原理，带领你体验现实世界问题映射到计算机世界求解的过程、方法和技术，为你揭开计算世界的神秘面纱，痛并快乐地体验计算之美，最终理解并初步掌握计算思维方法。\t\t本课程将推出贯穿课程始终的基于python的闯关式能力实训路径，先以全国计算机实验案例竞赛获奖作品为基础带领大家快速入门，扫除编程障碍，接下来将信息表示与处理、计算机系统、网络、数据库、多媒体等传统的知识模块作为运用计算思维求解问题的研究对象加以实践，在问题求解的过程中凝练方法、内化知识。你在每一周跟随学习的过程中都会实际动手经历一些“实验关卡”，仿佛进入一个需要通关的游戏，直到打通最后一个关卡，问题才能完美解决。随着一个个任务关卡被攻克，你收获的将不仅仅是知识，更是意识的更新和思维的转变。因此，我们的课程不再以终结性的考核来衡量你的收获，过程比结果更重要，只要你敢于挑战，选取适合自己的通关难度，去夺取一个个课程徽章，就可以获得最终的考核认证。\t\t这个过程虽然不可能覆盖所有技能点的训练，但我们希望你把学习的重点放在分析问题的思路、求解问题的方法、知识迁移的能力上。“授之于鱼不如授之于渔”，通过本课程的学习，我们相信你将会得到这样的体会：在课程的引导下通关了一个个由简入繁的计算任务，建立起未来利用计算机和计算思维去独立完成更多、更复杂任务的意识和信心。",
  "learners": 500000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "程序设计与算法（一）C语言程序设计",
  "url": "https://www.chinaooc.com.cn/course/67b3c32b225d72705e35d302",
  "teacher": "郭炜",
  "school": "北京大学",
  "description": "C++语言的功能和方便性都强于C语言，只是由于其面向对象的特性比较复杂，因此很少被选为入门语言。实际上，C语言是C++的子集，C++对C语言的扩充可以分为与面向对象无关的新语法特性、面向对象的特性，以及泛型特性三个部分。如果放弃其中复杂的面向对象特性，以及泛型的绝大多数特性（但保留其中极其有用的标准模板库STL中的部分算法和容器），则剩余部分也十分适合做为入门语言来学，而且用这样的“简化”C++语言，或者说，“更强”的C++语言编写程序，既比用C语言更为方便和高效，又无需掌握写大型程序才会用到的庞杂的面向对象的特性 --- 学习成本增加很少而编程效率提高很多。基于上述考虑，本课程虽然内容主要为C语言程序设计，但还是涉及了一部分C++的内容。本课程以实打实提高学生的实际编程能力为目标，只要能写出好程序，用的是C语言还是C++语言，并不重要。授课内容13章，主要为以下两部分：1) 1-12章: C语言程序设计2) 13，14章 用C++的STL(标准模板库）轻松实现高效的排序和查找。这部分内容虽不多，但对于提高编写程序的效率极其有用。总之，本门课最大的特点是：让学习者花费比学习C语言多不到10%的时间，就能享受C++语言带来的更多方便与效率本课程作业和考试的题型90%以上都是在线提交程序，系统自动评测，容不得半点错误，这对学习者是非常严格而且有效的训练，符合当下顶尖IT企业招聘考核的形式，学习效果远胜于书面作业人工批改的形式。本课程作业和考试网址：cxsjsxmooc.openjudge.cn注意，不要写成 https://cxsjsxmooc.openjudge.cn/, 那样会访问不了！如果访问不了，就注意浏览器地址栏里面是不是写了 https:// 不能有s!郭炜老师还在中国大学MOOC开设另外三门好评如潮的4.9分高分课程，特别适合后续学习，请不要错过：1)    程序设计与算法(二)算法基础(国家精品)https://www.icourse163.org/course/PKU-10018940052)    程序设计与算法(三)C++面向对象程序设计(国家精品)https://www.icourse163.org/course/PKU-10020290303)    实用Python程序设计 (强烈推荐，Python的百科书式大全课程，入门、提高均非常适合！)https://www.icourse163.org/course/PKU-1460924165",
  "learners": 400000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "国家计算机二级Office高级应用",
  "url": "https://www.chinaooc.com.cn/course/680186cab836e5522a7c0cb6",
  "teacher": "王瑾",
  "school": "临沂大学",
  "description": "互联网+的全球浪潮下，熟练掌握办公自动化是时代人才的必备技能。现有计算机基础课程内容，已不能满足学生对于软件应用能力提升的需求。为学生参加全国计算机二级办公软件高级应用考试奠定良好基础。",
  "learners": 400000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "用Python玩转数据",
  "url": "https://www.chinaooc.com.cn/course/688d2c90f57d20271c3f39ed",
  "teacher": "张莉",
  "school": "南京大学",
  "description": "本课程主要面向非计算机专业的软件开发爱好者，不局限某个专业和学历层次，希望你已经学过一门程序设计语言，或有一些程序设计的基本概念如计算机求解问题的框架和一些如素数判断这样的基本算法，若缺少上述基础，在上课过程中需要根据课程进度补充相关知识并多多进行编程练习。整个课程以财经数据为基础，通过构建一个个喜闻乐见的案例，让大家可以以更直观的方式领略Python的简洁、优雅和健壮，同时探讨Python除了在商业领域之外在文学、社会学和新闻等人文社科类领域以及在数学和生物等理工类领域同样拥有便捷高效的数据处理能力，并可以触类旁通将其灵活应用于各专业中。整个课程分5个学习模块和1个项目实战模块，从Python基本语法开始，到Python中如何从本地和网络上进行数据获取，如何表示数据，再到如何对数据进行预处理，探索，分析与统计及可视化，到最后如何设计一个简单的GUI界面来表示和处理数据，层层推进。主要介绍或项目使用到的Python第三方库有：Requests，BeautifulSoup，re，NumPy，pandas，Matplotlib，sklearn，NLTK，Pillow绘图库，结巴分词，WordCloud词云图，Gensim等。",
  "learners": 400000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据结构(下)",
  "url": "https://www.chinaooc.com.cn/course/687eb38216c43a09c0e581d1",
  "teacher": "邓俊辉",
  "school": "清华大学",
  "description": "数据结构是计算机科学的关键内容，也是构建高效算法的必要基础。其中涉及的知识，在相关专业的课程系统中始终处于核心位置。本课程旨在围绕各类数据结构的设计与实现，揭示其中的规律原理与方法技巧；同时针对算法设计及其性能分析，使学生了解并掌握主要的套路与手段。讲授的主题从基础的数据结构，一直延伸至新近的研究成果。",
  "learners": 400000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Python编程基础",
  "url": "https://www.chinaooc.com.cn/course/67d0b9ad225d72705ec1b2a0",
  "teacher": "王恺",
  "school": "南开大学",
  "description": "Python是一种代表简单主义思想的语言，可以使用尽量少的代码完成更多工作。Python除了简单易学以外，还具有免费开源、跨平台性、高层语言、面向对象、丰富的库、胶水语言等优点，其已在科学计算、Web开发、数据分析、人工智能等方面有着非常广泛的应用。由于Python的上述优点，不仅大量计算机专业人员使用Python进行快速开发，而且非计算机专业人员也利用Python解决其专业问题。在本课程的讲授中，每一个知识点都提供了相关程序实例，希望大家能通过这些具体实例更好地掌握Python程序的编写方法。本课程的目标是使大家具备Python基础编程能力，并基本具备应用Python解决实际应用问题的能力，同时也为后继Python相关的更深入学习打下良好基础。课程特色包括：（1）针对每一个知识点提供了相关程序实例，使大家更直观地理解Python编程语言的基本语法和程序设计方法。（2）针对重点和难点知识，通过大量“提示”和“注意”向大家详细说明学习过程中不容易理解或容易混淆的内容。（3）各章提供了课后习题，供大家检验自己的学习情况，及时发现自己学习过程中存在的问题。（4）提供了网络爬虫、图书管理系统、图形化界面计算器、电影推荐等应用实例，使大家能够初步掌握系统开发和数据分析的相关方法和流程。通过该课程的学习，使学生掌握以下方面的内容：1．了解程序设计和Python语言的基本概念，掌握Python语言的注释方法、书写规范和标准输入/输出方法，理解第1章给出的示例程序并能够搭建Python环境运行这些示例程序。2．熟记Python的常用数据类型、能够定义并使用变量保存程序中的各种数据，掌握各运算符的作用、利用Python中支持的这些运算完成数据的处理，理解条件语句和循环语句的作用、在实际编写程序时能够灵活运用不同结构的语句完成实际问题的自动求解。3．理解函数的作用，掌握函数的定义与调用方法，能够区分形参和实参在使用上的不同，理解默认参数、不定长参数和返回值的作用并掌握其使用方法，理解包和模块的概念及作用并掌握模块的定义和使用方法，理解各种作用域下变量的作用范围。此外，对递归函数、高阶函数、lambda函数、闭包和修饰器这些高级应用也要有所了解，能够在合适的场合运用它们以更高效地编写程序。4．掌握类与对象的概念及它们的定义和使用，理解继承与多态的作用和实现，掌握类和对象的高级应用。5．理解可变类型和不可变类型的概念和区别，掌握列表、元组、集合和字典的使用方法，在实际编程时能够熟练运用切片、列表生成表达式、生成器和迭代器进行数据处理。6．掌握字符串创建、字符串比较等常用字符串操作方法，掌握占位符和format方法的使用，理解正则表达式的基础语法并掌握re模块的使用方法，能够利用正则表达式编写爬虫程序。7．掌握利用os模块进行目录创建、目录删除等与操作系统相关的操作的方法，掌握文件读写方法，理解一维数据和二维数据的概念，掌握CSV格式数据的读写方法，了解异常的作用和分类，掌握异常处理的实现方法。",
  "learners": 300000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机操作系统",
  "url": "https://www.chinaooc.com.cn/course/67ba5e1a225d72705e559aea",
  "teacher": "骆斌",
  "school": "南京大学",
  "description": "南京大学是中国最早从事，操作系统研发与教学的单位，1980年在中国首先出版了操作系统教程教材，至2020年该教材已更新至第6版。   如果您是计算机科学、软件工程、电子、通信、控制、信息系统、电子商务、计算与信息科学等信息技术相关专业的学生，可以系统地学习本课程基本部分的内容，如果您想致力于操作系统的研发工作，可以进一步学习高级部分的内容；此外如果您是计算机爱好者，可以根据自己的需要，按需学习本课程相关部分的内容，建立对计算机操作系统整体或部分的认知。  本课程的理论教学组织为六个部分：计算机操作系统概述、处理器管理、存储管理、设备管理、文件管理、并发程序设计。学习者能够认知操作系统的基本概念与实现原理，并深入理解操作系统的设计方法与实现技术。自2021年秋季学期起，本课程加入教育部-华为“智能基座”精品慕课建设项目，新增了基于华为开源操作系统openEuler的实例教学，作为本课程的第七部分。实例教学同样组织为六个部分，与理论教学各部分内容一一对应。   本课程有三个特点：第一，强调计算机软硬件协同设计技术，讲授操作系统各个模块的实现方法、策略与算法；第二，从大型软件系统构造的角度看待操作系统的实现，训练学生以折中的方法和方案，综合解决宏观问题的能力；第三，采用工程师的立场，强调操作系统的构造特征，即概念大于理论、技术大于算法、整体先于局部，培养学生综合解决实际问题的能力。欢迎大家修读本课程！",
  "learners": 300000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据库系统概论（基础篇）",
  "url": "https://www.chinaooc.com.cn/course/67bfa553225d72705e6f034e",
  "teacher": "王珊",
  "school": "中国人民大学",
  "description": "“数据库系统概论”是计算机科学与技术专业、软件工程专业、信息系统与信息管理等专业重要的专业基础课程。本课程将系统讲述数据库系统的基础理论、基本技术和基本方法。本课程的知识内容和技术方法，对从事现代数据管理技术的应用、开发和研究的人员都是重要而必备的基础。本课程内容丰富全面，分为基础篇和高级篇（2023年2月24日开课）2部分讲解，作为2门课程考核和计分。此外，本课程还开设了新技术篇（2023年3月3日开课），从数据管理和数据分析的角度讨论数据库新技术与大数据技术。通过数据库系统概论（基础篇）的学习，学员可以系统地掌握数据库系统的基本原理，能熟练使用SQL语言在某一个数据库管理系统上进行数据库检索和操作，掌握数据库安全性和完整性的基本概念和基本方法。并能够在某一个数据库管理系统上进行实验。通过数据库系统概论（高级篇）的学习，学员可以系统地掌握数据库规范化理论和数据库设计的方法与步骤，具有设计和开发数据库应用系统的基本能力；掌握数据库事务处理、并发控制与恢复的基本技术、初步掌握数据库查询处理和优化的概念。并能够在某一个数据库管理系统上进行实验验证。通过数据库系统概论（新技术篇）的学习，学员可以系统地掌握传统数据库技术的最新发展，大数据管理与系统的新概念、新技术和新应用。本课程的特点是，理论联系实际。我们不仅希望学员通过阅读和书面习题掌握本课程的内容，还要求学员完成实验项目。为此我们针对课程知识点设置了相应的实验，锻炼学员实际动手能力，启发学员对理论知识的思考和理解，达到理论联系实际的教学效果。本课程是教育部—华为“智能基座”精品课程之一。",
  "learners": 300000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机程序设计（C++）",
  "url": "https://www.chinaooc.com.cn/course/686ee46a16c43a09c09617c7",
  "teacher": "赵英良",
  "school": "西安交通大学",
  "description": "本课程以C++语言为载体，讲授计算机程序设计，为更好地利用计算机解决工程实践、科学研究和日常生活中的问题打下基础。从程序设计方法角度分，计算机语言有面向过程的和面向对象的。面向过程的思想是将任务分解成一系列的函数，函数通过相互调用联系起来完成任务。面向对象的思想是将任务分解成一系列对象，对象具有功能。对象间通过消息传递信息，触发事件，完成任务。面向对象的语言被认为具有更好的重用性、可维护性和可扩展性。C++是面向对象的语言。但也要注意，面向过程和面向对象不是截然分开的，不是对立的。面向过程是面向对象的基础。本课程前半部分的编程思想仍是面向过程的，这对初学者更容易入门；后半部分是面向对象的，为进一步学习奠定基础。学习程序设计，要学习语言的语法，更重要的是求解问题的算法思想。语法的学习需要多尝试，算法的学习需要多思考。学习程序设计，就要多编程。",
  "learners": 300000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机组成原理（上）",
  "url": "https://www.chinaooc.com.cn/course/686c3e6c16c43a09c088e23c",
  "teacher": "刘宏伟",
  "school": "哈尔滨工业大学",
  "description": "哈尔滨工业大学“计算机组成原理”课程是国家级精品课程，以国家级教学名师唐朔飞教授编写的“十二五”规划教材为基础，将教学课件、学习指导与习题解答、试题库等一系列辅助教学组成一体，深入贯彻“激发式”的教学方法，激发学生自主探索知识的积极性，使学生能自主地体会到“为什么用计算机→计算机能做什么→要有什么样的结构→结构如何细化为模块→实现模块需要解决的问题→如何解决”。通过基本技能训练、对部件综合设计和系统整体设计三个层次的培养，使学生具备扎实的基础理论、很强的独立工作能力和敢于创新的精神。",
  "learners": 300000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机组成原理",
  "url": "https://www.chinaooc.com.cn/course/687ab7f916c43a09c0d1b144",
  "teacher": "秦磊华",
  "school": "华中科技大学",
  "description": "“计算机组成原理”是一门理论性、工程性、技术性和实践性都很强的核心专业基础课程，在计算机学科系列课程中处于承上启下的作用。 课程教学目标是通过相关的教学活动，帮助学生理解计算机基本组成部件(包括运算器、控制器、存储器、输入/输出)的结构、工作原理、内部运行机制和设计方法。加深学生对计算机软、硬件系统的整体化理解，建立硬件/软件协同的整机概念，并有效增强学生的计算机系统设计能力。课程学习为研究生考试、后续课程（如系统结构，并行编程、嵌入式系统、接口技术）的学习，参加IT企业招聘等都奠定了坚实的基础。本MOOC 课程具有如下特点：1.面向系统能力培养的教学设计结合课程特点与教学目标，创造性提出基于构造观、系统观、工程观的教学设计。其中，构造观重在培养软/硬功能部件设计方法，提升部件级的设计能力；系统观强调硬件结构对软件执行正确性及性能的影响，提升学生软硬协同的系统分析与解决问题的能力；工程观训练考虑工程制约因素,选择恰当技术、优化工程的意识，提升系统实现能力。2.精心设计实验内容结合教学团队多年系统能力培养实践教学经验，参考国际一流计算机专业相关课程的先进经验，引入了易学易用的免费开源虚拟仿真实验平台，本着理论实践一体化、实验目标系统化、课内课外协同化等原则，建立了逐层递进、立足计算机系统、设计型实验为主导的实践教学体系开发了系列原创的课程实验，引导学生从逻辑门电路开始逐步设计运算部件、存储器、数据通路和控制器、流水线冲突冒险机制直至完整的MIPS 流水CPU来深入理解计算机软硬件系统。",
  "learners": 300000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "多媒体课件设计与制作",
  "url": "https://www.chinaooc.com.cn/course/680186dab836e5522a7c0cc8",
  "teacher": "孙崴",
  "school": "佳木斯大学",
  "description": "本课程2017年获批黑龙江省精品在线开放课程，2018年获批国家精品在线开放课程，2019年获批黑龙江省线上线下混合式一流课程，2020年获批国家本科一流课程。多媒体课件设计与制作是以多媒体技术为基础，把计算机技术的交互性和知识的可视化结合起来，以便促进信息的表达与传递。本课程的目的与任务是使学生通过学习，掌握常用多媒体工具软件的使用方法、多媒体素材的加工制作过程以及教学软件开发的流程和方法，本课程具有较强的实践性。教学任务不仅在于知识的传递，更重视学生创新能力和实践能力的培养，要求学生能熟练掌握软件的使用方法，设计和开发出有价值的教育产品，来解决一些实际问题。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "人工智能原理",
  "url": "https://www.chinaooc.com.cn/course/65fa1386bb5c5a8025bd34c5",
  "teacher": "王文敏",
  "school": "北京大学",
  "description": "人工智能是国内外著名大学计算机专业设置的骨干课之一，也是国内外著名高校和研究机构的主要研究方向之一。人工智能研究如何用计算机软件和硬件去实现Agent的感知、决策与智能行为，其理论基础表现为搜索、推理、规划和学习，应用领域包括计算机视觉、图像分析、模式识别、专家系统、自动规划、智能搜索、计算机博弈、智能控制、机器人学、自然语言处理、社交网络、数据挖掘、虚拟现实等。       本课程在系统回顾人工智能发展历程的基础上，重点介绍人工智能的核心思想、基本理论，基本方法与部分应用。 课程以该英文原版教材为主，并根据人工智能、特别是机器学习领域的发展和变化，编撰和充实了大量的内容。本课程共有12讲，采用双语教学，即中英文PPT和中英文作业等、中文讲授和交流。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大数据技术原理与应用",
  "url": "https://www.chinaooc.com.cn/course/688bdaff16c43a09c0278fee",
  "teacher": "林子雨",
  "school": "厦门大学",
  "description": "入门级大数据课程，适合初学者，完备的课程在线服务体系，可以帮助初学者实现“零基础”学习大数据课程。课程采用厦门大学林子雨老师编著的国内高校第一本系统性介绍大数据知识专业教材《大数据技术原理与应用》。课程紧紧围绕“构建知识体系、阐明基本原理、引导初级实践、了解相关应用”的指导思想，对大数据知识体系进行系统梳理，做到“有序组织、去粗取精、由浅入深、渐次展开”。课程由国内高校知名大数据教师厦门大学林子雨副教授主讲。课程内容（固定在每周一上午10点发布一章内容）：第一讲：大数据概述（2025年9月1日发布）第二讲：大数据处理架构Hadoop（2025年9月8日发布）第三讲：分布式文件系统HDFS（2025年9月15日发布）第四讲：分布式数据库HBase（2025年9月22日发布）第五讲：NoSQL数据库（2025年9月29日发布）第六讲：云数据库（2025年10月6日发布）第七讲：MapReduce（2025年10月13日发布）第八讲：Hadoop架构再探讨（2025年10月20日发布）第九讲：数据仓库Hive（2025年10月27日发布）第十讲：Spark（2025年11月3日发布）第十一讲：流计算（2025年11月10日发布）第十二讲：Flink（2025年11月17日发布）第十三讲：图计算（2025年11月24日发布）第十四讲：大数据在不同领域的应用（2025年12月1日发布）期末考试：2025年12月8日上午10点到12月13日晚上9点学习完本入门级课程以后，欢迎继续在中国大学MOOC平台学习后续的进阶级大数据课程《Spark编程基础》（课程地址：https://www.icourse163.org/course/XMU-1205811805）",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "高级语言程序设计（Python）",
  "url": "https://www.chinaooc.com.cn/course/62354d7c9906eace0490c32e",
  "teacher": "车万翔",
  "school": "哈尔滨工业大学",
  "description": "“高级语言程序设计”类课程面向无编程基础的学生，培养其运用编程语言解决实际问题的编程能力，使学生掌握一门编程语言的基本语法、语句、控制结构以及结构化程序设计的基本思想和方法，了解基本的算法和数据结构、良好的程序设计风格，具备熟练使用一门编程语言分析和解决实际问题的能力，从而无论以后在学习、工作中使用什么语言编程，都能灵活应用这些思想和方法，为进一步学习其他专业课程和今后从事软件开发工作打下坚实的基础。        过去近二十年的“高级语言程序设计”课程多是以C语言为主要的讲授对象，C语言具有代码简洁紧凑、执行效率高、贴近硬件、可移植性好等优点，广泛应用于系统软件、嵌入式软件等开发。        然而，随着计算机技术的发展和进步，我们可以使用它来解决越来越多的问题，计算机的应用场合也不局限于计算机学科，众多的学科被冠以“计算”之名，如计算生物学、计算化学等等。在这种情况下，C语言这种“低级”语言已经越来越难适应计算机发展的潮流，众多的“高级”语言被创造出来以解决更实际的问题。        另外，C语言由于其语法过于灵活，所需要掌握的细节概念非常庞杂，即使是实现最简单的功能，也要涉及很多概念。因此如果教师在教学中不能将学生从语法细节中摆脱出来的话，那么往往也会吓退很多初学者，不利于学习兴趣的培养。        最后就是尽管C语言对于学生掌握计算机底层的工作原理非常重要，但C语言相对比较“低级”，缺乏高级数据结构，因此要想解决更实际的问题，如字符串的处理、大规模的数据分析等，就需要编写非常大规模且复杂的代码，初学者往往会显得力不从心了。       因此，我们需要一种简单易学且能解决更实际问题的语言，Python语言恰好能弥补C语言的不足。具体地，和C语言相比，Python语言具有如下的优点：        1、简单易学：Python语言是一种代表简单主义思想的语言，极易上手。阅读一个良好的Python程序就感觉像是在读英语一样，尽管这个英语的要求非常严格。Python语言的这种伪代码本质是它最大的优点之一，它使学生能够专注于解决问题而不是去搞明白语言本身。        2、丰富的数据结构：除了基本的数值类型外，Python语言还内置了字符串、列表、字典等丰富的高级数据结构，利用这些数据结构，我们可以解决非常多的实际应用问题，如文本的处理、数据的分析等等。        3、逐渐流行：目前，有越来越多的项目使用Python语言开发。同时也有越来越多Python的类库被开发出来，这使得使用Python语言变得更加易用，对于提高计算机专业学生的学习兴趣和应用能力大有裨益。此外，Python语言设计之初就考虑到要能够方便地调用其他语言，因此可以方便地利用已有的其他语言编写的模块。        本课程除了讲授Python语言程序设计语言的基本要素，包括基本数据类型、运算、控制结构、函数外，还讲授数据结构的概念和应用、算法时空复杂性的概念以及图形用户界面、数据库和Web应用程序设计等实用的知识，使学生在学完本课程后，即可利用计算机解决众多的实际问题，甚至可以编写图形游戏、动态网站以及处理复杂的数据等。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机组成原理",
  "url": "https://www.chinaooc.com.cn/course/686d91ca16c43a09c08f7cd7",
  "teacher": "纪禄平",
  "school": "电子科技大学",
  "description": "一、课程的性质和目标1、课程类别：专业主干课①2018线上国家级一流本科课程（即线上金课）。②2019线上线下混合式国家级一流本科课程（混合式金课）。2、选课对象①大二以上计算机相关专业本科生；②计算机专业的考研者；③计算机相关领域的工程技术人员；3、教材的选择本课程的配套教材是纪禄平老师（课程主讲人）主编的最新版教材：《计算机组成原理》(第6版)，作者：纪禄平、罗克露、刘辉、张建，—北京：电子工业出版社，2024.07配套PPT请点击下列链接自动下载（百度云盘）：https://pan.baidu.com/s/1bva8xMaTbHNNciUbnFCUgw?pwd=8888﻿4、课程的意义：本课程是计算机专业的一门必修的学科基础课，它的前续课程是数字逻辑、大规模集成电路设计及应用、数据结构等，后继课程是微机原理与接口、计算机系统结构、嵌入式系统及应用等，在硬件范畴的课程体系中起承前启后的作用，也是学习与了解计算机软件课程（如操作系统、汇编语言程序设计等）的课程基础。5、课程的目标通过对本课程的学习，使学生掌握计算机硬件系统的基本组成，理解各功能部件的基本原理，掌握相关的逻辑设计方法，初步培养学生在计算机硬件系统方面的分析与设计能力，同时助推学习者参加与课程相关的各类考试（比如成教、自考、考研等）。二、课程的特色1、内容的组织采用了“总体框架→处理对象→硬件子系统”的逻辑架构模式，先对计算机系统进行总体概述，突出了系统级的整机概念，能使学习者首先建立起计算机硬件系统的整体框架，然后再讲授计算机的处理对象即数据的表示和运算，最后再分别讲授计算机系统的4个主要功能子系统的结构和工作原理。内容组织模式符合大多数课程学习者的认知规律和学习习惯，能提高学习者的兴趣，有助于学习者对课程脉络的把握和对知识点的理解。2、知识点的选用既遵照了我校计算机组成原理课程的教学大纲，同时也参考了硕士生入学考试专业课大纲，既强调基本知识和基本原理的学习，同时还兼顾了学习者参加考试的需求。3、内容的新颖性参考国内外经典教材，保留了计算机组成原理课程的经典内容，同时也竭力吸收了大量与时俱进的新颖内容来向学习者介绍计算机硬件系统的最新发展动态，以提高学习者的学习兴趣，有助于使学习者正确把握计算机的发展趋势。 三、学时安排与主要内容1、课程的学时数：64学时（共18周）2、主要内容：①计算机系统概述主要讲授信息的数字化表示、存储程序与冯诺依曼体制；计算机的诞生和发展；计算机系统的层次结构和硬件系统组织；计算机的主要性能指标。②数据的表示、运算与校验主要讲授数值型和字符型数据的表示，数据的运算方法，奇偶校验等常用的数据校验方法。③CPU子系统主要讲授CPU的结构和发展历程，指令系统，MIPS32指令集，单周期MIPS32处理器设计，提升CPU性能的一些高级技术，如多核技术等。④存储子系统主要讲授存储系统的层次和存储器的类型及技术指标，半导体存储原理及存储器，磁表面存储原理及磁盘，光存储原理及器件，存储系统性能的改进措施。⑤总线与I/O子系统主要讲授总线与接口，以及直接程序传送模式PIO、中断、DMA、IOP与PPU等。⑥I/O设备及接口主要讲授I/O设备的功能、类型及与主外信息交互，键盘工作原理，图像显示原理与显示器件（如CRT、LCD），各类打印设备等。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大学计算机基础",
  "url": "https://www.chinaooc.com.cn/course/630fe235325d39c27c417a7c",
  "teacher": "杨志强",
  "school": "同济大学",
  "description": "本课程是根据教育部教指委的要求开设的第一门计算机基础课程。       本课程吸纳了国内外最新的教学研究成果，兼顾了初学计算机的学生，反映了当代计算机学科的最新成就，具有厚实的课程内容体系，为学习后续计算机基础课程夯实基础。       本课程的教学目标是拓宽知识面、提高应用能力、培养创新能力，即：      （1）培养计算思维意识和能力；       （2）拓宽计算机基础知识面：介绍计算机的基本原理、技术和方法，引入计算机新技术和了解计算机发展趋势；      （3）培养计算机的基本使用技能：常用操作系统和应用软件的使用；      （4）提高计算机的应用能力：重点是网络、多媒体、数据库等技术的基本知识和应用；理解信息安全和程序设计方面的基本知识。       （5）通过实践培养创新意识和动手能力，为学习后继计算机基础课程夯实基础；      （6）最终目标是培养在各专业领域的应用能力。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "程序设计基础（C&C++）",
  "url": "https://www.chinaooc.com.cn/course/685c6520f8462332e071aa54",
  "teacher": "戴波",
  "school": "电子科技大学",
  "description": "本课程是程序设计C语言和C++语言的入门课程。兼顾基础理论和编程实践。基础理论浅显易懂，编程案例趣味性强。视频使用当下流行的集成开发环境visual studio 2015（vs2008-VS2019各版本皆适用）进行编程与调试工具。从分析问题，寻找解题思路，到编程、调试、运行，都借助于实际案例进行展示。特别是初期的编译错误的定位与解决策略，后面的运行错误借助调试工具进行查错、纠错等，通过一系列事例一一展开,很容易通过视频一步步的演示学会编程方法与调试技术。而调试技术的掌握是初学者的难点之一。完整的编程过程解决了初学者看教材明白，上机却无从下手的问题。\t\t不少同学学习C语言的难点在指针与函数。而随后的随处可见的C++的成员函数很自然的就解除函数方面的困惑。指针的难点在于和数组、函数等结合下的变化多端，加上指针使用非常容易出错，这种结合下的错误更多且难以解决。本课程先进行理论讲解，通过指针对内存的实际操作情况进行演示与分析，然后通过由浅入深的编程例题和作业逐渐掌握指针。\t\t学习C语言后，再学习C++，存在面向过程思想向面向对象思想转变的困难，造成学完C++还不能理解C++特点，也不能正确使用C++进行程序设计。本课程通过用C++语言改写前面C语言案例，对比理解二者的区别，体会C++的优势。然后用一个简单的图形界面游戏逐渐扩展功能，使其具有可玩性，功能的增加，使得C语言完成难度增加，而C++的类、继承、派生等面向对象技术却轻松实现这个游戏。通过编程实战掌握C++语言的优势，通过实际案例掌握面向对象思想，解决学而不知何用的困惑。更新提示: 1. 2018年9月后，上线的视频是全部重新录制，解决了以前视频声音有杂音的问题。2. 解决了教师授课声音问题。3. 根据同学们的反馈，本次所有视频和作业，测验，都一次性发布，供同学们自由选择时间学习。开学初期同学们时间比较充分，可以多学习内容，尽快完成作业，测验和考试。也方便后期才加入课程的同学不能参加作业，测验的问题。4. 首页的评价请参考2018年9月之后的评价，这个是新录制视频的评价，其他评价是以前声音比较差的视频的评价。5. 我们另外提供QQ群进行实时答疑，码图（电子科技大学的在线OJ)辅助同学们进行编程训练。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C语言程序设计(下)",
  "url": "https://www.chinaooc.com.cn/course/67b5151e225d72705e3c308b",
  "teacher": "李凤霞",
  "school": "北京理工大学",
  "description": "欢迎大家进入C语言程序设计第二部分的学习。相信大家已经掌握了C语言的基本语法，学会用三种基本结构编写程序，能够解决一般的数值处理问题、穷举问题等。 就如同学习汉语，大家已经学习了字、组词、造句，能够写短文了，接下来是怎样写长文章？对应C语言来说，我们如何设计较长的程序？如何解决相对复杂的问题？如何重复使用某一段代码？有人说编程是艺术，用C就可以写出很“美“的代码。例如如果我们不用循环结构，不用递归算法，能不能在屏幕上输出从1到1000？学完这部分，大家就可以试试啦。C语言的基本结构是函数，其基本含义是：一个软件可以由多个源程序（文件）组成；一个源程序（文件）可以由多个函数组成；函数就是一段具有某种功能的程序，除主函数之外，用户写的这段程序叫做用户定义函数，由函数名，参数，说明语句和执行语句构成。定义后的函数可以重复被主函数或其他函数调用。所以说，函数是实现模块化设计的基础。更为神奇的是，如果我们把函数的组成部分细化，列出一个树状的结构，你会发现你学过的C语言的基础知识内容都在里面啦，学过函数后，你也可以试试啊。怎么使用函数呢？函数的递归调用是难点，要掌握编写递归算法的关键，通过典型的递归问题掌握编写递归程序的技巧；其次要将前面各章中的一些题目用递归算法实现，通过对比分析，加深对递归的理解和掌握。接下来，我们学习指针。指针是C语音的特色，也是C语言中最灵活的地方。如何学习指针呢？ C语言中指针就是地址。大家要掌握指向变量的指针，指向数组的指针，指向函数的指针，指向指针的指针,指针数组等。注意从定义和引用的形式上区分不同功能的指针，要理解指针与数组的关系，以及定义了指针之后，如何引用变量的值等具体问题，结构、联合与枚举都是C语言中的构造数据类型，是基本数据类型的某种组合。链表是指针、结构体的高级应用，也是C语言各阶段语法知识的综合体现。链表就是动态的数据结构。要掌握链表如何定义，如何建立简单的单向链表，以及学会编写链表中节点的插入、删除等基本操作。在上述知识和练习基础上，练习编写小软件，例如：学生档案管理系统等。以往程序中对数据的操作均在内存上实现，随着程序运行的结束，变量的内存空间和变量的值均消失。C语言中可以利用文件实现数据在外存上的存取操作。首先要掌握文件的基本概念，其中重要的是文件型指针，文件通过文件指针操作。要学会使用文件读写函数，分别实现文件的按字符读写、按字符串读写、按数据块读写和按格式读写；还有文件当前状态的测试函数等，必须熟练使用这些函数。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "操作系统",
  "url": "https://www.chinaooc.com.cn/course/62d8abf6ce6ac77184c5ff50",
  "teacher": "向勇",
  "school": "清华大学",
  "description": "操作系统是计算机系统中负责管理各种软硬件资源的核心系统软件，为应用软件运行提供良好的环境。掌握操作系统的基本原理及其核心技术是研究型大学计算机专业本科毕业生的基本要求。 本课程是计算机专业核心课，以主流操作系统为实例，以教学操作系统ucore为实验环境，讲授操作系统的概念、基本原理和实现技术，为学生从事操作系统软件研究和开发，以及充分利用操作系统功能进行应用软件研究和开发打下扎实的基础。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "c#程序设计",
  "url": "https://www.chinaooc.com.cn/course/6892729df57d20271c59a4cc",
  "teacher": "唐大仕",
  "school": "北京大学",
  "description": "C#是一种优秀的面向对象语言，它继承了C++和Java等语言的优点，并与现代软件工程相适应。C#语言利用.NET作为运行平台，使得它在Windows图形用户界面、Web应用、数据库等方面有强大的功能。C#在企业信息化的软件开发中已广泛应用，成为主流的程序设计语言。本课程在介绍C#语言及面向对象的程序设计基本原理的基础上，使用Visual Studio作为程序设计工具，介绍各种常见的信息的处理方法，包括文本处理、图形绘制、图像处理、多媒体、搜索引擎、数据库应用、信息安全、企业信息化、电子商务、地理信息系统(GIS)、软件工程等。应用程序的例子紧密结合日常的学习和工作，生动有趣，难度适中。课程中除了理论知识外，更注重上机编程实践，通过实践来培养严密的逻辑思维能力，提高分析问题、解决问题、合作学习的能力。本课程的目标是：学习和掌握C#语言的原理和方法，以及C#在常见的各类信息的处理以及企业信息化的应用，掌握软件开发的过程、工具与规范方法。本课程2017年被教育部认定为“国家精品在线开放课程”。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C++程序设计",
  "url": "https://www.chinaooc.com.cn/course/6872cd3216c43a09c0a9ef08",
  "teacher": "魏英",
  "school": "西北工业大学",
  "description": "程序设计课程是大学计算机基础教育和计算机科学与技术专业基础的核心课程，是数据结构、算法设计、数学建模、软件技术等课程的前导课程。程序设计课程的教学目标是使学生能够使用一种开发工具熟练的进行软件开发，为学生将来的创新实验、毕业设计、科学研究提供了有力的技术支持。C++是国内外广泛使用的计算机程序设计语言。其功能强大、面向对象、数据表示丰富、代码运行效率高、可移植性好，适合编写系统软件和各类应用程序。在TIOBE排行榜上，C++语言多年来始终处于前五位。学习程序设计从C++入手，对于培养利用计算机求解现实问题的计算思维能力具有其他语言无法比拟的有点。且在完全掌握了C++语言之后，再学习其他程序设计语言就会轻车熟路了。C是C++的子集，因此在C++的授课中，有至少一半的内容是和C语言一样的。而国内C++程序设计课程的学时普遍较少，且讲授的重点一般都放在和C重叠的那一部分。对于C++比C多出来的内容往往只介绍类、继承等基本概念，而对于重载、多态、异常处理、数据流等内容言之甚少。本课程即针对这一问题，增加了C++独有的内容的比重，不但适用于在校大学生，且适用于工作中使用C++进行软件开发的人。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Web前端开发",
  "url": "https://www.chinaooc.com.cn/course/67c63b96225d72705e8eca20",
  "teacher": "孙俏",
  "school": "北京林业大学",
  "description": "（注：课程视频及资料未经授权不允许任何形式转载，谢谢！）\t\t\t\t\t“Web系统”就是基于网站形式的具有一定功能的系统，例如新浪、淘宝、携程等。这些系统中以网页形式呈现给用户的部分，就是“前端”。随着Web系统的普遍应用，包括移动端APP的快速发展，“Web前端开发”已经成为近些年最为重要的技术之一，人才需求量巨大。本门课程将介绍Web系统前端开发的核心技术。\t\t\t\t\t课程内容涵盖Web系统前端开发技术的HTML5、CSS3、JS、JQuery、Bootstrap等组成部分，其中HTML决定网页的结构，CSS决定网页的样式，JS决定网页的交互。课程采用其最新技术标准与应用。\t\t\t\t\t\t\t\t\t\t课程以校企联合主讲的形式，两位主讲教师分别来自于北京林业大学与达内时代科技集团，更好地融合了学院派的理论与企业级的应用，让课程深入浅出的由基础过渡到实际应用。\t\t\t\t\t课程由百度前端技术学院负责人提供技术支持，在课程最后将针对未来的学习路线与前端工程师需要具备技能与素质等问题进行讲解。\t\t\t\t\t课程顾问团队包括三位教师，以及助理研究生一名，将对课程内容、教学、练习、答疑、考试、评价等环节进行全方位支持与服务。    课程包括知识点、知识型案例、综合案例与企业实际案例，可支持两种主线进行学习，一种是以知识点为主，循序渐进的方式；一种案例式教学，课程中所有知识点均内嵌于案例中，可以由案例快速入门，带动知识点系统学习。在第二种方式下，也可以将部分知识点作为SPOC中，课下学习的部分。所有案例的源代码均可以在线下载。    课程知识点按照难易程度，分为两个等级，支持两种不同基础的学习。例如零基础的同学，建议从“Web前端开发”概论部分开始学习，有一定基础的同学，可以直接进入HTML部分学习，从而可以有足够学时延伸到JQuery、HTML5部分。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大数据算法",
  "url": "https://www.chinaooc.com.cn/course/67d5ffe3225d72705edb3503",
  "teacher": "王宏志",
  "school": "哈尔滨工业大学",
  "description": "大数据算法这门课程旨在通过讲授一些大数据上基本算法设计思想，包括概率算法、I/O有效算法和并行算法，让听课的同学们接触到和传统算法课程不一样的算法设计与分析思路，并且以最新的研究成果为导向，让参与这门课程学习的同学了解大数据算法的前沿知识。通过这门课程的学习，同学可以掌握大数据算法设计的基本思想，并通过本门课程的作业，掌握大数据算法设计与分析的技术。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C语言程序设计",
  "url": "https://www.chinaooc.com.cn/course/6792ce4e225d72705e9710eb",
  "teacher": "朱鸣华",
  "school": "大连理工大学",
  "description": "本课程是一门学习程序设计的入门课程，课程以C语言为载体，讲授程序设计的思想和方法，为学习者更好地利用计算机解决工程实践、科学研究和日常生活中的问题打下基础。大连理工大学C语言课程的教学团队根据多年的教学经验，精心打造了这门慕课课程，目的是帮助想要学习编程的朋友能够轻松、愉快的进入学习的状态，能够慢慢的喜欢上编程，逐步掌握利用C语言进行程序设计的方法，进而能够通过编写程序解决学习和工作中的实际问题。本课程针对线上教学的特点，进行了课程体系的重构和内容的提炼，实现了知识碎片化与系统性的有机结合。课程制作合理，运用了信息技术与教学的融合，采用大量示例并以屏幕操作形式描述设计思路、方法和过程，体现了启发性、动态化的多种展现形式。对于重点内容展开介绍，普遍问题详细分析，便于学习者对内容的理解。课程的测验、作业题目由浅入深，难易程度相当，既考虑到高校学分课程的学习，也兼顾到社会学习者的需求，还适合高校教师辅助课堂开展翻转课堂教学。学习给电脑编程的技术，是一项枯燥而实践性很强的工作，初学者可能会感到吃力，也许会遇到许多问题和困难，我们想跟大家说的是，如果你选择了这门课程学习，希望你能坚持下来，不仅要学习语言的语法，理解一些概念，更重要的是掌握求解问题的算法思想，要多编程上机实践，不断培养和提高自己计算思维和利用计算机解决实际问题的能力。相信你会慢慢爱上编程，收获成功和喜悦！你准备好了吗，让我们一起开启学习之旅吧！",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据库系统（上）：模型与语言",
  "url": "https://www.chinaooc.com.cn/course/679420d0225d72705e9d6aa5",
  "teacher": "战德臣",
  "school": "哈尔滨工业大学",
  "description": "本系列课程旨在使学生充分掌握数据库系统的基本概念和基本原理，熟练掌握数据库系统语言、数据库抽象与建模方法和数据库应用程序设计方法，培养学生在信息管理和信息系统方面的抽象、设计、开发、应用和管理能力。同时，数据存储、数据库查询实现、查询优化、事务处理等技术，这些内容也是计算学科学生在专业方面必须掌握的操纵数据库的能力，本课程也将为你详细讲授。\t本课程将分为四个部分进行介绍：\t一、基本知识与关系模型；\t二、数据库语言及其应用；\t三、数据建模与数据库设计；\t四、数据库管理系统实现技术。\t这四部分内容之间的关系如下图示意。\t\t这四部分内容将分为三门系列课程来开放。本课程《数据库系统（上）-模型与语言》将包括第一部分和第二部分内容。学习完本课程后，你可选择继续学习《数据库系统》系列课程的第二门《数据库系统（中）-建模与设计》或者选择继续学习《数据库系统》系列课程的第三门《数据库系统（下）-管理与技术》，这两门课为高阶课程，可以结合你的需求选择学习。\t\t\t\t\t\t本系列课程的特色：(1)本课程是一门理论性为基础、应用性为目标，理论应用相结合的计算机类主干课程；(2)抽象内容的实例化讲解是本课程的特色，通过大量具体示例，来阐释数据库相关的抽象概念和原理；(3)知识学习与案例点评相结合是本课程的特色，本课程包含数据建模和数据库设计相关的内容，重要的是知识的运用，案例点评则成为知识运用能力训练的重要手段； (4)问题导引的知识学习是本课程的特色，深入浅出，图文并茂，案例配合，面向问题地阐释数据库系统的核心内容。本课程将为学生从事大型信息系统软件的设计、开发和应用打下基础，也将为学生今后从事大规模数据的存储、操纵和分析奠定很好的基础。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "程序设计与算法（二）算法基础",
  "url": "https://www.chinaooc.com.cn/course/67b3c32d225d72705e35d303",
  "teacher": "郭炜",
  "school": "北京大学",
  "description": "仅仅熟练掌握程序设计语言并不能成为好的程序员。对于许多问题，如果没有好的算法，计算机只能低效地解决，甚至无法解决。因此，好的程序员，还应该对程序的灵魂 --- 算法有较好理解并能灵活应用。 本课程要讲授的就是枚举、二分、递归、分治、动态规划、搜索、贪心这七种基本的通用算法。各种复杂算法问题的解决，都可能用到这些基本的思想。本门课程面向需要进一步提高编程和算法水平的学习者。要求学习者已经掌握C语言，以及基本的程序设计思想，如简单排序、简单的递归。本课程中一部分的例题，难度与中学信息学奥赛NOIP提高组的较难题相当，也和ACM国际大学生程序设计竞赛中的中等题相当。掌握了本课程的内容，学员的算法水平和实现能力将超过国内大部分高校计算机专业本科毕业生。本课程作业和考试网址：cxsjsxmooc.openjudge.cn注意，不要写成 https://cxsjsxmooc.openjudge.cn/, 那样会访问不了！如果访问不了，就注意浏览器地址栏里面是不是写了 https:// 不能有s!郭炜老师还在中国大学MOOC开设另外三门好评如潮的4.9分高分课程，请不要错过：1)   程序设计与算法(一)C语言程序设计(国家精品)  https://www.icourse163.org/course/PKU-10015530230基础学习者应该先学习这门课程2)   程序设计与算法(三)C++面向对象程序设计(国家精品)https://www.icourse163.org/course/PKU-1002029030算法基础课中用到了一些面向对象的知识，不明白的可以先看看这门课3)   实用Python程序设计 (强烈推荐，Python的百科书式大全课程，入门、提高均非常适合！)https://www.icourse163.org/course/PKU-1460924165",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "人工智能：模型与算法",
  "url": "https://www.chinaooc.com.cn/course/68644e1d16c43a09c0615039",
  "teacher": "吴飞",
  "school": "浙江大学",
  "description": "人工智能(Artificial Intelligence，简称AI)是以机器为载体所展示出来的人类智能，因此人工智能也被称为机器智能(Machine Intelligence)。对人类智能的模拟可通过以符号主义为核心的逻辑推理、以问题求解为核心的探询搜索、以数据驱动为核心的机器学习、以行为主义为核心的强化学习和以博弈对抗为核心的决策智能等方法来实现。本课程成体系介绍人工智能的基本概念和基础算法，可帮助学习者掌握人工智能脉络体系，体会具能、使能和赋能，从算法层面对人工智能技术“知其意，悟其理，守其则，践其行”。课程内容包括如下：人工智能概述、搜索求解、逻辑与推理、监督学习、无监督学习、深度学习、强化学习、博弈对抗。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Java程序设计",
  "url": "https://www.chinaooc.com.cn/course/687eb37716c43a09c0e581b9",
  "teacher": "郑莉",
  "school": "清华大学",
  "description": "课程目标：掌握Java的基础语法、面向对象的程序设计方法；初步了解GUI程序开发方法；\n\t主要受众：程序设计初学者。无先修课程要求，如有一点编程基础更好。\n\t主要内容：\n1、Java语言基础知识；\n2、类与对象的基本概念；\n3、类的方法；\n4、类的重用；\n5、接口与多态；\n6、输入/输出流；\n7、Java集合框架；8、图形用户界面；",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据结构与算法",
  "url": "https://www.chinaooc.com.cn/course/66cfad06711dc30c347ce9fc",
  "teacher": "张铭",
  "school": "北京大学",
  "description": "计算机是现代社会中用于解决问题的重要工具，支撑这个工具高效运转的就是其后的各种系统程序、应用程序。图灵奖获得者N.Wirth写了一本经典著作“程序=算法+数据结构”。数据结构，是抽象的表示数据的方式；算法，则是计算的一系列有效、通用的步骤。算法与数据结构是程序设计中相辅相成的两个方面，是计算机学科的重要基石。本课程将带领我们围绕着“算法+数据结构=程序”的思路，以问题求解为导向进行学习。希望能够帮助大家提高理论、抽象、设计的能力。在扎实的经典理论基础上，运用问题抽象、数据抽象、算法抽象来分析问题，应用适当的数据结构和算法来设计和实现相应的程序。通过课程学习，大家的抽象思维能力、问题求解能力将得到较大提升，编程能力和代码质量会有质的飞跃！在求解实际问题方面，我们会学习到通过权衡时空和其他资源开销，利用数据结构来组织数据、设计高效的算法、完成高质量的程序以满足错综复杂的实际应用需要。本课程采用张铭主编的国家“十一五”规划教材《数据结构与算法》（高等教育出版社）。适合计算机以及相关理工专业的本科生学习，建议先修过计算概论等课程，最好具备C++等面向对象的程序设计基础。对于具有C语言结构化程序设计基础的学生，本课程第0章补充了一些面向对象的基本内容。课程所学到的内容会被利用到计算机科学后续的各个课程中，如操作系统、软件工程、数据库概论、编译技术、计算机图形学、人机交互等。希望可以为大家将来从事计算机相关的学习、研究和开发工作打下扎实的基础。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "人工智能实践：Tensorflow笔记",
  "url": "https://www.chinaooc.com.cn/course/62354d7a9906eace0490b4d6",
  "teacher": "曹健",
  "school": "北京大学",
  "description": "课程梳理出Tensorflow2搭建优化神经网络的八股，带你逐步完善代码，实现图像识别与股票预测。课程以录像形式讲解知识点，以录屏形式分析源代码，通过助教的Tensorflow笔记实现回顾与扩展。内容包括：深度学习、神经网络的基本概念原理和代码实现示例。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "程序设计与算法（三）C++面向对象程序设计",
  "url": "https://www.chinaooc.com.cn/course/67b3c32d225d72705e35d305",
  "teacher": "郭炜",
  "school": "北京大学",
  "description": "本课程讲授C++程序设计有关的概念和语法，使你能够使用C++语言，以面向对象的方法编写可维护性、可扩充性好的，较大规模的程序。要求学习者已经掌握C语言程序设计。这门课将带你掌握C++语言中类、对象、运算符重载、继承、多态等面向对象的程序设计方法，以及模板、标准模板库STL等泛型程序设计的机制，体会和领悟面向对象程序设计方法和泛型程序设计方法的优势。本课程作业和考试题都是在线提交程序，系统自动评测，容不得半点错误，这对学习者是非常严格而且有效的训练，符合当下顶尖IT企业招聘考核的形式，学习效果远胜于书面作业人工批改的形式。期末还有一个大型的游戏模拟程序作业《魔兽世界》，深受北京大学信息学院学生欢迎，能够很好地训练C++面向程序设计的技能。本课程作业和考试网址：cxsjsxmooc.openjudge.cn注意，不要写成 https://cxsjsxmooc.openjudge.cn/, 那样会访问不了！如果访问不了，就注意浏览器地址栏里面是不是写了 https:// 不能有s!郭炜老师还在中国大学MOOC开设另外三门好评如潮的4.9分高分课程，请不要错过：1)    程序设计与算法(一)C语言程序设计(国家精品)  https://www.icourse163.org/course/PKU-10015530230基础学习者应该先学习这门课程\t2)\t    \t程序设计与算法(二)算法基础(国家精品)https://www.icourse163.org/course/PKU-10018940053)    实用Python程序设计 (强烈推荐，Python的百科书式大全课程，入门、提高均非常适合！)https://www.icourse163.org/course/PKU-1460924165",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机应用基础",
  "url": "https://www.chinaooc.com.cn/course/650f674d374ed23bd75611c1",
  "teacher": "金大卫",
  "school": "中南财经政法大学",
  "description": "1、为什么要学习这门课回答这个问题前，我们先看一个案例：如果未来某一天，你需要完成的工作是判断一个数是否是质数，你会怎么做？你可能会在了解质数判断的原理基础上，每次花费几分钟或者更长的时间手动计算得到结果（取决于值的大小）。或者在完成本课程的学习后，花10分钟的时间使用Python语言编写一个小程序，随后每次只需输入待判断的数值即可等待结果的显示。就像蒸汽机的出现改变了人类的劳动方式，突破了人类体力的极限，计算机的出现突破了人类脑力的上限——无论是计算能力还是记忆能力。再聪明的人，终其一生计算的能力，可能不如普通计算机的几秒，就如质数的判断，当数值达到一定数量级后，手工计算已无能为力，而通过计算机编写的程序却能够在有限的时间内自动得到结果。记忆力再好的人，记忆容量绝对也比不上一个普通的硬盘。分析能力再强的人，最多能同时处理和考虑几十个特征与变量，而当前的深度学习应用模型参数普遍在千万以上。如今，每个人的能力渐渐并不完全取决于其头脑的真正强度，而决定于他是否会操作和理解计算机来解决自己的问题，即计算思维能力。在信息时代，如果对计算机及计算思维一无所知，这就像人闭着眼睛走路，任何时候都可能摔倒；而通过本课程学习计算机知识，了解它才能让我们更好地使用它。2、这门课的主题和内容 本课程以计算机基础原理及其信息技术工具为主题，通过以下六个部分介绍计算机的相关知识、操作方法与经典案例，并带领大家尝试使用相关工具和方法进行数据处理和分析，具体包括：（1）计算机基础知识：介绍计算机的产生和发展、分类和应用，计算机的数制和计算机内部数据的表示方法，介绍计算机软件系统和硬件系统，为学员们了解计算机历史与基本原理打下良好的基础。 （2）计算机网络：介绍互联网的概念、原理以及常见互联网上的服务，为学员们了解互联网技术，使用互联网打下良好的基础。 （3）Word文档编辑：介绍如何使用Word进行文字处理，文档创建，文档排版，文档美化，文档修订与批量处理等，为学员们提供丰富的文档编辑，排版与处理技术。 （4）Excel表格处理及数据分析：介绍如何使用Excel进行数据输入，函数计算，数据分析，排序、筛选、汇总等各类分析和处理技术，满足人们日常对数据存储，管理，查询与分析的需要。 （5）PowerPoint幻灯片制作：介绍如何使用PowerPoint对文字、图形、图像、色彩、声音、视频、动画等元素的应用，满足人们设计制作出高质量的产品宣传、工作汇报、教学培训、会议演讲等演示文稿的需求。 （6）Python程序设计语言及数据分析：介绍Python程序设计语言的基本语法结构、数据处理、分析相关工具和方法，满足人们使用Python等工具完成各行业、各领域数据处理、分析和统计需要，为运营决策提供依据和支撑。3、这门课可以为你带来什么学习这门课程之前，你可能会疑惑：计算机内部究竟有什么、微信里的聊天信息是怎么发送过来的、计算机里的程序是怎么工作的？我也能够编写属于自己的微信聊天程序吗？通过本课程的学习，你不仅可以找到这些问题的答案，还可以：1、使用Word编辑一篇格式规范、内容精美的文档作为你的毕业设计论文，让指导老师再也不用为你的论文格式而担心。2、使用PowerPoint制作一份美轮美奂的毕业答辩幻灯片，让答辩老师和同学刮目相看。3、使用Excel电子表格管理你的日常收支，让你再也不会迷茫钱都花到哪里去了。4、使用Python编写微信自动抢红包小程序，让你再也不用常常担心错过1个亿。5、使用Python编写爬虫爬取论坛上的租房信息，让你在考研时轻松找到适合自己的房源。......当然，学习本门课程并不能让你一下成为人们口中的电脑或者网络“大神”，但它能让你更了解你正在使用的电脑或手机，让你更明确应该如何更好的使用自己的电脑或手机，更重要的是能够让你清晰认识计算科学和信息科学，建立利用计算机解决专业问题的计算思维思考方式，这将为你今后的专业学习和职业发展提供帮助，甚至能影响一生！",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据结构与算法",
  "url": "https://www.chinaooc.com.cn/course/685c6522f8462332e071aa55",
  "teacher": "林劼",
  "school": "电子科技大学",
  "description": "《数据结构与算法》课程是计算机科学与技术的学科基础课程，不仅是《计算机图形学》、《计算机网络》、《编译原理》、《计算机操作系统》等后续课程的基础理论之一，其应用范围也早已扩展到图像处理与模式识别、海量数据挖掘、科学数据处理、复杂网络分析等许多计算机前沿领域。本课程研究计算机处理数据的结构特性，学习线性表、树、图等常用数据结构的逻辑结构与存储结构；学习分治递归、动态规划、贪心算法等典型算法，掌握分析与推导算法效率的方法。  通过对本课程的学习，能够解决非数值计算与工程应用问题，达到选择或设计恰当的逻辑结构、存储结构及相应的算法的水平，为学生进一步理论学习和解决实际工程应用问题打下坚实的基础。通过理论知识的系统学习与工程实验的操作，初步培养学生的计算思维能力、算法设计与分析能力、程序设计与编程实现能力、计算机系统的认知、分析、设计和运用能力、工程实践能力。课程由3位经验丰富的老师讲解，学生反馈通俗易懂，获得感强，没有专业基础的小白也能够听懂，考试形式好，教师回答学生问题积极，讨论区活跃能够学到很多东西，能够对问题得到及时有用的解答。课程每一期都根据教学经验和学生反馈进行改进，目前已经很完善。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "微机原理与接口技术",
  "url": "https://www.chinaooc.com.cn/course/68534cfab836e5522a0fcb42",
  "teacher": "吴宁",
  "school": "西安交通大学",
  "description": "在今天的信息化时代，计算机已成为了人类工作和生活中必不可少的一部分。计算机的主要应用方向之一是过程控制。工业过程控制的对象往往是一些连续变化的非电物理量，要使这类信号能够被计算机所识别和处理，需要经过一个复杂的过程。本课程面向有志于从事计算机过程控制系统设计、或对计算机硬件结构感兴趣的学习者，介绍包括计算机基础知识、微型计算机基本工作原理、存储器接口设计、输入输出接口控制技术等理论知识和设计方法，并最终实现简单I/O接口控制系统软硬件设计的初步能力。课程按周组织，共12周，涉及8个章节的内容，包括：微型计算机系统概述（含嵌入式技术概述）、微处理器与总线（含ARM处理器和两种型号的国产处理器介绍）、80x86基本指令集、汇编语言程序设计、半导体存储器、输入输出和中断技术、可编程并行数字接口、模拟量的输入输出。在最后一周，借助对有一定实际应用背景的综合设计案例讲解，实现对整门课程主体内容的融会贯通。需要特别强调的是：本课程属于“设计型”课程，需要对某些定义的记忆（如指令助记符），更需要对知识的理解，并融汇贯通。只有将课程所学知识真正理解并变成了自己的知识，才有可能按照要求去完成系统设计。本课程参考教材为与本线上课程资源融合的“书网一体化”新形态教材：吴宁，闫相国主编.《微型计算机原理与接口技术（第5版）》，2022.8，清华大学出版社",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大学计算机基础",
  "url": "https://www.chinaooc.com.cn/course/6883f34a16c43a09c0000111",
  "teacher": "陈雷",
  "school": "中国农业大学",
  "description": "《大学计算机基础》是一门计算机的通识核心课程，主要讲授计算机基本知识及常用软件使用。通过学习，掌握计算机的基本理论知识和基本操作技能，为培养计算思维和后续课程的学习打下坚实的基础。   本课程具有注重基本理论和基础知识、注重基本操作技能和实用能力等特点，可以培养学生的重视基本知识和重视计算机实际操作技能的基本素质，使学生树立理论联系实际的科学观点。考虑到农业、生物、理工类专业特点和后续课程学习的需要，有针对性的拓宽知识要求并加强程序设计基础内容介绍。",
  "learners": 200000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "网络技术与应用",
  "url": "https://www.chinaooc.com.cn/course/684b64f1b836e5522ae86e84",
  "teacher": "杨庚",
  "school": "南京邮电大学",
  "description": "本课程是理工科各专业的专业基础核心课程，是面向高校理工科专业的学生开设的一门计算机基础课程。本课程基于TCP/IP体系结构组织教学内容，全面反映当前主流网络技术，在实际的局域网以及因特网环境下讨论各种协议的工作流程、各种网络技术的工作机制及它们之间的相互作用过程，完整系统地介绍计算机网络领域中的技术和工作原理。本课程注重能力培养和互联网思维培养。涵盖新版全国计算机等级考试三级——网络技术、CCNA路由和交换认证的考试要求。为学生学习后续课程以及在生活、工作中提供网络相关的技术和应用能力的支撑。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C君带你玩编程",
  "url": "https://www.chinaooc.com.cn/course/6801873fb836e5522a7c0d54",
  "teacher": "方娇莉",
  "school": "昆明理工大学",
  "description": "逻辑勾勒绝美的境界，简洁绽放深邃的内涵。C君牵你的手，纵贯古今、融通中外，采撷精彩的代码，谱写人类智慧的诗篇。Error与Warning的迷惑、捕捉Bug的悬疑、算法成功的狂喜……我们将亲手为冰冷的机器注入灵魂、打开CPU的世界、探索1和0构建的二次元的神奇。结合专业知识、驱动硬件、兼顾NCRE证书的获取……是本课程现实与独特的美。C君等你，一起玩编程吧！",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据结构",
  "url": "https://www.chinaooc.com.cn/course/66e37313711dc30c34d6e5ae",
  "teacher": "李国徽",
  "school": "华中科技大学",
  "description": "数据结构课程是面向计算机科学与技术、信息安全、物联网工程专业的本科学生开设的专业核心必修课程。通过本课程的学习，使学生熟练地掌握在程序设计应用中，特别是在软件系统的非数值计算类应用方面，常用数据模型以及实现方法；熟练建模的基本方法以及在计算机科学与工程中的基本应用；在高级语言程序设计课程的学习基础之上，进一步提高程序设计的综合能力；在理论和方法上，奠定后续专业课程学习的基础。    总之，学好数据结构就对了。数据结构就相当于：要拧螺母，肯定用扳手这个“数据结构”，当然用钳子也行，只不过也没那么好用。学习数据结构，就是为了了解以后在IT行业里搬砖需要用到什么工具，这些工具有什么利弊，应用于什么场景。以后用的过程中，你会发现这些基础的“工具”也存在着一些缺陷，你不满足于此工具，此时，你就开始自己在这些数据结构的基础上加以改造，这就叫做自定义数据结构。而且，你以后还会造出很多其他应用于实际场景的数据结构。  本课程以清华大学严蔚敏教授编著的《数据结构（C语言版）》为教材，以章节划分知识点，每个知识点录制10分钟左右的视频，共有55个视频，每个章节知识点的列表可查看课程大纲。每章都有以考察知识点为目标的单元测试，以巩固、提高对基本知识的理解，并提供相应章节的PPT素材，供同学们深入学习。希望通过本课程，为学生学习后续课程打下扎实的基础。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机组成原理（下）",
  "url": "https://www.chinaooc.com.cn/course/686c3e6516c43a09c088e23b",
  "teacher": "刘宏伟",
  "school": "哈尔滨工业大学",
  "description": "哈尔滨工业大学“计算机组成原理”课程是国家级精品课程，以国家级教学名师唐朔飞教授编写的“十二五”规划教材为基础，将教学课件、学习指导与习题解答、试题库等一系列辅助教学组成一体，深入贯彻“激发式”的教学方法，激发学生自主探索知识的积极性，使学生能自主地体会到“为什么用计算机→计算机能做什么→要有什么样的结构→结构如何细化为模块→实现模块需要解决的问题→如何解决”。通过基本技能训练、对部件综合设计和系统整体设计三个层次的培养，使学生具备扎实的基础理论、很强的独立工作能力和敢于创新的精神。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "人工智能导论",
  "url": "https://www.chinaooc.com.cn/course/686ee13416c43a09c09617b1",
  "teacher": "王万良",
  "school": "浙江工业大学",
  "description": "人工智能是迅速发展的新兴学科，已经成为许多高新技术产品的核心技术。人工智能模拟人类智能解决问题，几乎在所有领域都有非常广泛的应用。本课程为入门级人工智能课程，适合初学者，可以帮助初学者实现“零基础”学习人工智能。本课程采用浙江工业大学王万良教授编著的专业教材《人工智能导论》（第5版），紧紧围绕人工智能的基本思想、基本理论、基本方法及其应用展开，并融合了人工智能的一些前沿内容。通过本课程的学习，可以掌握知识表示、确定性和不确定性推理、搜索、进化计算、群智能、人工神经网络、专家系统、机器学习等基本理论与实用方法，了解深度学习、知识图谱等人工智能研究前沿内容，通过人工智能应用实例及虚拟仿真实验，可以提高应用人工智能理论解决工程问题的能力。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "软件工程",
  "url": "https://www.chinaooc.com.cn/course/6892729ff57d20271c59a4cd",
  "teacher": "孙艳春",
  "school": "北京大学",
  "description": "欢迎大家选修北京大学开设的软件工程MOOC课程。随着信息技术的发展，软件已经深入到人类社会生产和生活的各个方面。软件工程是将工程化的方法运用到软件的开发、运行和维护之中，以达到提高软件质量，降低开发成本的目的。软件工程已经成为当今最活跃、最热门的学科之一。本次软件工程MOOC课程是一门导论性课程，我们将全面介绍软件工程所涉及的各方面知识，包括软件过程、软件需求、结构化分析和设计方法、面向对象分析和设计方法、敏捷开发方法、软件测试、软件项目管理、软件开发工具和环境。通过课程讲授，让大家初步了解软件开发和维护的方法学，为进一步深入学习各专题打下基础。课程还包含了实践环节，通过一个小型软件项目，大家可以体验软件开发的各个环节，并形成项目管理的意识。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "人工智能与信息社会",
  "url": "https://www.chinaooc.com.cn/course/67afd24a225d72705e22c747",
  "teacher": "陈斌",
  "school": "北京大学",
  "description": "本课程是教育部-微软产学合作协同育人项目成果，课程面向大学生和社会公众，结合社会热点和算法实践项目，介绍人工智能技术的基本概念、发展历史、经典算法、应用领域和对人类社会的深远影响，展示信息社会各领域中人工智能的应用发展前景，为大学生和社会公众提供一个深入理解人工智能的入门基础。本课程结合北京大学跨学科综合优势，加强与微软亚洲研究院人工智能研究人员的合作，将人工智能技术的原理、应用和前景融入各门基础自然科学和社会人文科学中，以鲜活生动的案例加深对人工智能技术的理解。慕课课程的讲解部分还邀请了微软亚洲研究院的人工智能研究专家，通过访谈形式，展现科学、技术、工程和商业等各个领域的专家对人工智能的理解和体会。课程注重算法实践，通过5个相对独立的人工智能典型应用项目，采用微软和其他开源项目提供的人工智能开发基础设施，结合丰富的应用数据，让学生能经过一段时间的学习，学习到成效显著且生动有趣的人工智能算法应用。\t\t\t\t\t\t\t洪小文，微软亚洲研究院院长洪小文博士现任微软全球资深副总裁，微软亚太研发集团主席，兼微软亚洲研究院院长，全面负责推动微软在亚太地区的科研及产品开发战略，以及与中国及亚太地区学术界的合作。洪小文博士于1995年加入微软公司。2004年，他加入微软亚洲研究院并担任副院长，2007年升任微软亚洲研究院院长。2005年至2007年间，洪博士创立并领导了微软搜索技术中心（STC），该中心负责微软搜索产品（必应）在亚太的开发工作。2014年洪博士兼任微软亚太研发集团主席。在加入微软亚洲研究院之前，洪博士是微软公司自然交互服务部门的创始成员和架构师，除了全面负责屡获殊荣的微软语音服务器产品、自然用户界面平台以及微软协助平台的架构及技术工作，他还负责管理和交付统计学习技术和高级搜索。洪博士于1995年加入微软研究院美国总部任高级研究员，并为微软的SAPI和语音引擎技术做出了突出贡献。此前，洪博士曾任职于苹果公司，带领团队研发出了苹果中文译写器。洪小文博士是电气电子工程师学会院士（IEEE Fellow），微软杰出首席科学家和国际公认的语音识别专家。洪博士在国际著名学术刊物及大会上发表过百余篇学术论文。他参与合著的《语音技术处理》（Spoken Language Processing）一书被全世界多所大学采用为语音技术教学课本。另外，洪博士在多个技术领域拥有36项专利发明。洪小文博士毕业于台湾大学，获电机工程学士学位，之后在卡内基梅隆大学深造，先后获得计算机硕士及博士学位。\t\t\t\t\t\t\t刘铁岩，微软亚洲研究院副院长刘铁岩博士，人工智能领域的国际知名学者。现任微软亚洲研究院副院长，国际电子电气工程师学会（IEEE）院士，美国计算机学会（ACM）杰出会员，美国卡内基梅隆大学（CMU）客座教授，英国诺丁汉大学荣誉教授，中国科技大学、中山大学、南开大学博士生导师。刘博士的研究兴趣包括：人工智能、机器学习、信息检索、数据挖掘等。他的先锋性工作促进了机器学习与信息检索之间的融合，被国际学术界公认为“排序学习”领域的代表人物，在网络搜索和计算广告学等方向取得了卓越的学术成果。他在该领域的学术论文已被引用万余次，并受斯普林格（Springer）出版社之邀撰写了该领域的首部学术专著（并成为Springer计算机领域华人作者的十大畅销书之一）。近年来，刘博士在博弈机器学习、深度学习、增强学习、分布式机器学习、符号学习等方面也颇有建树，发表了百余篇学术论文，被他引万余次。他的研究工作多次获得最佳论文奖、最高引用论文奖、研究突破奖，被广泛应用在微软的产品和在线服务中。他的团队发布了微软分布式机器学习工具包（DMTK）、微软图引擎（Graph Engine）等知名项目开源。他曾受邀担任了包括SIGIR、WWW、NIPS、KDD、AAAI、ACL等在内的十余个顶级国际会议的组委会主席、程序委员会主席、或领域主席；以及包括ACM TOIS、ACM TWEB、Neurocomputing等在内的国际期刊的副主编。他还是中国计算机学会（CCF）高级会员、杰出演讲者、学术工委，中文信息学会信息检索专委会副主任。张益肇，微软亚洲研究院副院长张益肇博士于1999年7月加盟微软亚洲研究院，从事语音方面的研究工作。 现任微软亚洲研究院副院长，负责技术战略部。履任微软亚洲研究院新职位之前，张博士任微软亚洲工程院副院长，是2003年工程院的创建者之一。在工程院，他带领团队开发Windows Mobile和 Windows的产品，并建立起一支多学科技术产品孵化的团队。在加入工程院之前，张博士曾担任研究院语音组主任研究员和高校关系总监，他的团队成功的把汉语普通话语音识别引擎转化到了中文版Office和Windows中。他曾是 Nuance Communications 公司研究部的创始人之一，该公司是电信领域自然语言界面研究的先驱。在 Nuance 工作期间，他曾从事自信度分析，声学建模，语音检测等领域的研究工作。他领导研究人员开发了 Nuance 产品的日文版本，这是世界上第一个开放式日语语音识别系统。他还曾在麻省理工的林肯实验室开发出了新的语音识别算法，在东芝 ULSI 研究中心发明了一种新的电路优化技术，在通用电气公司的研发中心开展了模式识别方面的研究。张博士毕业于麻省理工学院，获电气工程和计算机科学学士、硕士和博士学位。他在国际著名的杂志和学术会议上发表了多篇关于语音技术和机器学习方面的论文，是多项专利的拥有者。周明，微软亚洲研究院副院长周明博士，微软亚洲研究院副院长、国际计算语言学协会（ACL）候任主席、中国计算机学会理事、中文信息技术专委会主任、术语工作委员会主任、中国中文信息学会常务理事、哈尔滨工业大学、天津大学、南开大学、山东大学等多所学校博士导师。周明博士1985年毕业于重庆大学，1991年获哈尔滨工业大学博士学位。1991-1993年清华大学博士后，随后留校任副教授。1996-1999访问日本高电社公司领导中日机器翻译研究。他是中国第一个中英翻译系统CEMT-I（哈工大1989年）、日本最有名的中日机器翻译产品J-北京（日本高电社1998年）的研制者。1999年，周明博士加入微软亚洲研究院，不久开始负责自然语言研究组。他带领团队进行了微软输入法、英库词典（必应词典）、中英翻译、微软中国文化系列（微软对联、微软字谜、微软绝句）等重要产品和项目的研发，并对微软Office、必应搜索、Windows等产品中的自然语言技术做出了重要贡献。近年来，周明博士领导研究团队与微软产品组合作开发了微软小冰（中国）、Rinna（日本）、Zo（美国）等聊天机器人系统。周明博士发表了120余篇重要会议和期刊论文（包括50篇以上的ACL文章），拥有国际发明专利40余项。他多年来通过微软与中国和亚太地区的高校合作计划，包括微软-高校联合实验室、微软实习生计划、微软-高校联合培养博士生计划、青年教师铸星培养计划，与高校和学术组织联合举办暑期学校和学术会议等多种形式，对推动自然语言处理在中国和亚太的卓越发展做出了杰出贡献。潘天佑，微软亚洲研究院副院长潘天佑博士现任微软亚洲研究院副院长，全面负责微软亚洲研究院与亚太地区高校、研究机构及政府的学术交流和研究合作。他建立了一系列战略方针、积极探索商业机会，并构建了针对不同层面的多种学术交流和人才培养项目，以加强微软亚洲研究院与学术界之间的伙伴关系。 潘天佑博士还负责微软亚洲研究院与企业、投资机构和政府部门的深度技术合作。作为微软亚洲研究院 “创新汇”负责人，潘天佑博士致力于制定共赢的企业合作战略，搭建跨行业的沟通平台，探讨在数字化转型的大潮中，如何以技术创新实现共同发展。潘天佑博士拥有获得美国圣路易斯华盛顿大学（Washington University in St. Louis）电机工程博士学位。潘博士具有20余年计算机相关工作经验，曾成功创立两家专注于智能卡芯片和大规模银行系统的技术公司。潘天佑博士2005年至2007年曾任职微软亚洲研究院学术合作部。出于对人才培养和学术合作的激情，2012年潘天佑博士选择再次加入微软亚洲研究院。潘天佑博士连续十年担任台湾圣约翰科技大学校董，义务授课并就计算机技术和高科技创业发表演讲。潘天佑博士同时是一名信息系统安全专家，拥有CISSP等相关工业认证。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "程序设计基础",
  "url": "https://www.chinaooc.com.cn/course/677db884b60b1822c5ec08e4",
  "teacher": "苏小红",
  "school": "哈尔滨工业大学",
  "description": "每个人都应该学习给电脑编写程序的技术，因为这一过程能够教你如何去思考！                             ——史蒂夫·乔布斯   对一名软件工程师来说，什么是最重要的？是编程语言吗？如果你问100名工程师，那么100个人回答可能都是“No”。      编程语言层出不穷，不胜枚举，能够以不变应万变的奥秘何在？答案就是“编程之魂”。   传统的编程入门课，都是从教一种语言的基本语法开始的，试图通过语言来传达“编程之魂”，但这样也许你会将更多的精力用在理解语言的语法细节上，只见树木不见森林。   本课程是学习编程语言的基础，后面可以对接任何一门高级语言课程，本课程将学习编程之前你该了解的那些事，从具体的语言中独立出来，剥茧抽丝，取其灵魂，聚焦于程序设计思维的建立。   在其后继课程“C语言程序设计精髓”中，再以C语言为例，传授用语言表达思想的技术，聚焦于如何将编程之魂附着于C语言的躯体上。   期望通过这样的内容安排和讲解，你在学完以后不只是简单地掌握了一种语言的语法，还能理解隐含在语法背后的思想，并初步具备灵活使用这些思想进行编写程序解决实际问题的能力。      本课程面向的是零基础的人群，就像学钢琴要先学好乐理和练好指法而不要急于去弹小汤一样，我们会从你无论学习什么语言编程都应必备的基础知识讲起，这些内容不涉及代码，也与语言无关，但却对训练你的思维至关重要，学完这些你才能真正理解计算机为什么能解题以及计算机是如何解题的，而语言不过是实现这一求解过程的一种工具而已。当你回头看时，你会发现，学习编程的关键不是你能用自己熟悉的语言写出程序，而是能够针对要解决的问题，将问题转化为计算机求解的步骤。      你一定感到奇怪：不学语言，也可以学习程序设计；不写代码，也可以运行“程序”吗？   在本课程中，我们将借助基于流程图仿真的可视化工具raptor，用“编程之魂”武装你的大脑。   人生怎能没有一次说走就走的旅行？跟着“机器侠”，让我们一起向着快乐出发吧。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机系统基础(一)：程序的表示、转换与链接",
  "url": "https://www.chinaooc.com.cn/course/67c63c58225d72705e8eca73",
  "teacher": "袁春风",
  "school": "南京大学",
  "description": "本课程是“计算机系统基础”系列课程中的第一门，主要介绍高级语言程序中的数据类型及其运算、语句和过程调用等是如何在计算机系统中实现的。主要包含三个主题：（1）表示。不同数据类型（如带符号整数、无符号整数、浮点数、数组、结构等）数据在寄存器或存储器中的表示和存储；指令的格式、编码及其在存储器中的存储；存储地址（指针）的表示。（2）转换。高级语言程序中的过程（函数调用）、循环、选择等语句与机器级代码之间的对应关系。（3）链接。多个可重定位目标文件如何链接生成可执行目标文件并加载到系统中。\t\t\t\t\t通过本课程的学习，使学习者能从程序员角度认识计算机系统，能够建立高级语言程序、ISA、OS、编译器、链接器等之间的相互关联，对指令在硬件上的执行过程和指令的底层硬件执行机制有一定的认识和理解，从而增强在程序调试、性能提升、程序移植和健壮性等方面的能力，并为后续的“计算机组成与设计”、“操作系统”、“编译原理”、“计算机体系结构”等课程打下坚实基础。\t\t\t\t\t学完本课程后，学习者将对以下问题有比较深刻的认识，并能解决相关实际问题。程序中处理的数据在机器中如何表示和运算？程序中各类控制语句对应的机器级代码结构是怎样的？多个程序模块是如何链接起来形成可执行目标文件的？机器级代码及构成机器级代码的指令是如何在机器上执行的？",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机原理",
  "url": "https://www.chinaooc.com.cn/course/67a542a5225d72705eefeced",
  "teacher": "唐玉华",
  "school": "国防科技大学",
  "description": "“计算机原理”是国防科技大学面向计算机科学与技术、软件工程、网络工程、信息安全等专业开设的学科基础必修课程。2008年被评为“国家精品课程”，是首批“国家精品资源共享课程”，2018年被认定为“国家精品在线开放课程”。本课程从计算机硬件和软件两个角度来阐述电子数字计算机的运算器、控制器、存储器以及输入输出部件的组成结构、工作原理和实现方法，对于建立完整的计算机系统的全局观和深刻理解计算机系统的工作机理有着重要的作用。课程既有很强的基础性和系统性，又有很强的工程性和实践性，在计算机技术的学科基础课和专业课之间具有重要的承上启下的核心地位。本课程的基本理念是：采用“视频讲授＋在线练习＋习题课讲解＋实验设计”的四维融合教学模式，涵盖全国研究生统一考试大纲中的全部教学内容和实验内容；课堂讲授强调知识的基础性、系统性，以启发引导和案例分析为基本教学手段；在线练习和习题课注重在求解问题中的探索式学习和体验；实验设计突出工程性和实践性，利用网络平台进行师生互动，为同学们开展自主学习、跨学科专业选修课程、计算机原理考研复习提供支撑。“The most beautiful thing we can experience is the mysterious. It is the source of all true art and science. ” ------Einstein ﻿在这里，我们将为你揭开计算机的神秘面纱！",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C程序设计基础",
  "url": "https://www.chinaooc.com.cn/course/6889393a16c43a09c01a5ef0",
  "teacher": "黄洪艺",
  "school": "厦门大学",
  "description": "本课程是面向非计算机专业学生的程序设计课程，也可做为计算机专业学生的入门课，包括“C语言”和“程序设计”两部分内容，主要学习面向过程程序设计的方法，培养自主学习能力，训练计算思维，具有较强的实用性，有助于提高计算机的操控能力、推动计算思维的跨专业融合。本课程主要内容包括：C语言基础语法（词法、变量、运算符、算术表达式、数据类型）、顺序、选择、循环结构的编程及常见算法、函数的概念及应用、数组及应用，并简介指针、结构体、文件读写等知识。在有限的学时内，使学生有重点学习的同时，也能了解C语言的全貌。C语言是一门实践性很强的课程，学好C语言的最佳途径就是编程，多写多练。为使同学们更轻松地入门，本课程将更注重知识点的划分，精心安排讲解顺序，由易至难，引导学生快速进入编程状态。在每周的课前，课程团队会公布学习任务单，阐明本周学习目标、线上学习任务、线下任务，明确学习内容与步骤。同时，本课程的助教会及时地为大家答疑解惑。每周发布的内容，适合一周内掌握。通过循序渐进的学习，学习者将具有较好的编程能力和用计算机解决问题的能力，从而为进一步学习面向对象的程序设计及其它后续计算机专业课程奠定必要的基础。\t\t\t\t\t ‍",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机专业导论",
  "url": "https://www.chinaooc.com.cn/course/679420d3225d72705e9d6aa7",
  "teacher": "战德臣",
  "school": "哈尔滨工业大学",
  "description": "计算机专业导论是你进入大学学习计算机科学与技术学科的第一门课程，既是计算机专业的入门课程，又是计算机专业学习的指南。本课程将以新视角新思维，使你初步认识和了解计算机科学与技术学科，了解计算机科学与技术学科的基本思维、问题求解框架及典型的方法论，初步了解计算机科学与技术学科的研究对象及科学技术体系，初步了解计算机科学与技术学科的知识结构及能力培养思路，进而理解本科生计算机专业能力培养与课程设置思想、核心课程的定位及作用，提高后续课程的学习兴趣。有人说，“计算机专业就是学习各种‘计算机语言’，学习如何编写程序”，本课程试图纠正这种观念，引导你站在一定的高度看这些问题，给你建立一个清晰完整的“计算机世界观”，使你站得高看得远，看得远看得真。 也有人急于学习各种计算机知识，怎么这个我也不知道，那个我也不知道？有些知识不知道没有关系(想知道，通过百度、维基百科一搜就可以)，但关键的计算思维你不能不知道，本课程将为你介绍存在于计算机学科中的经典的伟大的计算思维，使你深刻理解计算机中的程序是如何运行的，机器为什么能够执行你编写的程序？这些思维对你将来“真正的会编程序”将起到基石的作用。当前，计算机专业的毕业生是最抢手的高薪人才(据美国权威机构统计2008-2018期间计算学科人才是最抢手的人才)，但学习计算机专业的我们为何却没有感觉得到呢？那是因为你只学会用一门语言书写程序，而没有对学科和专业有深入的理解，对专业的课程体系没有理解，那么哪些课程是最重要的课程呢，面对如此众多的课程，我该如何学习呢，本课程将回答你的这些疑问！本课程将以“机器自动计算==>机器难于计算==>计算与社会/自然的融合”为脉络，如下图示意，引导你建立“计算机世界观”，引导你理解和了解计算机专业究竟是做什么的。在有了一定的基础和认识后，为你介绍计算机科学与技术学科的研究方向和研究范畴。再进一步通过典型课程系列的介绍，为你指明如何培养自己计算机专业知识的路径。   你可以将本课程比作计算机类课程的“论语”：论语的重要性大家都知道，“半部论语治天下”，本课程的重要性不言而喻；论语是古人从小学习的，学习时理解有一定的难度，本课程也类似，因为对初学者而言将出现大量的概念和术语，但这是学习计算机专业必须跨过的一道门槛。只要你有耐心，只要你坚持听完课程的视频，你就能跨过这道门槛，你也一定能跨过这道门槛。本课程在原有课程视频基础上，新增加了计算思维系列讲座12讲，一方面使内容脉络性体系性更强，另一方面使同学思维体验更深刻，不仅理解计算思维而且能够联想应用计算思维。例如学习现代计算机，不仅是学习操作系统，更重要的是学习一种管理思维一种领导思维。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C++语言程序设计进阶",
  "url": "https://www.chinaooc.com.cn/course/687eb38216c43a09c0e581cf",
  "teacher": "郑莉",
  "school": "清华大学",
  "description": "C++是从C语言发展演变而来的一种面向对象的程序设计语言。面向对象的程序设计方法将数据及对数据的操作方法封装在一起，作为一个相互依存、不可分离的整体——对象。对同类型对象抽象出其共性，形成类。类通过外部接口，与外界发生关系，对象与对象之间通过消息进行通讯。这样，程序模块间的关系简单，程序模块的独立性、数据的安全性具有良好的保障，通过继承与多态性，使程序具有很高的可重用性，使得软件的开发和维护都更为方便。\n\t由于面向对象方法的突出优点，目前它已经成为开发大型软件时所采用的主要方法。而C++语言是应用最广泛的面向对象的程序设计语言之一。\n\t本课程是一门面向广大初学者的入门课程，自1999年开始在清华大学开设，本课程的教材已经在清华大学等一百多所学校的不同专业中使用，取得了良好的教学效果。\n\t本课程将C++语言作为大学生的计算机编程入门语言，不仅详细介绍语言本身，而且介绍常用的数据结构和算法、面向对象的设计思想和编程方法。课程以面向对象的程序设计方法贯穿始终，每一章都是首先阐述面向对象的程序设计思想和方法，由实际问题入手，然后引出必要的语法知识，在讲解语法时着重从程序设计方法学的角度讲述其意义和用途。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据库系统概论（高级篇）",
  "url": "https://www.chinaooc.com.cn/course/67bfa55b225d72705e6f034f",
  "teacher": "王珊",
  "school": "中国人民大学",
  "description": "“数据库系统概论”是计算机科学与技术专业、软件工程专业、信息系统与信息管理等专业重要的专业基础课程，也是非计算机专业学生的信息技术必选课程。   本课程将系统全面地讲述数据库系统的基础理论、基本技术和基本方法。本课程的知识内容和技术方法，对从事现代大数据管理技术的应用、开发和研究的人员都是重要而必备的基础。   \t本课程内容丰富全面，分为基础篇（2023年2月17日开课）和高级篇\t2\t部分讲解，作为\t2\t门课程考核和计分。此外，本课程还开设了新技术篇（2023年3月3日开课），从数据管理和数据分析的角度讨论数据库新技术与大数据技术。\t       通过\t数据库系统概论（基础篇）的学习，学员可以系统地掌握数据库系统的基本原理，能熟练使用SQL语言在某一个数据库管理系统上进行数据库检索和操作，掌握数据库安全性和完整性的基本概念和基本方法，并能够在某一个数据库管理系统上进行实验，培养学员熟练使用数据库的能力。        通过\t\t数据库系统概论（高级篇）的学习，学员可以系统地掌握数据库规范化理论和数据库设计的方法与步骤，具有设计和开发数据库应用系统的基本能力；初步掌握数据库查询处理和优化的概念、掌握数据库事务处理、并发控制与恢复的基本技术，\t\t并能够在某一个数据库管理系统上进行实验验证，培养学员管理、维护和优化大型数据库系统的能力。\t   通过\t数据库系统概论（新技术篇）的学习，学员可以系统地掌握传统数据库技术的最新发展，大数据管理与系统的新概念、新技术和新应用。    \t数据库系统概论（高级篇）从应用或使用数据库，从管理DBMS的角度来讲解关系数据理论、数据库设计方法、数据库编程和DBMS中有关查询处理、事务管理的基本概念和基本技术。课程分为数据库设计与应用开发、DBMS系统两大部分。前者讲解在开发应用系统中如何在已经选定的DBMS基础上设计数据库，如何基于数据库系统编程。作为数据库设计的重要指南，在这一部分开始，首先讲解了关系数据理论。后者则从使用和管理DBMS的角度，讨论DBMS的查询处理，事务管理，数据库恢复和并发控制等基本概念和基本技术，没有涉及具体的实现技术细节。   本课程的特点是，理论联系实际。我们不仅希望学员通过阅读和书面习题掌握本课程的内容，还要求学员完成实验项目。为此我们针对课程知识点设置了相应的实验，锻炼学员实际动手能力，启发学员对理论知识的思考和理解，达到理论联系实际的教学效果。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C++语言程序设计（上）",
  "url": "https://www.chinaooc.com.cn/course/668729bc711dc30c3439a1fc",
  "teacher": "阚道宏",
  "school": "中国农业大学",
  "description": "《C++语言程序设计》（上）是学习程序设计的入门级课程。学习本课程，就是让我们从使用程序的用户（user）角色提升到设计程序的程序员（programmer）角色。学习本课程，不需要什么特别的基础知识。计算机是一种能够按照指令完成计算的机器。指令由人（称为程序员）下达，由计算机中的电子电路（称为硬件）识别和执行。程序员可以将多条指令编排成一个指令序列（称为程序），一次性提交给计算机，由计算机自动按顺序连续执行。这样，计算机就变成了一种在程序控制下自动工作的机器，是从手动到自动的跨越。本课程重点学习程序设计的基本原理和方法，并学会使用C++语言来编写实际的计算机程序。程序员可以作为一种职业，一种很不错的职业。程序员也可以是一种爱好，非常锻炼您的智力。让我们一起来学《C++语言程序设计》吧！================================================“程序设计能力培养”系列MOOC课程学习指南：【编程三级跳】！【编程三级跳之一】：《C++语言程序设计》（上）、（下），通过C++语言学习程序设计基础和面向对象程序设计。参考教材：《C++语言程序设计（MOOC版，第2版）》，阚道宏编著，清华大学出版社，2017年10月。ISBN 9787302475620。【编程三级跳之二】：《Java语言程序设计》，通过Java语言学习如何使用别人的类库（Java生态圈）来快速开发应用程序，例如图形界面、多线程、网络编程、数据库编程、单元测试等，培养应用型编程能力。参考教材：《Java语言程序设计（MOOC版）》，阚道宏编著，清华大学出版社，2019年9月。ISBN 9787302530176。【编程三级跳之三】：《机器学习及其Python实践》，已在清华大学“学堂在线”平台正式上线（通过浏览器、微信小程序或手机App搜索“学堂在线”，进入平台后搜索课程“阚道宏”即可免费进入课程学习），这门课程重点讲解机器学习的基本原理和前沿思想，并使用Python语言开展机器学习编程实践，培养研究型编程能力。参考教材：《机器学习及其Python实践（微课视频版）》，阚道宏编著，清华大学出版社，2022年8月，ISBN 9787302604068。学习三门课程，实现【编程三级跳】：程序设计基础→应用程序开发→专业研究开发！",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Python科学计算三维可视化",
  "url": "https://www.chinaooc.com.cn/course/67c0f4fc225d72705e755e25",
  "teacher": "黄天羽",
  "school": "北京理工大学",
  "description": "第17期课程开课啦！尽快加入我们吧！\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tVisualization is the sight of Data。对于很多科学和工程问题，三维可交互的表达将是分析和深入理解问题的重要步骤，也是数据最好的可视化方式，科学计算揭示真理，一起来让真理更加立体吧！\t\t\t\t\t\t\t\t本课程面向科学和工程背景的编程学习者，讲解利用Python语言对科学计算数据进行表达和三维可视化展示的技术和方法，帮助学习者掌握利用三维效果表达科学和工程数据的能力。\t\t\t\t\t\t\t\t本课程介绍Python计算生态中最优秀的科学计算分析和三维可视化技术，三维可视化\t在理学、工程、医学等学科领域应用极其广泛，包括必修内容和选修内容两部分。\t\t\t\t\t\t\t\t必修内容包括：\t\t\t\t\t\t\t\t（1）Python第三方库TVTK，\t讲解科学计算三维表达和可视化的基本概念；\t\t\t\t\t\t\t\t（2）\tPython\t第三方库Mayavi，讲解科学计算三维表达和可视化的使用方法；\t\t\t\t\t\t\t\t（3）Python第三方库TraitUI，讲解交互式科学计算三维效果应用的开发方法。\t\t\t\t\t\t\t\t选修内容介绍：\t\t\t\t\t\t\t\tPython第三方库SciPy，初步介绍最强大的科学计算工具箱。\t\t\t\t\t\t\t\t可视化案例展示：\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t渲染管线理解：\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t三维数据展示：\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t该课程希望传递\"理解和运用计算生态，\t培养集成创新思维\"的理念，重点培养学习者运用当代最优秀第三方专业资源，快速分析和解决问题的能力。\t\t\t\t\t\t\t\t“人生苦短，不要刀耕火种”，黄老师教你直面问题和需求，用最好的工具解决它！\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPython语言系列专题课，带给你不一样的学习体验！>>Python 网络爬虫与信息提取（国家精品在线开放课程，国家级一流线上课程）https://www.icourse163.org/course/BIT-1001870001>>Python 科学计算三维可视化（国家精品在线开放课程，国家级一流线上课程）https://www.icourse163.org/course/BIT-1001871001>>Python 数据分析与展示https://www.icourse163.org/course/BIT-1001870002>>Python 机器学习应用（国家精品在线开放课程，国家级一流线上课程）https://www.icourse163.org/course/BIT-1001872001>>Python 游戏开发入门https://www.icourse163.org/course/BIT-1001873001>>Python 云端系统开发入门https://www.icourse163.org/course/BIT-1001871002",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "网络技术与应用",
  "url": "https://www.chinaooc.com.cn/course/688d2ba3f57d20271c3f39c9",
  "teacher": "沈鑫剡",
  "school": "沈鑫剡",
  "description": "《网络技术与应用》课程基于TCP/IP体系结构组织教学内容，全面反映当前主流网络技术，在实际的网络环境下讨论各种协议的工作流程、各种网络技术的工作机制及它们之间的相互作用过程，完整系统地介绍计算机网络领域中的基本概念、基本知识和基本原理。注重能力培养和互联网思维培养。涵盖新版全国计算机等级考试三级——网络技术、CCNA路由和交换认证的考试要求。    教学过程中引入软件实验平台Cisco Packet Tracer和华为eNSP，直观演示IP分组端到端传输过程中交换机、路由器等网络设备处理IP分组的每一个步骤、各层PDU的细节和变换过程。分别演示用Cisco网络设备和华为网络设备设计、配置和调试各种规模的网络的过程。采用案例牵引的教学方法，每一讲内容融入案例中，通过案例的实现过程，逐步展示运用各个知识点解决问题的方法和过程，及知识点之间的相互关系。    通过课程学习，使学生掌握通过全国计算机等级考试三级——网络技术、CCNA路由和交换认证考试的知识基础，同时具备以下能力：    1、用无线局域网、交换式以太网技术设计类似校园网这样的互连网络的能力；    2、用ADSL或以太网解决Internet接入的能力；    3、设计一般互连网的能力；    4、用路由器的分组过滤功能或防火墙解决一般的网络安全问题的能力；    5、配置应用服务器的能力；    6、计算思维能力。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C语言程序设计——快速入门与提高",
  "url": "https://www.chinaooc.com.cn/course/62354d7c9906eace0490c9f2",
  "teacher": "吕春利",
  "school": "中国农业大学",
  "description": "为什么要学习C语言1、C简单好学，上可表达人的思想，下可管理硬件，是顶天（人）立地（机）的语言。2、C和操作系统Unix是孪生兄弟，所有操作系统包括Windows，Android，IOS都是C写的。懂C语言，让你更好的理解这些系统。3、C是几乎所有其他语言的母语言。掌握C，让你对其他语言触类旁通。4、过去50年中，在众多编程语言中，C的流行度始终稳居前3.5、不学C语言，你会后悔。为什么我们叫“快速入门和提高”关于“快速入门”：1、方法上，强调学习编程是：即模仿-理解-仿写-创造这样的自然过程，教学设计贯彻这一思路。2、时间上，我们拚弃了C的一些鸡肋语法点，比如a=i++ + ++i;之类的语法游戏；节约了时间。关于“提高”：1、全新的视角来设计C语言课程，从“我学C语言”——》“我用C语言”——》“我玩C语言”。2、在训练编程思维上，我们设计很多案例，比如用计算机做模拟实验，用计算机去推理，递归函数的设计思路等。3、我们的目标：在大家学习C语言的同时，理解计算机对人类进步的贡献，憧憬计算机服务人类的未来。“课程介绍视频”更具体的展现我们的教学方法。学习计算机程序设计的理论意义：智能及智能的本质是古今中外许多哲学家、脑科学家一直在努力探索和研究的问题，但至今仍然没有明显进展，以致智能的发生与生命起源、宇宙的来历、物质的本质一起被列为自然界四大奥秘。让我们从信息科学角度去认识智能，思考智能的本质，探索人工智能到底发展到什么程度。 尽管飞机不能扇动翅膀，也能像鸟一样的飞翔；同样，谁又能说没有神经细胞的计算机不会思考？学习计算机程序设计的现实意义：机械设备是人手和腿的延伸，计算机是人脑的延伸，我们可以用计算机控制远在火星上的火星车；我们可以用计算机去给百万高考考生去排榜；我们可以让机器从销售记录数据中发现，尿布和啤酒放在一起可以提高超市销售量；我们可以把已知的事实交给计算机，让它来推理谁是犯罪分子；当计划生育政策有新政策发布时，我们可以让计算机去模拟，这个政策对人口数量和结构的影响。 纵观从计算机——》互联网——》可穿戴设备的IT发展史，信息产业在可预见的将来一直是朝阳产业，这个产业中英雄辈出，且不那么依赖拼爹。总之，懂计算机程序设计，利于你创业或找工作。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据结构",
  "url": "https://www.chinaooc.com.cn/course/67b669dd225d72705e428d59",
  "teacher": "耿国华",
  "school": "西北大学",
  "description": "我们生活的现实世界中所有物质都可以抽象为数字、文字、声音、图像和视频,这些数据存储在计算机中，构成了信息世界，经过处理后又服务于我们社会生活的方方面面。计算机科学是一种创造性思维活动，其教育必须面向设计。数据是表征客观事物的可记录可识别符号集合。数据是信息处理的核心基础。数据结构和算法是计算机科学的基石，贯穿了分析问题解决问题的计算思维。\t\t数据结构作为学科的专业基础核心课程，对应于学科中问题求解的理论、抽象和设计的方法论，在学科知识体系中具有核心的重要位置。课程一般开设在二年级，应对前面学习的软件技术总结提高，为后续专业课程提供基础，培养基本数据结构分析能力和综合程序设计实现能力，体现着创造性思维的信息素质培养过程，是计算机科学与技术人才素质框架中的脊梁骨。它承上启下，贯通始终，对学生能力培养至关重要，受益终身。\t\t\t\t\t\t\t数据结构及其处理算法是设计与实现系统软件和大型应用软件的重要基础，“数据结构与算法”课程是计算机专业重要的专业技术基础课程。该课程的内容对于培养学生的计算思维、系统分析与设计、算法设计与分析、程序设计与实现等学科基本能力非常重要。本课程系统地介绍了软件开发中常用的数据结构以及相应的 存储结构和操作算法，包括常用的查找技术、排序技术、递归技术等。\t\t掌握“数据结构”中的基本概念、合理组织数据的基本方法、高效处理数据的 基本算法、常用的经典算法、通用的程序设计技术，以及面对实际问题时选择恰当数据结构并设计高效算法的能力，培养学生用计算思维分析问题的能力，提高学生 上机解决较大规模实际问题的能力，为进一步的软件开发打下坚实的基础。\t\t\t1.课程体系\t\t\t课程突出数据组织方法与实现技术构成，慕课约26个学时，由基本概念、基本结构（线性、树、图）和基本技术（查找、排序）三大部分组成。基本概念部分重点讲述数据结构定义、内容、方法、评价以及前续基础与课程要求，明确数据结构什么、学什么、怎么学数据结构。基本结构部分重点讲述线性结构、树、图的逻辑结构、存储结构及其加工处理基本算法。基本技术部分包括查找和排序两类经典技术，贯穿了参数传递、指针处理技术、数组应用、递归与队列等重要的程序设计技术；力求表现经典算法思路，为学习者继续展拓提供线索。M课视频每讲均附有小结，每章均有典型题例，便于总结提高。\t\t2.教学团队\t\t课程负责人和主讲人是国家教学名师耿国华教授，她主讲数据结构课程30余年，主持建设了《数据结构》国家精品课程与国家精品资源共享课程，主编数据结构教材4部，课程教学资源被我校和几十余所高校采用。课程团队成员均为从事数据结构课程教学的一线教师，教学经验丰富，能很好胜任线上辅导工作。\t\t3.课程特点\t\t数据结构的学习过程是进行复杂程序设计的训练过程。技能培养的重要程度不亚于知识传授。难点在于让学生理解、习惯、掌握构造思维算法方式。针对《数据结构》技术性与综合性较突出的特点，耿教授倡导实施了“指导—大运动量实践—反馈”教学法。通过作业练习、课堂练习、课程实习、课程设计实践过程，促进了学生逻辑抽象能力的培养。\t\t4.课程定位\t\t数据结构与算法”是计算机学科的重要骨干基础课程，是本科教学的重中之重。作为计算机学科一个重要的分支，“数据结构与算法”课程涉及构筑计算机求解问题过程的两大基石：刻画实际问题中信息及其关系的数据结构和描述问题解决方案的逻辑抽象的算法。\t\t5.资源特色\t\t建设了支撑教学过程与自主学习两个面向的立体化教学资源,随书配备资源光盘、新形态教材、多媒体动画课件等资源支撑教学过程。\t\t面向教学过程资源：与课程内容特点相适应的Flash多媒体课件。提供选件控制方式，便于教学内容重组。以动画展现算法，便于对抽象算法本质的理解。\t\t面向自主学习扩展的教学资源：涵盖练习测试、同步训练、教学大纲、课堂视频、参考文献、相关题库等教学资源，促进学生线上线下主动学习，入门提高。\t\t让我们一起进入数据结构课程的学习，共同提高计算思维能力。\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t图1 “数据结构与算法”知识体系图\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t图2“数据结构与算法”与其他课程的关系",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "平面图像处理——PS高手",
  "url": "https://www.chinaooc.com.cn/course/67b3c511225d72705e35d583",
  "teacher": "李望秀",
  "school": "南华大学",
  "description": "hotoshop 广泛应用于广告设计、影视动画、UI设计等各个领域，本课程以满足本科院校相关专业学生、社会学习者和从业人员的需求为宗旨，以数字图像处理为主线，用62个知识点，44个案例对图像后期处理的知识结构体系进行了重构和整合，使学习者理解数字图像的原理，掌握常用的图像处理技巧，练就高深的图像创作能力，形成良好的人文艺术修养。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大学计算机",
  "url": "https://www.chinaooc.com.cn/course/68534cfbb836e5522a0fcb43",
  "teacher": "吴宁",
  "school": "西安交通大学",
  "description": "从有数字诞生那天起，就开始有了计算。今天，计算可以说已经无处不在，无处不在的计算设备，无处不在的网络和通信，已经彻底改变了人类数千年的生活习惯。人们希望通过无处不在的计算，能随时随地获得自己希望的服务，而提供这些服务或者计算的重要载体就是计算机和将各种计算装置连接在一起的网络。我们每个人的手机里有计算机，我们使用的如洗衣机、电冰箱等大多数家用电器设备里有计算机，我们开的汽车里也有计算机，在很多高强度、高危险的工作岗位上活跃着的机器人，都是由计算机在控制。另外，我们能够借助QQ、Skype等各种即时通信工具和Email等软件与世界各地的朋友保持联系，能够通过“百度”、“Google”等搜索引擎查阅各种信息，真正做到“秀才不出门，方知天下事”。这一切的一切，都是借助于计算机和遍布全球的互联网络。因此，计算机已经成为了人类生活中不可缺少的一部分。无论你在学习什么专业，也无论你正在或将会从事什么工作，计算机都必定会陪伴你的每一天，成为你生活和工作中不可缺少的伙伴和助手。所以，了解计算机，建立和掌握利用计算机求解问题的基本思路和方法，必将给你的学习和研究带来无限的便利。这门课程将带给你哪些内容？\t\t\t\t\t\t\t\t\t“大学计算机”是“计算机基础系列课程群”的第一门课程，也是学习计算机的入门级课程。这门课程\t以数据的表示、存储、处理、分析为主线，包括“计算机基础知识”、“C语言程序设计”和“数据分析方法\t”等三个篇章。课程主要介绍\t计算与计算模型、信息表示与编码、冯诺依曼结构、操作系统基础、互联网技术基础、数据管理与数据分析等知识，包括部分\t数据分析算法思想、开源算法库和数据分析工具。在此基础上，课程详细讲述了C语言程序设计方法。从程序设计的基础知识入手，介绍C语言基本编程方法，以及算法与数据结构基础。各种智能设备每时每刻都在产生着大量的数据，如何从海量数据中发掘出有用的信息，是实现人工智能的基础。本课程将在帮助你具备一定程序设计思想和能力之后，利用一周的时间为你简要介绍数据的管理、大数据分析方法及平台。作为入门级课程，该课程的主要教学目标是使学习者理解计算机的基础理论、建立系统构造的基本思路，并具备基本的C语言编程能力、简单算法设计和数据结构基础，为后续课程的学习奠定基础。计算机科学是研究抽象和自动计算的学科，涉及的理论知识众多。作为计算机科学的入门，“大学计算机”系列课程将从基础知识入手，循序渐进，帮助你在了解计算机系统整体结构和基本原理的基础上，具备“选择和利用各种已有工具软件解决问题的能力”和“编写程序解决一般专业问题的能力”。考虑到部分学习者对操作技能的学习需求，课程中以附件形式加入了包括OFFICE应用、无线网组网技术等知识模块。通过这门课程的学习，你将会得到以下4个方面的能力提升：1）对计算机的理解能力。课程将依次为你介绍什么是计算？计算机的理论模型，计算机系统结构，计算机软件平台，以及计算机网络知识。这些内容将会帮助你理解：l 什么问题是计算机可以解决的，什么样的问题是计算机没有能力解决的？学习计算机，需要首先在总体上清楚计算机的能力边界。l 计算机内部有怎样的结构？是怎么工作的？今天的计算机上为什么可以同时打开多个“窗口”？我们编写的各种文档在计算机中是如何表示和存放的？既然我们放在计算机中的各种信息都存放在硬盘上，那么为什么大家还是希望内存越大越好？l 网络上的信息是如何传送的？为什么我们可以通过网络和世界各地的人取得联系？2）构造思维能力。课程将从基本逻辑门入手，讲述计算机由什么样的部件构造？是怎么构造的？建立自底向上进行系统构造的思路和方法，也就是构造思维能力，将是你未来进行系统设计的重要素质。3）逻辑思维能力和利用计算机求解问题的能力。计算机的工作就是执行程序，我们希望计算机帮我们完成的所有工作都必须用程序语言来描述。学习程序设计，可以帮助提高你的逻辑思维能力和利用计算机解决问题的能力。同时，也能够帮助你真正了解计算机是如何工作的。只有掌握了一定的编程技术，才能说具备了利用计算机求解问题的能力。本课程将向你介绍什么是程序，以及如何编写C程序。C语言是最通用的高级程序设计语言，学会C程序设计，不仅可以实现各种信息处理，还可以在嵌入式系统开发和接口控制系统设计中大显身手。当然，这门课程只能帮助你具备初步的C语言编程能力。如果希望有更进一步的能力提升，请关注我们“计算机基础系列课程群”的后续课程“算法设计与问题求解”、“C#程序设计”或“C++程序设计”课程。4）对基本数据分析和管理知识的了解。如今，大数据、人工智能等新技术在不断被谈论，展示着前所未有的生命力。这使得计算机科学与技术在整个产业中占据了越来越重要的地位，从而也对培养具备计算思维能力、能够运用计算机解决各类专业问题的创新型高素质人才提出了迫切的要求。这门课将帮助你略微了解一点有关大数据及数据分析的知识，为进一步从事相关知识的学习奠定基础。\t\t\t\t\t\t\t\t\t如何了解自己对所学知识的掌握程度？课程将通过以下环节帮助你随时了解自己的学习状况：1）教学设问。在每周的起始处，会提出问题，以引导你理解课程的内容。这些问题也是你在学习完该章后必须完成的作业。2）讲间练习。在每一段教学视频的中间或结尾处，都会设置1～2道简单的测试题目，检验你是否对刚刚学到的知识是否已清楚。3）单元测验。每周学习结束后，会布置一定的课后作业。并安排相应的单元测验，以检验你对该章内容的理解情况。4）讨论与答疑。学习期间，你可以通过网上答疑或讨论方式获取帮助和进行交流。你也可以回答其他学习者的提问。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "算法设计与分析",
  "url": "https://www.chinaooc.com.cn/course/62354d769906eace04909d41",
  "teacher": "汪小林",
  "school": "北京大学",
  "description": "算法设计与分析是计算机专业的核心课程。学习该课程对学习其他专业课奠定了扎实的基础，也对培养计算思维和求解问题的能力起到重要作用。面对各个应用领域的大量实际问题，最重要的是分析问题的性质并选择正确的求解思路，即找到一个好的算法。特别是在当今复杂、海量信息的大数据处理中，一个好的算法往往起到决定性的作用。    本课程注重针对实际问题需求，进行数学建模并选择高效求解算法的训练，为提高学生的素质和创新能力打下必要的基础。课程主要内容涉及：面对实际问题建立数学模型、设计正确的求解算法、算法的效率估计、改进算法的途径、问题计算复杂度的估计、难解问题的确定和应对策略等等。本课程是算法课程的基础部分，主要涉及算法的设计、分析与改进途径，其他有关计算复杂性的内容将在后续课程\"算法设计与分析（高级）\"中加以介绍。    课程的内容分成两大部分：算法的基础知识和通用算法设计技术与分析方法。    算法基础知识部分主要介绍算法相关的基本概念和数学基础。比如，什么是算法的伪码描述？什么是算法最坏情况下和平均情况下的时间复杂度？算法时间复杂度函数的主要性质，算法复杂度估计中常用的数学方法，如序列求和及递推方程求解。    通用算法设计技术与分析方法部分主要介绍分治策略、动态规划、贪心法、回溯与分支限界等算法设计技术。重点介绍这些设计技术的使用条件、分析方法、改进途径，并给出一些重要的应用。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C语言程序设计",
  "url": "https://www.chinaooc.com.cn/course/686ee48e16c43a09c09617cc",
  "teacher": "周纯杰",
  "school": "华中科技大学",
  "description": "C语言程序设计课程是理工科专业的核心课程，是计算机程序语言的基础，主要以面向过程的程序设计语言(C)为基础，讲授高级程序设计语言的基本知识和程序设计的方法与技术，C语言是一门结构化程序设计语言，兼有高级语言和低级语言的功能，不仅可用于编写应用软件，还可以编写系统软件以及嵌入式系统。课程以程序设计为主线，以培养初学者的程序设计能力为目标，强调实用性，注重理论与实践相结合，通过大量的例题，深入浅出，循序渐进地讲解C语言程序的设计与实际应用，注重学生分析问题能力、解决问题能力的培养，强调培养初学者良好的程序设计规范。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "编译原理",
  "url": "https://www.chinaooc.com.cn/course/67a5462d225d72705eefed12",
  "teacher": "陈鄞",
  "school": "哈尔滨工业大学",
  "description": "照我们的意图去工作。我们都知道，由0和1构成的机器代码才是可以被计算机直接理解的语言。因此，用高级语言编写的程序，最终都要“翻译”成由0和1构成的机器代码才可以在计算机上执行，这一翻译过程，就称为编译。那么，计算机是如何将高级程序设计语言编写的程序自动翻译成机器代码的呢？通过这么课程的学习，我们就可以找到答案。世界著名的计算机科学家Alfred V.Aho在他的经典著作《编译器》的第1章第1句话写道：“编写编译器的原理和技术具有十分普遍的意义，以至于在每个计算机科学家的研究生涯中，本课程中的原理和技术都会反复用到。”这句话点明了编译原理这门课程在计算机专业中的重要地位。本课程共计20讲。第1讲 绪论第2讲 程序设计语言及其文法第3讲 词法分析第4讲 语法分析_1第5讲 语法分析_2第6讲 语法分析_3第7讲 语法分析_4第8讲 语法制导翻译_1第9讲 语法制导翻译_2第10讲 语法制导翻译_3第11讲 中间代码生成_1第12讲 中间代码生成_2第13讲 中间代码生成_3第14讲 中间代码生成_4第15讲 运行存储分配第16讲 代码优化_1第17讲 代码优化_2第18讲 代码优化_3第19讲 代码优化_4第20讲 代码生成",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C++语言程序设计（下）——从C到C++",
  "url": "https://www.chinaooc.com.cn/course/66872983711dc30c3439a1f7",
  "teacher": "阚道宏",
  "school": "中国农业大学",
  "description": "编写大型计算机程序需要学习程序设计方法。程序的功能是数据处理，其中包括数据和算法两大部分。数据是程序处理的对象，对应程序中的变量或常量。算法是描述数据处理过程的一组操作步骤，即程序中所编写的一组语句序列。大型程序的功能很强，这意味着要处理大量的数据，数据处理的算法也很多、很复杂。程序设计方法的基本思想是：将大型程序中的数据和算法分解成程序零件，将不同零件的设计任务交由不同的程序员完成，这样就能以团队的形式来共同开发，然后将开发好的零件组装在一起，最终完成复杂的程序功能。目前，程序设计方法分为结构化程序设计和面向对象程序设计两种，它们分别采用不同的方式来分解和组装程序零件。更进一步，如果所分解出的程序零件在以前项目中曾经开发过，或者可以从市场上购买到，那么就可以直接使用这些零件来组装软件，实现快速开发。使用已有的程序零件，实际上是重用其程序代码，这就是程序设计中的代码重用（code reuse）。为了让不同程序员开发的程序零件能够正确地组装在一起，在编写时它们应遵守共同的语法规则。因为易于复制，代码重用的成本很低，这是软件行业所独有的特点。代码重用可以极大地提高软件开发效率，代码重用也因此成为软件技术不断进步的主要动力。为了应用程序设计方法来编写大型复杂程序，计算机语言需要提供描述和组装程序零件的语法规则。支持结构化程序设计方法的语言称为结构化程序设计语言，支持面向对象程序设计方法的语言称为面向对象程序设计语言。C语言是一种结构化程序设计语言，而C++语言既支持结构化程序设计方法，又支持面向对象程序设计方法。本课程将详细讲解面向对象程序设计方法，并具体介绍C++语言中相关的语法规则。================================================“程序设计能力培养”系列MOOC课程学习指南：【编程三级跳】！【编程三级跳之一】：《C++语言程序设计》（上）、（下），通过C++语言学习程序设计基础和面向对象程序设计。参考教材：《C++语言程序设计（MOOC版，第2版）》，阚道宏编著，清华大学出版社，2017年10月。ISBN 9787302475620。【编程三级跳之二】：《Java语言程序设计》，通过Java语言学习如何使用别人的类库（Java生态圈）来快速开发应用程序，例如图形界面、多线程、网络编程、数据库编程、单元测试等，培养应用型编程能力。参考教材：《Java语言程序设计（MOOC版）》，阚道宏编著，清华大学出版社，2019年9月。ISBN 9787302530176。【编程三级跳之三】：《机器学习及其Python实践》，已在清华大学“学堂在线”平台正式上线（通过浏览器、微信小程序或手机App搜索“学堂在线”，进入平台后搜索课程“阚道宏”即可免费进入课程学习），这门课程重点讲解机器学习的基本原理和前沿思想，并使用Python语言开展机器学习编程实践，培养研究型编程能力。参考教材：《机器学习及其Python实践（微课视频版）》，阚道宏编著，清华大学出版社，2022年8月，ISBN 9787302604068。学习三门课程，实现【编程三级跳】：程序设计基础→应用程序开发→专业研究开发！",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "离散数学",
  "url": "https://www.chinaooc.com.cn/course/686ee12416c43a09c09617af",
  "teacher": "刘铎",
  "school": "北京交通大学",
  "description": "“离散数学”是面向所有专业的本科生、专科生和社会公众开放的基础课程。“离散数学”研究不同离散量的各自结构、规律及相互关系的一门学科。它在程序设计语言、数据结构、操作系统、软件工程、数据库原理、计算机网络、人工智能、软件设计形式化等方面都有广泛的应用，具有研究性、实践性、创新性强的特点，不仅强调对知识的理解和掌握，还强调方法论的学习。本课程共8讲，学生学习全部课程内容并完成测验、作业大约共计10-12周；每讲之后学生需要完成单元测试及作业；还要参加期末考试。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "深度学习及其应用",
  "url": "https://www.chinaooc.com.cn/course/687822cc16c43a09c0c47051",
  "teacher": "赵卫东",
  "school": "复旦大学",
  "description": "1.我为什么要学习这门课？机器学习是人工智能的重要组成和技术基础，伴随着人工智能几十年的发展，期间几次大起大落。作为机器学习的高级阶段，最近几年深度学习算法在自然语言处理、语音识别、图像处理等领域的突破应用和广泛接受。这也标志着机器学习已经迈出实验室大门，走向实践，推动着人工智能向更高阶段发展。数据分析和人工智能发展已经引起了全球关注。企业对机器学习的人才需求增大，与之密切相关的数据科学家、数据挖掘工程师、大数据分析师、机器学习工程师等数据分析类人才成为本世纪最有吸引力的职业。根据相关企业估计，上述人才的增长高峰将持续6-8年。本课程就是对深度学习感兴趣的学员准备的。2.这门课的主题是什么？讨论深度学习的典型算法原理与应用（具体内容请参考下面课程大纲），为实践打下坚实的基础。3.学习这门课可以获得什么？课程目标：理解深度学习的基本原理、精选的深度学习基本算法及其典型应用，并使用主流的机器学习开源平台实现深度学习在典型领域的应用过程，能否对一般难度的应用问题进行分析和代码实现。4.这门课有什么特色和亮点？深度学习是一门理论和实践并重的课程，其中的内容比较多，很多算法也有一定的难度。深度学习的应用也需要一定的经验和技巧。本课程参阅了大量文献资料，结合过去多年的数据分析研究和项目实践，深入浅出，学生在可以钻研深度学习的算法以及应用。课程通过大量的选择题、填空和判断题检验和巩固学员对基本知识的理解。5.这门课的学习方法建议建议结合教材《机器学习（第2版）》（人民邮电出版社，2022）、《机器学习案例实战（第2版）》（人民邮电出版社，2021）、《Python机器学习实战案例（第2版）》（清华大学出版社，2022）《深度学习案例实战》（人民邮电出版社，2024）学习，先结合视频了解基本算法，然后通过各单元的测试题和作业巩固基本概念和算法，再通过具体的案例解读思路和代码，巩固算法。线下还要参考实战教材动手实验和实践练习，循序渐进。 6.课程守则（建议）欢迎大家选修课程，请各位按照课程首页大纲的内容，根据课程内容的顺序，每周结合视频和推荐的配套教材，按时完成基本算法内容学习，并结合单元测试和章节练习，巩固基本概念和算法。在此基础上，完成每单元的实验，并可以进一步阅读推荐教材的实战案例，理解机器学习的思路以及每个步骤可能遇到的问题和技巧。有问题欢迎在课程讨论区讨论。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C程序设计案例教程（基础）",
  "url": "https://www.chinaooc.com.cn/course/62354c6d9906eace048c1a26",
  "teacher": "张莉",
  "school": "中国农业大学",
  "description": "C语言作为经典系统软件开发设计语言，曾开发出UNIX经典操作系统等软件系统。随着物联网、人工智能、大数据、云计算等新技术不断发展，C程序设计广泛用于各种应用程序开发，经久不衰。系统学习C语言程序设计，系统掌握现代计算思维编程技术方法，是熟练掌握现代编程技术的重要基础，也是现代社会工作和科技创新人才的必备基础。     计算机科学教育正发展成为科学思维和工程思维教育的重要基础。C语言在TIOBE世界排行榜中持久排名前列，TIOBE提供世界范围计算机程序设计语言指数排名，每月更新新一次，C语言程序设计始终是系统掌握各种编程技术方法的重要基础，因此编程学习也逐渐成为现在基础教育的一部分。\n\t     本课程根据现代编程技术发展和人才培养需要，结合我校“新工科”、“双一流”教学改革不断建设，课程体系完整，知识点案例丰富，特别适合随时随地自主学习、系统实践。其在线教学版教材也于2019年1月出版，也适合线上线下多种模式混合式教学。\n\t    本课程分为基础篇和进阶篇，本课为基础篇，主要结合MOOC教学特点，优化提炼基础部分知识点，通过案例应用来解析相关的知识要点，学习掌握程序算法实现，及相关的语义语法基本规范等相关技术及实验方法。\n\t    本课程主要内容包括计算机程序设计算法与实现、C语言程序设计组成结构、编译运行、各种数据存储类型及相关运算、各类程序流程控制命令与控制结构、数组的创建定义与使用、函数定义与变量的作用、编译预处理与宏定义的使用方法等基础知识内容。\n\t    本课程学习规划，可按章节自主选择知识点相关内容和学习方式。如各知识要点的授课视频，案例分析视频、编程实验视频、习题分析视频等。每小节均有小节讨论及知识要点综述和相关练习，每章都有单元测试，或自测练习及习题分析解答等。在学习过程中可根据内容自主选择问题讨论、编程练习、自测练习等，以强化知识要点基础训练与计算思维技术方法。本课程提倡跟随案例动手实践，积极参加各种主题讨论等线上线下多种形式学习模式。\n\t    C程序设计学习特点：\n\t    C语言是现代编程的重要基础，ANSI标准定义的命令关键字只有32个，运算符34个，程序控制语句也只有9种，这些在学习中都不难理解，也比较易于掌握。\n\t对初学者来说，每当遇到实验或编程分析以解决实际问题时，总体会感觉上“难”掌握。特别是非计算机专业同学，这种现象比较普遍。\n\t要越过心理“难点”这道坎儿，运用计算思维方法养成习惯是关键。通过案例分析和引导，勤动手多实践，训练掌握如何自如地表达实际问题求解过程与程序算法，才能有效编写组织程序，实现相关运算逻辑的计算结果。\n\t     计算机程序设计中，掌握知识要点的计算思维方法是核心，通过实验验证则是有效掌握程序算法实现的关键。这是一个实践应用熟练过程。\n\t     MOOC学习优势：\n\t     MOOC学习是一种基于丰富多样化学习资源，并拥有多种学习选择模式的自主式构建知识点结构体系的学习环境。也特别适合计算机程序设计类课程的基础型学习和创新创意编程的学习，尤其是清华学堂在线。在这里，我们不仅可以随时随地自主选择分享主讲老师精心准备的各种上线资源，同时还可共享国内外名校的精品资源。在学习过程中，可参与各种学习讨论，线上线下分享动手实践和体验。在这里，我们可随时分享自己想得到和想不到的各种问题，或许可以得到来自全球名校各位高手点拨，分享各种创意学习思维方式，分享知识热点讨论和求解思路方法等。\n\t      在分享每个知识点的学习体验，提高自主学习效率和学习质量的同时，不断获得学习实践的成就感，哪怕是一点点，积少成多，积点滴则汇成江海河流，就从最简单的案例开始。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据库技术及应用",
  "url": "https://www.chinaooc.com.cn/course/67b3c50d225d72705e35d57d",
  "teacher": "李雁翎",
  "school": "东北师范大学",
  "description": "随着信息技术的不断发展，大学生吸收、处理、创造信息，以及组织、利用、规划资源的能力需求在不断提升。数据库技术是研究、管理和应用数据库的一门软件科学，是信息系统的一种核心技术，是进行组织和存储数据，高效地处理、分析和理解数据的技术，是进行数据库设计、数据存储、数据操纵与管理，以及数据库应用系统开发的基本理论方法。这门课程将让大家更好地理解什么是数据和数据库，以及系统的讲述数据库基础理论和基本操作。本课程力求通过培养学习者利用数据库技术对信息进行管理、加工和利用的“素养”，增强学习者分析问题和数据表达的能力；培养学习者利用数据库技术解决专业问题的“意识”，增强学习者根据应用问题选择、使用DBMS产品和应用开发工具的能力； 培养学习者积极探索新技术、新方法和继续学习的“理念”，增强学习者团队协作、自我创新的能力。让学习者感受信息文化、增强信息意识，养成利用信息技术解决问题的思维习惯，从而达到计算思维能力的培养的目标。本课程共有4个教学模块：数据库基础理论、数据库设计、数据操纵、数据库系统控制。课程的特色是采用“一托三”形式，以讲授数据库基础理论和基本操作为主，不局限某个数据库管理系统，提供ACCESS，SQL Server，Visual FoxPro三种不同实验环境的实验教学内容。学习者可根据实验条件进行针对性的选择，可以根据实验教程指导实验。本课程配有含大量视频资源教材，它也是MOOC课堂内容的扩展，学习者在阅读过程中，通过扫描书中的“二维码”便可离线学习。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Java核心技术",
  "url": "https://www.chinaooc.com.cn/course/67902e1b225d72705e8a5f24",
  "teacher": "陈良育",
  "school": "华东师范大学",
  "description": "本课程主要讲授Java核心技术原理。本课程一共包含12章，分成48个视频，每章3-6个视频不等。课程主要内容包括：面向对象思想、Java类和对象、继承、接口和抽象类、包结构和导入、异常处理、数据结构、文件处理操作、综合案例实践等。本课程注重核心原理讲解，并通过大量例子程序进行辅助理解。学生学习本课程后，可以了解Java基本语法，理解常规Java程序，并动手进行代码实践。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大学计算机基础",
  "url": "https://www.chinaooc.com.cn/course/67ba5eab225d72705e559afb",
  "teacher": "赵柱",
  "school": "河西学院",
  "description": "我们正处于一个信息化的新时代，学习大学计算机课程是信息时代的需要；大学计算机基础主要培养基本的计算思维能力和信息素养，为学生进一步学习计算机知识和更好的学习专业知识奠定基础；学习这门课可以了解人工智能、大数据等相关知识，可以帮助同学们结合自己的专业知识提高分析问题解决问题的能力；这门课具有结构严谨、简单易学的特点和学测结合、自主完成能力培养的亮点。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C程序设计",
  "url": "https://www.chinaooc.com.cn/course/6881504716c43a09c0f2ceef",
  "teacher": "姜学锋",
  "school": "西北工业大学",
  "description": "程序设计（CP，Computer Programming）课程是大学计算机教育的核心课程，它既是各类专业技术的应用基础，又是各种实践环节的软件工具，更是课程设计、学科竞赛、毕业设计、创新创业、创客科技等活动的重要平台。编程能力不仅是学习者进一步专业深造的潜力体现，也是创新人才的重要指标。学习编程包括语言工具、问题求解、实现方法、算法思想、编程抽象、编程范式、设计模式等内容，涉及算法设计、程序实现、计算科学、软件工程、系统开发、学科交叉等方面。本质上，程序是逻辑演绎的形式化表达，反映的是人类对这个世界的数字化理解。因此，提高编程能力可从两点出发：一是以思维训练为中心的编程技能，二是以学科融合为核心的领域知识。那么，如何学习编程呢？\t\t\t\t\t\t\t\t\t\t\t\t\t1．按“双线索”学习程序语言\t\t\t\t\t\t\t\t\t\t\t\t\t任何程序语言，包括C语言，都是一个标准化的、具有庞大知识内容的形式语言体系。因此以语言知识为学习线索必然是整体凌乱、抓不住主次，容易迷失学编程的方向。\t\t\t\t\t\t\t\t\t\t\t\t\t须知，计算机的基本工作原理决定了计算机问题求解是“计算数据”的过程，编程就是去解决“如何表示数据”和“如何实现计算”。将“数据表示”和“程序实现”作为学习程序语言的两条主线索，抓住语言对此所起的作用，螺旋上升，交叉推进，如下图：\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t这时，你会发现程序语言是服务编程的工具而不是目标。\t\t\t\t\t\t\t\t\t\t\t\t\t2．有“节奏感”推进编程实践\t\t\t\t\t\t\t\t\t\t\t\t\t学习程序语言时需要快节奏，学习编程方法和编程技术时需要慢节奏，即使是敲代码也要有节奏，快慢使得学习者“抓大”（设计方法）“放小”（语言知识），得到最大化的“饱满感”编程训练。\t\t\t\t\t\t\t\t\t\t\t\t\t学编程需要完成大量练习，称为“刷题”。编程实践过程中的灵感、技术、习惯、动机、反思以及畅想，将会把程序设计的知识逐一转化成技能，形成编程思维。对编程有激情是一件很美妙的事情，但同时也必须培养自己对于编程周边所有事情的热情。在节奏引领下可以更有效地与计算机对话，从而赋予我们将创意变成原型的能力。\t\t\t\t\t\t\t\t\t\t\t\t\t这时，你会发现编程是帮助人们与计算机沟通的工具。\t\t\t\t\t\t\t\t\t\t\t\t\t3．从“多维度”进行思维训练\t\t\t\t\t\t\t\t\t\t\t\t\t计算科学思维是多维度的，例如基于计算技术的普适思维，特点是抽象和构造；基于算法思想的数学思维，特点是形式化和自动化；基于数据技术的逻辑思维，特点是因果关系和相关关系；基于系统结构的应用思维，特点是整体性和结构性。\t\t\t\t\t\t\t\t\t\t\t\t\t程序最重要的两个基本要素是算法和数据结构，编程的难点不是算法或者数据结构本身，而是如何理解和分解问题，并将其映射到最合适的算法或数据结构上，这个映射本身不是程序要解决的问题，是人脑在思维，是构造性思维、逆向思维、猜想与试验、设计思维等全脑思维的艺术。\t\t\t\t\t\t\t\t\t\t\t\t\t这时，你会发现编程是思维的体操。\t\t\t\t\t\t\t\t\t\t\t\t\t4．用“系统观”拓展编程视野\t\t\t\t\t\t\t\t\t\t\t\t\t衡量编程有两个重要指标：编程累计行数（TLOC）和单个程序行数（SLOC）。以解题为主的编程训练能提高TLOC，但却止步于SLOC。即使将小规模、数学型问题做成百上千，TLOC指标上去了，但SLOC却不见长。一般的，SLOC小于300行时很难让人体会到“开发的感觉”，这时编程局限在“数学工具”视野里。显然，单纯的思维训练和仅仅摄取知识信息无法形成系统观。\t\t\t\t\t\t\t\t\t\t\t\t\t实际上，计算方法（数值计算、非数值计算）仅是程序设计方法的一种，程序方法学中还有诸如操作系统、人机界面、图形图像、多媒体、网络通信、数据库、硬件接口等技术领域，每个领域都有独特的编程技术和精巧的解决方法。通过引入高级编程技术的学习，融合各类学科专业的领域知识，拓展求解问题的专业覆盖面、问题复杂度和数量，可以改变编程的广度、深度和力度，形成编程核心模式及对它们不断运用所形成的思维方式的系统观，这是优秀程序员最重要的素质。\t\t\t\t\t\t\t\t\t\t\t\t\t这时，你会发现编程是全方位的创新实践。\t\t\t\t\t\t\t\t\t\t\t\t\t5．以“跨领域”塑造核心价值\t\t\t\t\t\t\t\t\t\t\t\t\t掌握知识和能力是大学学业的价值，但仅仅是这些就可能掩盖了大学学业的核心价值和潜质，即通过知识内化为思维、通过能力提升到创造，最终拥有终身享用不尽的、可持续发展的知识发现、知识获取、知识建构的科学素养。\t\t\t\t\t\t\t\t\t\t\t\t\t学会了编程就等于掌握了信息时代的听说读写能力，学习编程形成的心理技能对于我们生活的其他方面都极其有用。通过跨学科、跨领域的延伸，编程将提高问题求解的能力，提升对世界的理解力和改善解决问题的决策能力，建立起批判性思维、系统性思维、创造性思维。通过增加挑战式内容，强化在专业学科研究上表现出很强的发展潜力，形成学业核心价值。\t\t\t\t\t\t\t\t\t\t\t\t\t这时，你会发现编程教会人们如何思考。\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t归纳起来，就是“技能提升、思维训练、系统培养、价值塑造”。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据结构",
  "url": "https://www.chinaooc.com.cn/course/688542fe16c43a09c0069895",
  "teacher": "陈卫卫",
  "school": "陈卫卫",
  "description": "2019年1月课程被教育部评为国家精品在线开放课程，2020年被教育部认定为首批国家级一流本科课程（线上）。\t\t\t\t\t\t\t\t\t\t\t 1. 课程性质和地位    “数据结构”是计算机科学与技术、网络工程、信息安全等专业本科生的专业基础课程中的一门重要的核心课程。  在计算机学科中，本课程与其他课程的关系如图1所示。图中，大学数学、计算机基础、离散数学、C/C++语言等是本课程的先导课程，而其它课程（如操作系统、编译原理、计算机网络等）均以本课程作为先导课程。图中已罗列出一些专业课所用到本课程中的相关知识，比如，操作系统课程会用到队列、存储管理表等。本课程也是算法分析与设计、计算复杂性理论等高级课程的基础。因此，本课程在计算机教学工作中具有重要的地位。                                               图1 数据结构课程与其他课程的关系图 2. 课程目标   通过本课程的教学，使学习者懂得数据结构的一般原理，掌握表、树、图等基本结构的特点，各结构的存储表示和所涉及的运算，完成各运算的算法及其实现方法，学会对算法的评价方法。使学习者具有一定的算法设计能力，较强的程序设计能力，和实际应用能力，能够针对给定的简单问题设计出求解算法，包括问题的抽象、数据的提取、数据的组织、数据结构的确定（逻辑结构）、算法设计、数据的存储形式（物理结构）、编程实现、程序的调试和测试等。也为学习后续专业课程，设计系统程序打下坚实的理论基础和实践基础。 3. 教学环节   本课程通过视频授课、课外作业、教材阅读、上机实践，以及师生互动等环节实现课程目标。  学习者通过观看本课程提供的授课视频接受课堂教学，学习基本知识；通过阅读本课程指定的教材（《数据结构与算法》（第二版）．陈卫卫 王庆瑞编著．北京：高等教育出版社. 2015.07），预习和复习视频授课内容；通过完成指定的“书面”练习题和上机练习题，巩固和充实课堂知识；学习者和教师互动，由一方向另一方提出问题请其解答，学习者以其释疑，教师则以其检查学习者完成学业的情况。 4. 课堂教学设计   课堂教学内容分为三大部分：基础知识（第一讲）、基本模型（第二至九讲）、基本问题（第十讲）。  基础知识部分是学习后续内容的基础，包括概念（算法的概念，数据结构的概念）、标准（对算法的评价标准）、方法（算法的描述方法和评价方法）。  基本模型部分是本课程最主要部分。这部分以查找、插入、删除运算为主线全面而系统地介绍表、树、图等基本数据结构的特点、存储方法、完成各运算的算法设计方法和实现程序、时空效率。因为，查找、插入、删除不仅是最基本的、最常用的，而且往往也是不可分的（通常联合使用，极少单独使用），其它某些运算还可以转化为这三种运算。将这三种运算构成的运算集作为一个整体，可以得出结构的整体时空效率。  最后一部分，以问题为导向（这里选用排序问题），介绍求解同一个问题的多种不同处理算法，通过对算法的评价，分析各算法的特点、效率、适用情况。  图2展示了这些课堂教学内容之间的关联关系。        \t\t\t\t\t\t\t\t\t\t\t图2 数据结构教学内容之间的概念图\t\t\t\t\t\t\t\t\t\t\t5. 实践教学设计   本课程设计的实践教学（即上机实验）题分为基础性、综合性和设计性三大类。  基础性（即知识验证性）类实验题主要用于巩固课堂知识，其难度不大，实现程序不长（小程序），通常只需要将教材中的程序进行简单拼装，简单改造，简单模仿，简单细化。  综合性和设计性实验题属于大作业，实现程序较长，难度较大。顾名思义，完成综合性实验题需要将多个知识点进行综合，而完成设计性实验题则要实现从建模到解模的全过程，即实验者要独立完成：问题的抽象，数据的提取，数据的组织，数据结构的确定（逻辑结构），算法设计，数据的存储形式（物理结构），编程实现，程序的调试和测试等步骤。 6. 教学模式设计   对于基本概念，在讲清基本概念条文的同时，尽可能多地举例阐述概念的内涵，并强调规范术语用词，培养严谨的科学作风。  对于算法设计，遵循“少而精”的原则，突出重点，以点带面，通过对比，使学习者逐步建立设计“好”算法的意识。  对于表、树、图三大基本结构，依照“逻辑结构→物理结构→基本运算→基本算法→算法评价”这个脉络，研究每种结构的特点，给学习者一个清晰的研究主线，使学习者能够根据问题的特点选择合适的数据结构，进一步理解研究数据结构的意义。  对于学习者，可以按照“读、仿、改、究”的学习模式逐步提升自己的程序（算法）设计能力，并以此衡量自己当前达到的水平。具体地说，“读”就是研读（本课程中给出的）经典算法及其实现代码，领会算法设计思路、描述方式和实现代码的程序结构；“仿”是指对现有的求解原问题的算法进行简单搭建和修改，写出用来求解与原问题相近的新问题的模仿算法；而“改”则是，当应用场景或用户需求发生较大改变时，能够对现有算法进行改进，写出改进算法，这一阶段至关重要，不仅起到了深化理解知识的作用，而且对算法设计能力、分析能力，改进点的定位，改进措施的选定都是极大考验和锻炼；“究”指的是研究和探索给定问题的性质、特征，确定求解策略，设计出性能良好的求解算法。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "软件工程",
  "url": "https://www.chinaooc.com.cn/course/67b51852225d72705e3c32f3",
  "teacher": "张爽",
  "school": "东北大学",
  "description": "本课程为国家级一流线上课程、国家级精品在线开放课程。通过学习本课程，使学生了解和掌握软件工程的基本概念和知识，包括软件工程的范畴、软件过程、软件生命周期模型、软件需求、面向对象分析、面向对象设计、实现与集成、维护、测试。要求学生能够掌握和运用面向对象软件工程的理论和方法，分析设计软件项目。具体主要包括：掌握软件工程专业工程基础理论知识和专业知识，且能将其应用于解决相关问题；运用用例图、类图、时序图等面向对象软件工程分析和设计的方法描述目标软件的规格说明和设计；掌握软件生命周期要素，了解多种软件生命周期模型，了解软件项目管理、软件团队及软件复用的基本概念和方法。为了满足和方便广大同学的各种学习需要，本慕课中的课件、测试题、论坛等均为双语、即中英文。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C程序设计案例教程（进阶）",
  "url": "https://www.chinaooc.com.cn/course/62354c6e9906eace048c1c2a",
  "teacher": "张莉",
  "school": "中国农业大学",
  "description": "C语言作为经典系统开发语言，随新技术发展广泛应用，经久不衰持续发展，始终位于TIOBE世界排行榜前列。     本课作为进阶篇，是C程序设计的精华所在，也是相对较难掌握的部分，课程体系结合知识结构和MOOC学习特点，通过案例应用解析相关知识难点要点，引导大家深入系统学习C程序设计精华技术要点与实验方法，构建完整的知识体系。本课程主要包括数据存储地址的操作与指针变量、构造类型与自定义类型的定义与使用、链表结构创建与应用、按位运算操作、文件系统与数据操作等内容及相关应用。     本课程学习可按章节自主选择知识点相关内容，也可随堂循序渐进系统学习。进阶篇各知识要点就晕有授课视频，案例分析视频、编程实验视频、习题分析等；每小节有小节讨论及知识要点综述相关练习，每章都有单元测试或自测练习及习题分析解答等。学习过程中可根据内容自主选择案例分析、问题讨论、编程练习、自测练习等，强化知识要点实际应用和计算思维技术方法。      充分利用MOOC学习优势      MOOC学习是一种基于丰富多样化学习资源，并拥有多种学习选择模式的自主式构建知识点结构体系的学习环境。也特别适合计算机程序设计类课程的基础型学习和创新创意编程的学习，尤其是清华学堂在线。在这里，我们不仅可以随时随地自主选择分享主讲老师精心准备的各种上线资源，同时还可共享国内外名校的精品资源。在学习过程中，可参与各种学习讨论，线上线下分享动手实践和体验。在这里，我们可随时分享自己想得到和想不到的各种问题，或许可以得到来自全球名校各位高手点拨，分享各种创意学习思维方式，分享知识热点讨论和求解思路方法等。     借助互联网+教育丰富的学习资源和先进的学习环境，熟练掌握现代编程技术实现方法，一起迎接新时代新技术的创新未来。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "编译原理",
  "url": "https://www.chinaooc.com.cn/course/6876c27a16c43a09c0bdcf4d",
  "teacher": "王挺",
  "school": "国防科技大学",
  "description": "《编译原理》课程是计算机科学与技术专业的必修课程。本课程主要介绍程序设计语言编译程序构造的基本原理和设计方法，包括：编译程序概述、高级语言及其语法描述、词法分析、语法分析、属性文法和语法制导翻译、语义分析和中间代码产生、符号表、运行时存储空间组织、优化、目标代码生成等。理论和实践相结合是编译程序设计的重要特色。形式语言和自动机理论为编译程序的设计提供了坚实的理论基础，正是在科学理论的保证下，才形成了一系列先进的编译程序设计方法和工具，使得编译程序的构造具有很高的系统性和自动化程度。本课程2007年被评为国家精品课程，2016年被评为国家精品资源共享课程，2020年被评为国家级一流本科课程(线上课程)。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机文化基础",
  "url": "https://www.chinaooc.com.cn/course/687eb3a316c43a09c0e58211",
  "teacher": "李秀",
  "school": "清华大学",
  "description": "面对着纷繁复杂、层出不穷的软硬件，你是否想了解这些背后万变不离其宗的基本原理？生活在机遇与挑战并存的信息时代，各种新技术和新名词铺天盖地涌现，有些成功引领了行业潮流，而有些只是昙花一现的噱头，你是否很想知道如何“未卜先知”地去鉴别？当智能计算设备已成为现代人生活不可或缺的组件，计算机文化渗透到社会的方方面面，你是否想更好地融入这种文化氛围？信息爆炸催生了网络时代的快节奏模式：今天的流行语到明天可能就会变成老掉牙的梗，今天的新潮设备到明天可能就会变成过时产品。在这种环境下，把握信息技术发展的大方向，从宏观上对当前的时代有一个全面而直观的认识，在扑朔迷离的信息时代找准自己的定位，也许对你而言，比掌握某个软件的使用方法要实用得多。\n\n这是一门以生机勃勃的信息技术为内容载体，为各领域的专业人才铺垫坚实的信息素养的公共基础课程。在大学里，这是一门面向全校各专业各年级的公共基础课。无论你是一名电脑“小白”，希望学习图像处理软件来制作海报；还是一名百万行代码量级的编程高手，渴望以新的视角了解1和0之外的世界；或者你正在从事与计算机几乎完全无关的工作（这样的工作还存在吗？），迫于潮流想对当下的信息技术有个全面系统而深入浅出的了解……无论出于什么目的，相信你都能从这门课中得到属于你的收获。\n\n这门课可以看作是计算机世界的“概论课”，采用全新的课程理念和教学模式，内容精彩，特征鲜明。与传统课程相比，本课程最大的特点在于讲授主体不只是学校教师，还有信息技术各相关领域的专家学者，他们都会根据自己的独特经历，以全新视角为你讲述不同的计算机世界；而我们的授课内容也远远不只是说教式的、冷冰冰的书本知识，更有与生活密切相关的、活灵活现的案例与故事。此外，由于信息技术发展极为迅速，所以本课程没有特定的教材（书籍出版会非常滞后），而且会不断更新内容，力图展现最新颖、最前沿、最符合时代潮流的内容。不仅如此，本课程还立足于“文化”视点，努力尝试将深刻影响人类社会的信息技术讲出“文化”的味道，让受众建立起普适的计算思维。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "离散数学概论",
  "url": "https://www.chinaooc.com.cn/course/66eb64b7130d17e111b59473",
  "teacher": "陈斌",
  "school": "北京大学",
  "description": "离散数学是计算机科学的基础理论，离散结构的基础知识和逻辑思维的形式化是信息技术类学生的基本功，离散数学的基本概念是理科专业学生进行信息类课程学习的重要基础。  本课程介绍计算机科学和信息技术理论基础的概念和思想方法，介绍数理逻辑、集合论、图论、抽象代数和形式语言与自动机等各部分的基本概念，培养学生理解和掌握离散数学基本概念，采用形式化方法分析问题，并能自觉运用逻辑分析、结构层次分析和同构类比等思想方法解决问题的能力。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据库原理与应用",
  "url": "https://www.chinaooc.com.cn/course/67ba5e78225d72705e559af2",
  "teacher": "陈志泊",
  "school": "北京林业大学",
  "description": "【为什么要学习这门课？】课程学习原因：数据库及其相关技术是计算机应用中一个非常活跃、发展迅速、应用广泛的领域。随着物联网、移动互联网、社交媒体等信息技术的飞速发展，数据资源急剧膨胀，如何解决数据管理的相关理论和技术问题，并利用计算机对这些数据资源进行科学地组织、存储、检索、维护和共享，是数据库原理与应用课程的主要教学内容。【这门课的主题是关于什么】课程讲授内容：本课程的教学团队由一线教师组成，几位老师将先后带领同学们学习关系数据库系统的基本概念和原理、关系数据模型、SQL语言、数据库管理、关系数据库设计以及数据库高级知识等内容。【学习这门课可以获得什么？特别是对自己有什么帮助和应用】帮助和应用：通过本课程的学习，学生将掌握关系数据库基本概念和原理，能够通过SQL语句管理数据库并进行简单和复杂的数据查询操作，具备针对各类复杂业务需求进行规范化关系数据库设计的能力，具有开展高级数据库管理、大数据分析和挖掘等工作的基本素质。【这门课有什么特色和亮点】特色亮点：本课程既能够满足计算机专业数据库原理的教学任务，也能够满足非计算机专业数据库应用教学要求。课程提供了丰富的教学指导、学习课件、实践操作、实验指导、习题指导以及数据库案例分析，能够对以数据库应用型人才培养为目标的混合式教学提供所需的线上资源。同时，本课程还即将面向社会数据库学习爱好者需要，在SQL Server基础上，持续提供MySQL的配套辅导，覆盖主流数据库管理系统的应用场景。同学们，这是一门理论联系实际、实用性非常强的计算机及相关专业的核心骨干课。请加入我们，一起玩转数据，为今后开展数据管理及系统开发等相关工作奠定基础，也为今后学习数据仓库、数据挖掘、大数据分析处理等课程做好准备。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据库系统（中）：建模与设计",
  "url": "https://www.chinaooc.com.cn/course/679420cc225d72705e9d6aa3",
  "teacher": "战德臣",
  "school": "哈尔滨工业大学",
  "description": "本系列课程旨在使学生充分掌握数据库系统的基本概念和基本原理，熟练掌握数据库系统语言、数据库抽象与建模方法和数据库应用程序设计方法，培养学生在信息管理和信息系统方面的抽象、设计、开发、应用和管理能力。同时，数据存储、数据库查询实现、查询优化、事务处理等技术，这些内容也是计算学科学生在专业方面必须掌握的操纵数据库的能力，本课程也将为你详细讲授。本系列课程将分为四个部分进行介绍：一、基本知识与关系模型；二、数据库语言及其应用；三、数据建模与数据库设计；四、数据库管理系统实现技术。这四部分内容之间的关系如下图示意。\t\t\t\t\t\t\t\t这四部分内容将分为三门课程来开放。本课程《数据库系统\t（中）-建模与设计》将包括第三部分内容。\t\t\t\t本系列课程的特色：(1)本课程是一门理论性为基础、应用性为目标，理论应用相结合的计算机类主干课程；(2)抽象内容的实例化讲解是本课程的特色，通过大量具体示例，来阐释数据库相关的抽象概念和原理；(3)知识学习与案例点评相结合是本课程的特色，本课程包含数据建模和数据库设计相关的内容，重要的是知识的运用，案例点评则成为知识运用能力训练的重要手段； (4)问题导引的知识学习是本课程的特色，深入浅出，图文并茂，案例配合，面向问题地阐释数据库系统的核心内容。本课程将为学生从事大型信息系统软件的设计、开发和应用打下基础，也将为学生今后从事大规模数据的存储、操纵和分析奠定很好的基础。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据库系统原理",
  "url": "https://www.chinaooc.com.cn/course/6872cdbf16c43a09c0a9ef0f",
  "teacher": "党德鹏",
  "school": "北京师范大学",
  "description": "当前已经是大数据时代，数据库课程不能没有大数据管理，这是技术发展的呼唤，也是提高教学质量、加强人才技术素质的迫切要求。融合传统数据库关键技术与大数据最新进展，是数据库课程改革的必然趋势。为此，本课程直面技术最新发展，总结多年教学实践，深度梳理知识结构，课程内容按顺序分为四大部分。第一部分是基本概念和基础知识，包括第一、二章，涉及数据库系统、大数据、数据模型等基本概念，为后面内容打基础。第二部分主要包括第三、四、五章，讲声明性语言(SQL)，及其在应用环境中与高级语言的混合编程，以及数据保护。第三部分是第六、七章讲数据库设计并融入大数据思维。第六章主要是ER设计以及转换为关系，所以也涉及了关系设计或者说目标也是关系设计，但方法主要是从实体及联系的角度来做的；第七章讲关系设计，主要是从数据依赖角度来做的，而数据依赖本质上就是属性及其联系。六七两章的目标是一致的，都是讲关系设计只是方法不同，并且大数据特征改变了原有数据库设计思想。第四部分是大数据新技术简介。      主要特色包括：(1)以自然灾害应急系统/网络考试系统/智能推荐为案例，实施案例驱动的教学模式，技术最先进，概念最清晰。(2)在课程内容安排上，先讲语言，让学生通过上机使用，有直观了解，进而再讲设计，最后讲实现，由浅到深，由表及里，便于理解。(3)通过案例分析，解析传统数据库和大数据中数据管理技术的基本思想和特点，融合理论与实践，贯通技术思想与职业理念。(4)站在大数据管理的角度，讲述数据库设计和实现的新思想，在数据库设计和实现的讲述中融入大数据思维；针对各种数据密集系统的共性，讲述数据管理技术发展趋势，并对大数据管理进行简介。(5)以尽可能简单的例子凸显技术思想的本质。(6)纳入数据管理技术的最新发展，深度梳理课程知识点体系，研磨了与信息安全、操作系统、数据结构、组成原理等相关课程的关系，实现无缝平滑衔接。(7)特别是梳理了数据保护知识点体系；提出了数据管理的目标：安全、简单、高效地共享数据，并以此为线索贯穿全书内容，把知识碎片变得系统化，使得全书知识点有机融为一体。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "多媒体技术与应用",
  "url": "https://www.chinaooc.com.cn/course/6796c262225d72705eaa1cdf",
  "teacher": "李湘梅",
  "school": "同济大学",
  "description": "通过本课程的学习，同学们将学会如何处理声音、图像和视频等多媒体元素，还将学习二维和三维动画的制作。本课程包括7个单元，多媒体技术基础，音频处理技术及其应用（Audition），图像处理技术及其应用（Photoshop)、视频处理技术及其应用（Premiere)、动画制作（Flash与3ds Max）、多媒体数据压缩编码和视频的后期合成（After Effects）。本课程将通过大量实际案例的教学，帮助大家快速掌握多媒体常用软件的操作及其应用，通过分析各种技术实现的原理可以帮助大家成为多媒体技术的高手。  选修本课程的同学建议准备一本我们课程团队编写的配套教材，《多媒体技术与应用》第2版（龚沛曾和李湘梅主编），教材的后半部分有每个模块相对应的实验指导，绝大多数实验都有比较详细的操作提示。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据库系统概论（新技术篇）",
  "url": "https://www.chinaooc.com.cn/course/67bfa539225d72705e6f0346",
  "teacher": "王珊",
  "school": "中国人民大学",
  "description": "数据库是一门关于数据存储、管理、处理和分析挖掘的学科。\t  随着计算机软硬件技术的进步，特别是大数据的出现，数据库技术获得快速发展，新技术和新系统层出不穷。\t  数据库系统概论的基础篇和高级篇课程已经系统讲述了数据库系统的基础理论、基本技术和基本方法。数据库系统概论的新技术篇将从数据管理和数据分析的角度来讨论数据库新技术与大数据技术。系统地讲解传统数据库技术的最新发展，大数据管理与系统的新概念、新技术和新应用。\t  我们力求深入浅出，使得数据库系统概论（新技术篇\t）不仅可以作为高等学校计算机类专业高年级本科生和研究生数据库课程的教学内容，而且能为广大学员和科技人员提供有益参考。数据库系统概论（新技术篇）的特点：1.      课程内容：系统地讲解传统数据库技术的最新发展，以及大数据管理与系统的最新前沿技术。2.       授课面向：高年级学生、研究生、教师和广大科技人员。3.       讲课老师：中国人民大学中青年优秀教师（16位）4.       深入浅出：大同行能够听懂。 数据库系统概论（新技术篇）分为两大部分。第一部分是数据库的新技术概论。包括：l  数据库新技术概述讲者：王珊教授；l  内存数据库讲者：张延松博士，副教授；l  数据库一体机讲者：周烜博士，教授；l  数据仓库和OLAP分析讲者：陈红博士，教授；l  数据挖掘讲者：李翠平博士，教授；l  数据库安全性新技术讲者：秦波博士，副教授；l  开源数据库系统讲者：张孝博士，教授；第二部分是大数据技术概论。包括：l  大数据概述： 主要介绍大数据基本概念、大数据技术架构和大数据应用。讲者：杜小勇博士，教授；文继荣博士，教授；l  大数据平台： 主要介绍键值对系统、流数据处理系统、NoSQL数据库、文档数据库、图数据库等。讲者：覃雄派，副教授；陈跃国博士，副教授；窦志成博士，教授；卢卫博士，副教授；l  大数据算法与分析：主要介绍大数据近似算法、大数据与机器学习、社交网络大数据分析、文本互联网大数据分析、多媒体大数据分析等。讲者：魏哲巍博士，教授；卢志武博士，教授；赵鑫博士，教授；窦志成博士，教授；刘家俊博士，副教授；",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大数据系统基础",
  "url": "https://www.chinaooc.com.cn/course/687eb39916c43a09c0e581fa",
  "teacher": "王建民",
  "school": "清华大学",
  "description": "通过本课程学习，了解大数据管理的工具平台、开发环境、基本原理，熟悉典型大数据工具与平台的特性，掌握大数据处理的基本开发方式。在介绍典型系统工具使用的基础上，通过分析其实现原理与设计理论，增强学生大数据工具与平台的应用与开发能力，同时也为有志于继续深入学习大数据专业课程的学生创造基础 。具体课程内容包括：绪论，云计算，文件存储，计算框架，内存计算，NoSQL，流数据处理等。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "汇编语言程序设计",
  "url": "https://www.chinaooc.com.cn/course/67b8fe8d225d72705e4f3d44",
  "teacher": "邢建川",
  "school": "电子科技大学",
  "description": "汇编语言程序设计是计算机及相关专业的专业基础课程，它是计算机组成原理、操作系统、微机原理与接口等核心课程的必要先修课，并且对于训练学生掌握汇编语言程序设计的基本方法，熟悉汇编语言程序上机操作和程序调试技术有着重要作用。   汇编语言是计算机提供给用户最快也最有效的语言，也是利用计算机所有硬件特性并能直接控制硬件的唯一语言，因此在对程序的空间和时间要求很高的场合，汇编语言是必不可少的。而在很多需要直接控制硬件的应用场合，汇编语言也是不可或缺的。汇编语言作为计算机专业的一门必修课程，是了解计算机体系结构和操作系统的最佳切入点。通过汇编语言课程的学习，对计算机理论中包括CPU体系结构、指令调度方式、存储器管理、基本输入输出接口的理解都会有一个比较本质而且直观的认识。在对汇编语言实际运用的基础上，还能增加对高级程序设计语言的体会，包括变量的组织，地址的访问，循环与分支在机器码中的处理，调用函数时参数的传递等。所以汇编语言在本专业中是一门核心课程，通过对本课程的学习，可以加深对后续课程的认识。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "人工智能导论",
  "url": "https://www.chinaooc.com.cn/course/67d5ffba225d72705edb34ff",
  "teacher": "刘若辰",
  "school": "西安电子科技大学",
  "description": "“人工智能导论”是关于人工智能领域的通识类课程，主要介绍人工智能的历史、研究现状以及基本理论和方法，授课对象面向计算机专业、人工智能专业等相关专业低年级本科生以及人文各专业的本科生。课程内容从基础的知识表示以及搜索技术，到机器定理证明以及模糊推理，还涉及计算智能3大领域：遗传算法、群智能以及人工神经网络，还包括机器学习和模式识别，最后还给出几个典型的人工智能应用领域和经典的人工智能应用案例。课程的教学目标是帮助学生了解人工智能的发展和现状，学习和掌握人工智能的基本原理和方法，帮助学生形成对人工智能的相关应用领域的全面认识，激发学生对人工智能的学习兴趣，提供新的思维方法和问题求解手段。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机网络基础及应用",
  "url": "https://www.chinaooc.com.cn/course/686d910316c43a09c08f7cc6",
  "teacher": "丁晟春",
  "school": "南京理工大学",
  "description": "本课程是一门实践性、应用性课程，是非计算机专业计算机基础6门核心课程之一，也是网络工程、计算机科学与技术、信息管理与信息系统、电子商务等专业学生的一门专业核心课程。“计算机网络”课程的特点是：理论性和实践性都很强，同时计算机网络还具有应用繁多、知识面广、连贯性弱的特点。本课程面向非计算机专业学生，在课程体系、教学目标、教学内容的广度和深度上与计算机专业有所区别。\t\t\t\t\t课程根据实地调研企业对于网络技术和应用人次方面的实际需求，注重吸收计算机网络的最新技术成果，改变原来“计算机网络”教学中按照7层协议或TCP/IP协议由低到高讲授协议层次的方法，以应用为出发点，理论讲解通俗生动；同时设置8次网络实验，帮助学生加深对网络原理的理解，提高对网络的应用能力，促进创新性思维。\t\t\t\t\t课程内容体系框架为：导论、数据通信基本知识、计算机网络体系结构、常用网络设备和传输介质的使用、以太网/因特网原理及应用、网络安全与管理。同步配有高等教育出版社出版的《计算机网络与应用》教材。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "VisualBasic6.0程序设计",
  "url": "https://www.chinaooc.com.cn/course/630fe4a0325d39c27c417e12",
  "teacher": "龚沛曾",
  "school": "同济大学",
  "description": "虽然Visual Basic推出已经很多年，新的开发平台层出不穷，但语言基础、面向对象的设计思想、图形界面的设计方法、问题求解的算法思想还是相同的。从简单易学入手，打好程序设计基础，便于以后进一步提高和应用；掌握了Vsual Basic，也可利用VBA（Visual Basic for Application)可在Offic、AutoCAD等软件中进行二次开发，提高软件的自动化功能。           教学中采用 “案例驱动三段式的教学方式”，首先“提出案例”，以应用为目标、精选案例，激发学习的积极性、求知欲望，兴趣是最好的老师；接着“知识展开”，对案例进行剖析，提出相关的概念和知识，便于学生对知识的理解和掌握；最后“问题求解”，对要解决的问题进行详细分析、以流程图形式描述算法设计的思路和步骤，在此基础上编写代码就水到渠成，要让大家体会到编程不是难事、而是有趣的事、非常有用！在求解问题的同时，还提出了进一步拓展的思考，有助于举一反三，融会贯通，掌握程序设计的思想和方法。       程序设计是实践性很强的课程，程序设计的学习不是听会、看会而是做会的，实践是检验正确的标准。每讲都安排了有针对行的实验内容，通过实践环节，不仅可激发你的学习兴趣，巩固了所学知识，更重要的是通过实战训练提高你的编程能力、程序调试能力、分析问题和解决问题的能力。",
  "learners": 100000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "软件工程专业导论",
  "url": "https://www.chinaooc.com.cn/course/67d0c829225d72705ec1b393",
  "teacher": "徐晓飞",
  "school": "哈尔滨工业大学",
  "description": "本课程作为软件工程专业的入门课程，主要使学生初步了解软件工程专业与学科，认识软件工程专业知识内容与学习方法，为进入软件工程专业学习打下良好基础。具体而言，本课程帮助学生了解软件工程的基本概念、知识体系与学科范畴；学习计算思维与计算机基本原理；认识软件与程序表达及问题求解算法；了解软件设计与构造技术及艺术；了解软件工程技术与过程管理；理解软件工程专业学习方法及职业发展。本课程共计11讲。第1讲 软件工程之启蒙：初识软件工程专业第2讲 计算思维之起步：符号化-计算化与自动化第3讲 软件与程序思想：组合-抽象-重复-构造-递归第4讲 软件之灵魂：算法第5讲 软件系统构造：函数-对象-组件-服务第6讲 软件的生命周期第7讲 理解问题：软件需求第8讲 软件技术与艺术结合：软件设计第9讲 软件工程技术：软件测试与维护第10讲 软件工程管理：软件项目管理第11讲 软件之人才–软件工程教育与职业发展这是本课程第十八次开课，欢迎进入学习，祝你学有收获。",
  "learners": 90000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "微机原理与接口技术",
  "url": "https://www.chinaooc.com.cn/course/62354d649906eace04903d35",
  "teacher": "侯彦利",
  "school": "吉林大学",
  "description": "《微机原理与接口技术》课程包括三部分内容：微处理器（CPU）的工作原理、汇编语言程序设计方法和微机接口技术。通过学习，学生可以了解微处理器的基本结构、指令系统和汇编语言程序设计方法、微处理器与主存储器的基本接口、微处理器与设备之间的基本输入输出接口、中断技术、数模(D/A)转换与模数(A/D)转换技术等，还将介绍几款典型数字接口芯片、数/模和模/数转换芯片，同学们由此入门可以达到举一反三触类旁通的效果。通过学习，学生可以掌握使用汇编语言、或C语言控制外部设备实现输入输出的控制程序。通过学习，学生可以读懂由逻辑门电路、触发器等各种逻辑部件组成的数字逻辑电路图，可以掌握可编程并行接口82C55、8253定时器/计数器、8251或16550可编程通信接口等的工作原理，学习控制LED显示器、点阵显示器、键盘、ADC、DAC，并能够掌握控制直流电机和步进电机的控制方法。",
  "learners": 90000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据库系统（下）：管理与技术",
  "url": "https://www.chinaooc.com.cn/course/679420d5225d72705e9d6aa9",
  "teacher": "战德臣",
  "school": "哈尔滨工业大学",
  "description": "本系列课程旨在使学生充分掌握数据库系统的基本概念和基本原理，熟练掌握数据库系统语言、数据库抽象与建模方法和数据库应用程序设计方法，培养学生在信息管理和信息系统方面的抽象、设计、开发、应用和管理能力。同时，数据存储、数据库查询实现、查询优化、事务处理等技术，这些内容也是计算学科学生在专业方面必须掌握的操纵数据库的能力，本课程也将为你详细讲授。\t\t\t\t本系列课程将分为四个部分进行介绍：\t\t\t\t一、基本知识与关系模型；\t\t\t\t二、数据库语言及其应用；\t\t\t\t三、数据建模与数据库设计；\t\t\t\t四、数据库管理系统实现技术。\t\t\t\t这四部分内容之间的关系如下图示意。\t\t\t\t\t\t\t\t\t\t\t\t这四部分内容将分为三门课程来开放。本课程《数据库系统（下）-管理与技术》将包括第四部分内容。\t\t\t\t本系列课程的特色：(1)本课程是一门理论性为基础、应用性为目标，理论应用相结合的计算机类主干课程；(2)抽象内容的实例化讲解是本课程的特色，通过大量具体示例，来阐释数据库相关的抽象概念和原理；(3)知识学习与案例点评相结合是本课程的特色，本课程包含数据建模和数据库设计相关的内容，重要的是知识的运用，案例点评则成为知识运用能力训练的重要手段； (4)问题导引的知识学习是本课程的特色，深入浅出，图文并茂，案例配合，面向问题地阐释数据库系统的核心内容。本课程将为学生从事大型信息系统软件的设计、开发和应用打下基础，也将为学生今后从事大规模数据的存储、操纵和分析奠定很好的基础。",
  "learners": 90000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Linux操作系统编程",
  "url": "https://www.chinaooc.com.cn/course/62354d7b9906eace0490bdb3",
  "teacher": "肖堃",
  "school": "电子科技大学",
  "description": "本课程采用理论与实践相结合的方式，选取具有代表性并且有着广泛实际应用的操作系统——Linux作为基础，对Linux下应用程序的设计思想、开发特点、开发手段进行介绍，锻炼学生在Linux下设计和开发原生应用程序的实践能力。本课程对Linux下应用程序的设计思想、开发特点、开发手段进行介绍，并重点讲述文件I/O、目录操作、进程控制、线程控制、多任务同步与通信等POSIX API的使用方法和编程技巧。本课程是《C语言程序设计》与《操作系统基础》课程的后行课程，是对这两门课程的相关知识的应用、延续和深化。",
  "learners": 90000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大学计算机——计算思维之路",
  "url": "https://www.chinaooc.com.cn/course/634dd9e8325d39c27c41c5c9",
  "teacher": "王移芝",
  "school": "北京交通大学",
  "description": "“大学计算机”是面向各专业本科生开设的计算机系列课程中第一层次的课程，是本科生必修的通识教育课程，更是二十一世纪人人都需要掌握的一种文化。本课程以培养思维能力为核心，以计算机文化素养培养、激发学生主动学习意识为主导思想，实现计算机赋能教育。      教学目标是通过学习，掌握信息化社会数据处理的方法与手段。课程基于“计算文化与计算基础—计算平台—数据处理与管理—问题求解与实现”这样一条脉络，介绍计算机科学与技术所蕴含的计算思想与计算技术；强化学生对计算机科学的认知，使之掌握大数据时代数据处理与问题求解的基本方法与手段、建立正确的科学思维模式，并初步具备灵活运用程序设计的思想与方法求解实际问题的能力。       通过本课程的学习，将培养学生学习与思维能力，实现赋能教育，倡导“人人都要学会像计算机科学家一样思考与解决问题”，灵活地运用计算技术解决问题。       整个课程共八讲，每周1讲，时长10周，通过学习来了解并掌握从计算平台到问题求解的全过程，为后续计算机程序设计等课程的深入学习奠定良好的基础。在授课过程中，我们会通过实验案例辅助知识学习与应用，在案例的不断深化和提升中，由浅入深地引导大家循序渐进地学习与练习，使之达到对问题求解的融会贯通，不断提升思维能力。",
  "learners": 90000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机操作系统",
  "url": "https://www.chinaooc.com.cn/course/66219fc2bb5c5a80256b10a3",
  "teacher": "蒲晓蓉",
  "school": "电子科技大学",
  "description": "操作系统是计算机系统的核心系统软件，负责控制和管理计算机的全部软硬件资源，力求使各类资源高效利用，并最大程度提高整个计算机系统的工作效率，构建一个安全可信的公共系统平台，提供可靠、方便、完善的服务。“计算机操作系统”课程是计算机专业及相关专业的主干基础课程和核心课程之一，在计算机知识结构中有着重要的地位和作用，是计算机及相关专业课程的重要基础。通过本课程的学习，使学生掌握计算机操作系统的基本概念和功能，理解现代操作系统经典的实现原理、方法、算法和相应的数据结构，帮助学生建立系统级概念，并将操作系统的实现原理用于应用软件和系统软件的设计与开发。更新提示: 根据前期同学们的反馈，本次所有视频和作业，测验，都尽早发布，供同学们灵活选择时间学习、作业和测试。大家可以根据自己实际情况，安排学习内容，完成作业，测验和考试；后期加入课程的同学也便利参与作业、测验等环节。",
  "learners": 90000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Web编程技术",
  "url": "https://www.chinaooc.com.cn/course/67afc6b5225d72705e22c21d",
  "teacher": "谢涛",
  "school": "西安交通大学",
  "description": "在互联网与信息技术高速发展的今天，我们已深切感受到学习、工作和生活方式上的巨大变化。了解互联网的运行机制、掌握一些基本的Web编程技能、了解并亲自尝试云端Web实验、在我国拥有自主知识产权的操作系统——鸿蒙上尝试开发APP，对大多数学习者来讲，都是一件有趣且必要的事情。该课程紧扣网络与信息技术发展的趋势，以“前台+后台+云+移动应用”为支撑，以“能力+项目”为驱动，使学习者既了解Web基本框架，培养基本的Web编程技能，又了解云端开发与应用和移动APP开发。在内容组织上，该课程主要包括WEB原理、开发过程和环境部署；HTML语言； CSS技术、JavaScript、PHP技术、数据库技术、HarmonyOS移动应用开发；重点介绍JavaScript、PHP、数据库及移动应用开发。本课程紧跟技术前沿、框架清晰、结构合理、讲解清楚、实验丰富，并提供多种实验方案供学习者选择，是学习者快速了解与学习Web编程知识的最佳选择。学完该课程，学习者将具备独立的Web平台搭建能力和初步的Web平台及移动应用开发能力。",
  "learners": 90000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机系统与网络安全技术",
  "url": "https://www.chinaooc.com.cn/course/67b3c5f5225d72705e35d60e",
  "teacher": "周世杰",
  "school": "电子科技大学",
  "description": "本课程以讲授计算机系统和计算机网络安全基础知识、基本方法和基本技术为主，其内容分为9章。第一章 信息安全概述主要讲述信息安全基本概念、安全服务与安全机制、网络攻击等。第二章 TCP/IP协议安全隐患及应对措施主要讲述TCP/IP协议族中主要协议（包括ARP协议、IP协议、BGP协议、RIP协议、ICMP协议、TCP协议、UDP协议、HTTP协议、DNS协议、SMTP协议、POP协议、Telnet协议等存在的安全隐患及应对方法。第三章 网络安全隔离技术主要讲述安全隔离基本概念，网络隔离设备（包括交换机、路由器等）、防火墙隔离技术、虚拟子网隔离技术、物理隔离技术等。第四章 网络安全技术主要讲述网络安全预警、保护、检测、响应、恢复等相关技术。第五章 网络安全协议主要讲述安全协议基础知识、安全协议主要攻击方法（包括中间人攻击、重放攻击、交错攻击等）、典型的安全协议（包括口令认证协议、Keberos协议、X.509协议、IPSec协议、SSl协议、SET协议等）。第六章 计算机系统可靠性技术主要讲述可靠性、容错、容灾、数据备份与恢复技术。第八章 操作系统安全主要讲述操作系统安全基本概念、网络安全模型、访问控制技术、操作系统认证技术、Windows操作系统安全和UNIX操作系统安全等。第七章 计算机系统可靠性技术主要讲述可靠性技术、硬件冗余技术与软件容错技术、数据容错技术、磁盘阵列技术和容灾技术等。第九章 安全审计与电子取证技术主要讲述安全审计与审计系统、计算机犯罪及电子取证技术等。",
  "learners": 80000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C编程方法学",
  "url": "https://www.chinaooc.com.cn/course/63eabbb0af1f1b5d3ecfa784",
  "teacher": "李民",
  "school": "武汉理工大学",
  "description": "C语言是目前仍然广泛使用的计算机程序设计语言，是本科各学科专业学生学习计算机技术课程的基础课。C语言适用范围广、语法简洁、执行效率高。C语言是典型的结构化程序语言，是学习面向对象程序语言的基础。C语言编程方法的学习，已经成为普通本科院校大多数专业方向的必修课程。 按照教育部计算机基础教学指导委员会对高等院校计算机基础教学的基本要求，按照将计算思维能力培养作为计算机基础教育的核心任务的宗旨，通过深入研究了不同专业大类的培养目标和计算机技术学习需求，结合大学学生特点，我们确立了课程总体教学目标为培养学生初步具备以下三方面的能力，即：具有应用C语言编制结构良好的程序的能力；具有算法分析的基本能力；具有对程序进行调试和测试的基本能力。从而，能根据要求编制程序解决实际问题；为后续课程的学习打下良好基础。  本课程的教学一共有8章，从内容组织上分为3个部分： 1. 第1章、第2章是入门基础，结合编译环境的安装使用，介绍了C语言的基本语法。2. 第3章是程序设计的基本结构，介绍了基本的结构化程序设计方法，简单算法的设计和表示方法，帮助学生学会根据算法编制程序，并设计出结构较为复杂的程序。3. 第4章到第8章是模块化程序设计，学生通过模块化函数掌握程序模块的设计方法，并进一步通过数组、指针、结构体、位运算、数据文件等全面掌握C语言编程方法，培养分析问题和解决问题的能力。",
  "learners": 80000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "操作系统",
  "url": "https://www.chinaooc.com.cn/course/67ad2e96225d72705e160e0f",
  "teacher": "李培峰",
  "school": "苏州大学",
  "description": "操作系统（Operating System，简称OS）是管理和控制计算机硬件与软件资源，直接运行在“裸机”上的最基本的系统软件，任何其他软件都必须在操作系统的支持下才能运行。操作系统是用户和计算机的接口，同时也是计算机硬件和其他软件的接口。操作系统的功能包括管理计算机系统的硬件、软件及数据资源，控制程序运行，提供人机交互界面，为其它应用软件提供支持等。\t\t\t\t\t本课程的教学组织为六个部分：计算机操作系统概述、处理器管理、内存管理、文件管理和设备管理。在教学中将结合实例操作系统来进行操作系统基本原理的讲解，使得学习者不仅能够认识和掌握操作系统的基本概念与实现原理，也能够深入理解实例操作系统的设计方法与实现技术。",
  "learners": 80000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Java核心技术(进阶)",
  "url": "https://www.chinaooc.com.cn/course/6792d090225d72705e971147",
  "teacher": "陈良育",
  "school": "华东师范大学",
  "description": "本课程主要讲授Java核心技术进阶部分，以Java多方位应用实践为主。本课程一共包含10章，分成52个视频，每章3-6个视频不等。课程主要内容包括：构建工具Maven，单元测试工具JUnit，高级文件处理、多线程和并发、网络、邮件、数据库、RMI、Java和其他语言交互等。本课程注重Java应用讲解，并通过大量例子程序进行辅助理解。学生学习本课程后，可以编写实用的Java程序，有能力编写涵盖大部分软件功能需求的程序。",
  "learners": 80000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "组合数学",
  "url": "https://www.chinaooc.com.cn/course/687eb3a516c43a09c0e58215",
  "teacher": "马昱春",
  "school": "清华大学",
  "description": "组合数学是计算机出现以后迅速发展起来的一门数学分支,主要研究离散对象的存在、计数以及构造等方面问题。由于计算机软件的促进和需求，组合数学已成为一门既广博又深奥的学科，其发展奠定了本世纪的计算机革命的基础，并且改变了传统数学中分析和代数占统治地位的局面。本课程从排列组合的基本概念出发，系统介绍了有关组合计数的理论和方法，主要内容包括计数的基本法则、母函数与递推关系、鸽巢原理和容斥原理、波利亚计数定理。这虽然是一门研究生课程，但是学习者只需要具备初等的数理知识就可以开始学习。我们将从基础的排列组合开始，逐步深入了解计数问题的不同解决思路，通过对现实生活中计数问题的演绎和学生们共同体会组合计数问题不断抽象深入的挖掘过程，引导学生共同感受数学知识的精妙，从而深入理解组合数学对计算机理论发展的推动作用。",
  "learners": 80000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "软件测试",
  "url": "https://www.chinaooc.com.cn/course/6500e6b1374ed23bd755fc8d",
  "teacher": "陈振宇",
  "school": "南京大学",
  "description": "第1周：软件测试基础本节主要熟悉课程系统，了解测试基本概念，重点理解Bug及其测试原理。第2-3周：软件测试方法本节主要讲解常用白盒测试方法与黑盒测试方法。白盒测试方法从程序员的角度看如何测试代码，并以JUnit为基础进行实践。黑盒测试方法从用户角度看进行系统测试，并以Selenium和PICT为基础进行实践。第4-6周：软件测试实践本节主要讲解功能测试、性能测试和移动应用测试。功能测试以微软记事本为例进行探索测试讲解，介绍华三的测试案例。性能测试以趋势、淘宝和华三为例进行讲解。移动应用测试以百度和趋势为例进行讲解。",
  "learners": 80000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机图形学",
  "url": "https://www.chinaooc.com.cn/course/62354d779906eace0490a4bc",
  "teacher": "赵明",
  "school": "中国农业大学",
  "description": "计算机图形学是近30年来发展迅速、应用广泛的新兴学科，是计算机科学最活跃的分支之一。如何在计算机中表示图形、以及利用计算机进行图形的计算、处理和显示的相关原理与算法，构成了其主要研究内容。在计算机辅助设计制造、科学计算可视化、地理信息系统、农林业等领域有着非常广泛的应用，是计算机、地理信息系统、电子工程、机械设计、建筑等本科专业一门重要的专业基础课，也是许多后续课程（图像处理、模式识别、多媒体技术、虚拟现实、计算机视觉等）的基础课程，在教学计划中占有重要地位和作用。",
  "learners": 80000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C#程序设计",
  "url": "https://www.chinaooc.com.cn/course/68814ea716c43a09c0f2ce97",
  "teacher": "刘君瑞",
  "school": "西北工业大学",
  "description": "C#是由C和C++衍生出来的面向对象的编程语言，它在继承C和C++强大功能的同时去掉了一些它们的复杂特性，同时综合了Visual Basic简单的可视化操作和C++的高运行效率。C#以其强大的操作能力、优雅的语法风格、创新的语言特性和便捷的面向组件编程支持成为.NET开发的首选语言。本课程内容即包括语言基础知识，又注重培养学生编程技能。教学过程中，在程序设计语言知识方面采用了“快节奏”，\t从一开始就以简单程序框架展开程序知识，直接进入以程序模块化为主的教学环境，帮助同学们尽早开始编程实践；在程序设计方法和编程技术方面采用了“慢节奏”，通过经典示例的讲解分析，以大量的\t思维训练确保学生获得编程技巧。 课程内容注重实际编程应用，使学习者能够快速上手。同时通过设置循序渐进的实训习题及讲解，使学习者稳步获得扎实的编程技能，为学习者参与各种计算机类竞赛、软件开发、工程实训提供强有力的支撑。",
  "learners": 80000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "算法设计与分析",
  "url": "https://www.chinaooc.com.cn/course/66fdd3e84220cd272a82027c",
  "teacher": "童咏昕",
  "school": "北京航空航天大学",
  "description": "从辗转相除法到割圆术，从算盘到电子计算机，算法在人类文明发展中始终扮演着重要角色。如今，有计算的地方，就有算法的身影。从网上购物到出行规划，从工作学习到休闲娱乐，算法无所不在,已融入到人们生活的方方面面。\t本课程是面向计算机和信息技术相关专业本科生的核心专业课，同时适合对算法的基础知识有学习需求的相关从业人员。课程汇聚了北航计算机学院顶级的算法授课团队，不但讲授分而治之、动态规划和贪心策略等经典算法技术，而且以产教融合的方式邀请阿里巴巴等互联网公司副总裁、ACM国际大学生程序设计竞赛世界冠军等产业界算法专家进行经验分享。\t本课程具有对基础知识要求少、对核心方法讲解细、对算法本质剖析深、对产业需求分析准的特点。无论你是你是零基础的算法初学者，还是在算法刷题中困惑的求职者，相信本课程都将通过详细易懂的实例剖析降低理解难度，通过相关问题的归纳总结揭示算法本质，助你真正学懂算法！",
  "learners": 80000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大数据基础与应用",
  "url": "https://www.chinaooc.com.cn/course/64ff99ac374ed23bd755fb80",
  "teacher": "计卫星",
  "school": "北京理工大学",
  "description": "本课程的特色主要包括：（1）本课程讲授大数据分析的基本原理、相关技术和典型应用案例，学习者能够了解大数据应用系统的构造方法和过程，培养大数据思维意识，掌握数据分析的基本技术和方法。（2）本课程以大数据处理流程为线索，分别介绍数据采集、数据清洗加工、数据分析、开源大数据计算平台、数据可视化等内容。对常用的大数据编程语言Python进行入门级介绍。（3）课程中介绍了大量的大数据应用案例，这些案例来自于不同的行业和领域，为大家提供不同学科专业多方面的参考。（4）课程基于华为公有云设计了在线大数据实践体系，在学习理论知识的同时，按照实验手册，亲自动手实践，体验各种算法和工具。（5）课程介绍了大数据人才需求及常见的工作岗位，为学习者进行自身的职业规划提供参考和帮助。本课程是教育部-华为“智能基座”精品慕课之一，理论讲授部分在爱课程网学习，实践操作部分在双创云实践平台学习（https://www.xiaoqiqiao.com/loginPage/login.html）。实践平台的部分截图如下所示：实验启动界面：系统概览界面：实验操作界面：",
  "learners": 80000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "算法设计与分析入门",
  "url": "https://www.chinaooc.com.cn/course/67db45d5b836e5522ac7eabc",
  "teacher": "王宏志",
  "school": "哈尔滨工业大学",
  "description": "“算法设计与分析”有用算法是计算机科学的核心主题之一，其重要性不言而喻。有一个好的算法设计与分析功底是从事计算机相关各种工作的坚实基础。从就业来看，算法基础是许多名企面试必考的内容；从科学研究来看，算法设计与分析是计算机科学诸多领域研究中必须的技能。“算法设计与分析”有趣这是一门有趣的课程，算法给了我们一个看待世界和看待生活的新方式，从中学到的不仅是让计算机做事情的方式，还有“递归”、“分治”“优化”、“剪枝”等等一系列可能改变生活的思维方法。“算法设计与分析”需要努力学习和很多知识性的课程不同，算法设计与分析是一门重视能力的课程，如同九阴真经，是一门既修炼“内功”也修炼内功的学科。因此学习算法设计与分析既需要像数学课一样的证明、又需要像程序设计语言一样的写码，因而需要格外的努力才可以学得好。",
  "learners": 70000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "操作系统",
  "url": "https://www.chinaooc.com.cn/course/66cd100a711dc30c3470e7de",
  "teacher": "翟高寿",
  "school": "北京交通大学",
  "description": "‍本课程是计算机类专业的必修课程，旨在全面系统地介绍操作系统的体系结构、设计机理及实现方法和技术，包括自启动装入、系统调用与接口、处理器调度及进/线程控制、同步与通信机制、死锁处理、基于分区/分页/分段的内存管理及虚拟存储、设备管理、文件系统等，从而培养同学在操作系统研发方面的理论基础及技术素养。课程教学力争突出如下特色和亮点：1、知识体系务求科学合理、教学内容务求丰富完善、难点讲授务求思路清晰；2、注重实践与理论并重，持续更新完善实验课题体系，引导学生钻研具有一定创新性和挑战度的操作系统研发难题以培养实践能力及实用技能；3、全面贯彻以学生为中心及因材施教和兴趣驱动的教学理念，注重教学互动、及时反馈和答疑指导。",
  "learners": 70000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Web前端攻城狮",
  "url": "https://www.chinaooc.com.cn/course/687eb3c816c43a09c0e5825b",
  "teacher": "刘强",
  "school": "清华大学",
  "description": "随着前端技术的不断更新以及边界持续拓展，前端开发已经超出了传统Web应用的范畴，客户端开发、Node.js服务器端开发甚至VR等都被纳入了前端范畴。Web前端技术涉及的知识面非常广，发展速度非常快，前端语言及其功能强大的开发框架层出不穷。但是无论如何变化，HTML、CSS和JavaScript是Web前端开发中最为基础的编程语言，是一切Web前端技术的基石。《Web前端攻城狮》课程将从Web前端的发展历史、基础知识和关键技术等多方面展开教学，由企业资深前端工程师亲自传授成长为前端“攻城狮”的修炼之术。",
  "learners": 70000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "云计算技术与应用",
  "url": "https://www.chinaooc.com.cn/course/67ef27ccb836e5522a21a56e",
  "teacher": "孙宁",
  "school": "河海大学",
  "description": "云计算是继1980年代大型计算机到客户端-服务器的大转变之后信息技术领域又一次巨变。从技术上看,大数据与云计算的关系就像一枚硬币的正反面一样密不可分。大数据的特色在于对海量数据的挖掘, 但它必须依托云计算的分布式处理、分布式数据库、云存储和虚拟化技术。“云计算技术与应用”课程在介绍云计算历史、发展及趋势的基础上，重点介绍云计算关键技术、基础架构及各种主流解决方案。课程主要内容包括：云计算概述、云计算关键技术、云服务体系、云计算主流解决方案（Google云计算、Amazon云计算、阿里云计算等）、开源云计算与大数据处理平台（OpenStack、Docker、Hadoop等）。由于云计算是近年来计算机科学技术中的研究和应用热点，技术平台更新快，因此本课程会紧密跟踪主流云计算技术及发展，拓宽学生知识面。",
  "learners": 70000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大数据平台核心技术",
  "url": "https://www.chinaooc.com.cn/course/62354c709906eace048c2394",
  "teacher": "武永卫",
  "school": "清华大学",
  "description": "面向信息科学技术类研究生或高年级本科生，主要由业界一线研发人员讲授大数据平台涉及到的分布式系统构架、分布式编程、分布式流处理、分布式数据存储管理、内存计算支持等内容，通过实践，力图覆盖大数据处理平台的主要核心技术，帮助学生了解分布式大数据平台设计中的关键挑战，提出实际的解决方案，为研究生未来研究方向提供参考。课程重点讲解设计原理，突出技术深度和实战性。【参考资料】李妹芳，《ODPS权威指南》。本书是学习和掌握ODPS的权威指南，作者来自阿里ODPS团队。全书共13章，主要内容包括：ODPS入门、整体架构、数据通道、MapReduce编程、SQL查询分析、安全，以及基于真实数据的各种场景分析实战。本书基于很多范例解析，通过在各种应用场景下的示例来说明如何通过ODPS完成各种需求，以期引导读者从零开始轻松掌握和使用ODPS。同时，本书不局限于示例分析，也致力于提供更多关于大数据处理的编程思想和经验分享。书中所有示例代码都可以在作者提供的网站上免费下载。这本书对平台架构介绍不多，偏应用方面，但对了解阿里的大数据平台能够做什么可能有些帮助。",
  "learners": 70000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "VC++面向对象与可视化程序设计（上）：Windows编程基础",
  "url": "https://www.chinaooc.com.cn/course/687eb3c816c43a09c0e5825a",
  "teacher": "黄维通",
  "school": "清华大学",
  "description": "本课程应用Visual C++环境，介绍面向对象与可视化程序设计的基本思想与方法。课程中对每一部分的知识点、概念、难点，都力求以较精炼的语言进行讲解，同时，对每一个知识点都配以必要的应用实例，并配以较为详细的代码，以案例驱动的方式帮助读者较好地掌握“面向对象与可视化程序设计”的思路和开发技巧，重点掌握“事件驱动消息响应”的机制。本课程内容主要包括Windows编程基础和MFC编程基础。其中Windows编程包括几何图形绘制、文本输入/输出、键盘与鼠标的应用以及资源的应用等基础知识；MFC可视化编程部分主要包括MFC库的基本知识、各种类在编程中的应用、各种控件的应用、利用Visual C++的资源编辑器编写资源文件及其应用以及单文档与多文档的操作等知识点，此外还介绍了数据库编程等实用技术。",
  "learners": 70000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机网络",
  "url": "https://www.chinaooc.com.cn/course/687ab77b16c43a09c0d1b13c",
  "teacher": "钱燕",
  "school": "南京农业大学",
  "description": "本课程是非计算机理工类本科专业学生的计算机类选修课，旨在为各专业的学生提供计算机网络学习指导。课程主要介绍计算机网络的基本概念，基本理论和基本方法。通过学习计算机网络基础理论、实用技术和掌握计算机网络基本操作拓展视野，增强技能，提高大学生的社会竞争力。  本课程讲述内容包括计算机数据通信的基本概念与理论、计算机网络的体系结构、各层网络协议、局域网、广域网、网络互联、TCP/IP与Internet、网络应用、网络安全，目的是使学生掌握数据通信与计算机网络的工作原理，培养学生对计算机网络的研究、分析、设计、组网与应用开发能力，并学会各种实用网络维护技术，为今后开展这方面的工作打下基础。",
  "learners": 70000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "VC++面向对象与可视化程序设计（下）：MFC编程基础",
  "url": "https://www.chinaooc.com.cn/course/687eb3c716c43a09c0e58257",
  "teacher": "黄维通",
  "school": "清华大学",
  "description": "本课程应用Visual C++环境，介绍面向对象与可视化程序设计的基本思想与方法。课程中对每一部分的知识点、概念、难点，都力求以较精炼的语言进行讲解，同时，对每一个知识点都配以必要的应用实例，并配以较为详细的代码，以案例驱动的方式帮助读者较好地掌握“面向对象与可视化程序设计”的思路和开发技巧，重点掌握“事件驱动消息响应”的机制。本课程内容主要包括Windows编程基础和MFC编程基础。其中Windows编程包括几何图形绘制、文本输入/输出、键盘与鼠标的应用以及资源的应用等基础知识；MFC可视化编程部分主要包括MFC库的基本知识、各种类在编程中的应用、各种控件的应用、利用Visual C++的资源编辑器编写资源文件及其应用以及单文档与多文档的操作等知识点，此外还介绍了数据库编程等实用技术。",
  "learners": 70000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "基于Java的面向对象编程范式",
  "url": "https://www.chinaooc.com.cn/course/677f0a6ab60b1822c5f262b4",
  "teacher": "刘钦",
  "school": "南京大学",
  "description": "这，不是21天速成Java课程；不是Java语法细节讲解课程；是一门讲编程基础思想的课程；是一门讲面向对象思想的课程；是一门讲编程最佳实践的课程；需要动手写代码的课程；第一周增加了一些基础Java训练，测试大家Java基本水平；之后每周一道；会带着大家一起做，一起讲解；希望大家学完之后能够有恍然大悟的感觉。",
  "learners": 70000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "信息安全概论",
  "url": "https://www.chinaooc.com.cn/course/62354d7c9906eace0490c9af",
  "teacher": "吕春利",
  "school": "中国农业大学",
  "description": "随着信息技术的发展以及计算机应用的普及，网络环境中的信息安全与人们的生活、工作和学习息息相关。本课程主要介绍信息安全的基本概念，密码学的基本术语和原理，以及日常使用中安全知识和技能。由于信息安全的核心是密码学，所以密码学也是本课程的重点。本课程由绪论、信息安全初步、信息安全技术、传统密码学、公钥密码算法、Hash函数、基于身份的公钥密码学、数字签名、密钥管理和密码学中的基本数学知识组成。本书可作为计算机科学、通信、电子工程等相关专业的本科学生或研究生一个课程。请注意这不是教黑客技术的课程：）",
  "learners": 70000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "汇编语言程序设计",
  "url": "https://www.chinaooc.com.cn/course/687eb3ef16c43a09c0e5829d",
  "teacher": "张悠慧",
  "school": "清华大学",
  "description": "在清华计算机系，汇编语言程序设计通常作为本科生接触到的第一门计算机系统课程，被定位为该系列的入门课，起到“承上启下”的作用。主要的授课内容包括：（1）汇编语言与计算机系统结构、指令集初步、数制与整数表示、浮点数表示；（2）80x86计算机组织与保护模式、X86指令系统与寻址方式、C与X86汇编、X86汇编编程；（3）MIPS汇编。课程强调汇编语言的软硬件分界与桥梁作用，使得学习者能把程序的执行与计算机的工作过程紧密联系起来，以便深入地感知、理解和体会计算机的逻辑功能以及各种软件系统的原理，逐步形成软件系统功能构筑在其上，硬件系统功能运行于其下的计算机系统思维能力。",
  "learners": 60000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "互联网创新与创业",
  "url": "https://www.chinaooc.com.cn/course/687eb99b16c43a09c0e591dc",
  "teacher": "崔勇",
  "school": "清华大学",
  "description": "随着互联网技术的高速发展，互联网产业已经成为影响人类日常生活的重要基础。技术创新和互联网思维不断冲击并颠覆着整个世界。本课程将从案例分析为主，帮助学生了解基于信息技术创新的创业思路，激发学生的创新创业热情，理解信息技术创新及商业模式创新的重要性。课程教学环节包括五个部分：（1）对互联网领域初创企业进行案例分析，了解信息技术创新的重要性以及实现其潜在社会价值的一般规律；（2）对互联网领域的典型企业分析，了解新技术及新方向，理解企业经营理念以及信息技术创新趋势的重要性；（3）分析阐述包括知识产权、用户需求等创业环境对技术创业的影响；（4）讲述典型的科技创业投融资方式和初创企业的成长路线；（5）商业计划书撰写能力培养。希望同学们能够在课程学习期间，在讨论区与老师和同学们多多互动，把自己的所思、所想、所得以文字的形式记录下来。祝愿同学们学有所得、学以致用。",
  "learners": 60000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机系统基础（二）：程序的执行和存储访问",
  "url": "https://www.chinaooc.com.cn/course/67c63c59225d72705e8eca75",
  "teacher": "袁春风",
  "school": "南京大学",
  "description": "本课程主要介绍可执行文件中的代码如何在CPU中执行，如何从存储器中取指令，以及如何从存储器中取数据或存结果。在本课程中，我们主要围绕以下问题进行讲解。\t\t计算机中的CPU是如何执行程序的？\t\tCPU中包含哪些基本的功能部件？\t\t存放代码和数据的主存储器如何构成？\t\t存放文件的磁盘存储器是怎么工作的？\t\tCPU如何把一个虚拟地址转换为主存地址？\t\t如何利用高速缓存技术加快访问存储器的速度？\t\t IA-32/Linux平台如何实现存储访问？",
  "learners": 60000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据结构",
  "url": "https://www.chinaooc.com.cn/course/6865ad3516c43a09c067e740",
  "teacher": "王海艳",
  "school": "南京邮电大学",
  "description": "通过本课程学习，使学生掌握计算机科学中组织、表示和处理数据的基本方法，培养学生运用数据结构和算法知识解决应用问题的能力，提高算法设计和程序设计水平，为《数字图像处理与图像通信》、《网络技术与应用》和《数据库技术与应用》等很多与IT相关的后续课程学习，也为“大信息”背景下非数值应用软件的开发打下良好的理论基础。本课程的学习，有助于IT相关专业的学生解决各自专业中软件设计的问题。 本课程的教学内容包括线性表、栈和队列、数组、树和二叉树、集合、搜索树、散列表、图和文件等常见的数据结构，讨论各种典型的搜索和内、外排序算法。此外，还介绍递归算法、各种典型的搜索算法和内、外排序等算法，并给出算法分析的基本方法。 希望同学们在经过本课程的学习，能够做到：从数据的逻辑结构、存储结构和运算三个方面理解并掌握线性表、栈、队列、数组、树、图和文件等常用的数据结构；了解在各种常用的数据结构上实现的排序和查找运算；对算法的时间和空间复杂性有一定的分析能力；针对常见的应用问题，能选择合适的数据结构及设计有效的算法解决问题。",
  "learners": 60000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "基于Linux的C++",
  "url": "https://www.chinaooc.com.cn/course/687eb3e716c43a09c0e58294",
  "teacher": "乔林",
  "school": "清华大学",
  "description": "Linux操作系统开源的特性使得其获得越来越重要的地位，而Linux系统编程也向C++程序设计者提出了更高的要求。本课程由C/C++语言的共性与特性出发，在深入学习程序设计语言的基础上，进一步强调程序设计语言的适用性，并与Linux系统编程紧密结合，通过大力培养学习者的抽象思维能力和计算思维能力，将学习者对语言作为工具的基本认知转化为动手实践能力，完成从具象到抽象再到具象的思维能力转变。课程内容主要涵盖C++程序设计基本概念、数据组织与算法设计、程序组织、面向对象程序设计方法、泛型编程与模板库以及进程、线程、内存管理、设备驱动程序、网络等Linux系统编程核心主题。",
  "learners": 60000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "高级语言程序设计",
  "url": "https://www.chinaooc.com.cn/course/67b517c2225d72705e3c3297",
  "teacher": "张长海",
  "school": "吉林大学",
  "description": "‍‍荷兰著名计算机学家Edsger W. Dijkstra曾说过，“我们所使用的工具深刻地影响着我们的思维方式和思维习惯，进而也将深刻地影响着我们的思维能力”。 计算机技术的普及已经深刻影响了现代人类生活的各个方面。“计算思维”就如同读、写、算能力一样，是所有人必须具备的思维能力。计算思维是运用计算机科学的基础概念进行问题求解、系统设计、以及人类行为理解等涵盖计算机科学之广度的一系列思维活动。编程能力即是这种思维能力的一种体现。本课程目标是通过对C语言的学习和使用，使您掌握结构化程序设计语言的基本概念、思想和方法，从而获得初步的程序设计能力（能够编写小规模程序解决实际问题），逐步养成并具备一定的计算思维能力。课程以实际应用为背景，以“案例驱动”不断引入相关知识点，随着案例不断深入，将程序设计各相关知识点展现在读者面前，形成一条完整知识链条。因案例都是常见实际应用或初等数学问题，和生活密切相关，所以您大可不必担心学不会。课程注重计算思维训练，即对实际问题求解过程、逻辑过程的抽象、理解和应用；因此大量使用PAD（Problem Analysis Diagram）描述程序逻辑结构，而非直接使用代码讲解；目的是帮助您不受编程语言限制，理解抽象过程；最终达到举一反三，融会贯通，掌握结构化程序设计的思想和方法，形成初步的编程和计算思维能力。为什么选C语言作为载体语言？C语言作为当代最优秀的程序设计语言之一，它的优点远远超过了它的缺点。经验表明，程序设计人员一旦学会使用C语言之后，就会对它爱不释手；而且很多语言都是在它基础上发展起来的；所以C语言当之无愧地成为思想交流的首选载体语言。       时间安排：我们将用12周时间来学习具体的C语言语法、结构化程序设计基本概念、思想和方法（观看视频、随堂测验、参与讨论等进行学习），客观题周测用来检验您对基本概念的掌握情况，主观编程题周测用来训练您的编程和计算思维能力。期末主讲教师会用1周左右的时间，通过公告在网上带领大家进行知识梳理回顾，帮助您对所学知识进行整理、归纳形成一个完整的知识体系。最后1周则是期末考试（包含客观和主观编程题），检验总体学习情况。",
  "learners": 60000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大学计算机--计算思维的视角",
  "url": "https://www.chinaooc.com.cn/course/65d7cf90bb5c5a802527e255",
  "teacher": "郝兴伟",
  "school": "山东大学",
  "description": "“大学计算机—计算思维的视角”是高等学校计算机公共教学核心课程，是大学通识教育的重要组成部分。课程以培养学生的信息素养和计算思维为主线进行课程内容设置，其教学目标是：全面培养学生的信息素养，培养学生良好的计算思维能力，传授计算机科学基础知识，为各学科学生计算机相关课程的学习打好基础，最终提高学生的计算机问题求解能力和计算机应用水平。",
  "learners": 60000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "android智能手机编程",
  "url": "https://www.chinaooc.com.cn/course/62354d7a9906eace0490b4de",
  "teacher": "王立",
  "school": "国家开放大学",
  "description": "《Android智能手机编程》课程的内容主要包括理论部分和实践部分；其中理论部分主要涵盖移动开发的基本概念，包括资源访问、用户界面、组件使用、数据存储、多媒体程序设计、GPS定位服务等方面。实践部分是针对前面基础理论设计的案例实践，让学生在一步一步的编程实践中，学习掌握智能手机的编程技能，提高学生的综合应用能力。通过本课程的学习，使学生对基于Android系统的智能手机编程有一个全面的了解，初步掌握Android智能手机编程的基本知识、基本理论和相应的程序编写技能。让我们在学习中积累知识、掌握技能、享受快乐、收获友情！",
  "learners": 60000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大数据机器学习",
  "url": "https://www.chinaooc.com.cn/course/687eb3f216c43a09c0e582a4",
  "teacher": "袁春",
  "school": "清华大学",
  "description": "《大数据机器学习》课程是面向信息学科的高年级本科生或研究生开设的基础理论课，目的是培养学生深入理解大数据机器学习理论基础，牢固掌握大数据机器学习方法，并能够解决实际问题等综合能力。课程的主要内容包括：统计学习基本理论，机器学习基本方法，深度学习理论和方法。",
  "learners": 60000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "JAVA程序设计进阶",
  "url": "https://www.chinaooc.com.cn/course/687eb3fa16c43a09c0e582b7",
  "teacher": "许斌",
  "school": "清华大学",
  "description": "随着java技术的普及，学术界和工业界使用java语言的人数越来越多，涉及领域也越来越广，尤其是大数据和分布式系统的迅速普及，java技术得到前所未有的发展和流行。本课程在java基础编程的基础上针对java线程、网络编程、java虚拟机、垃圾回收机制、java集合类详解、java反射与代理以及java的字节码技术等做进一步的讲解和分析，使得学习该课程的同学能更加深入的理解和掌握java语言和相关技术。",
  "learners": 60000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机科学导论",
  "url": "https://www.chinaooc.com.cn/course/6876c43516c43a09c0bdcf6c",
  "teacher": "董荣胜",
  "school": "桂林电子科技大学",
  "description": "根据马克思主义哲学“实践是认知的基础”这一论断，将计算学科中的抽象和理论，分别与感性认识和理性认识对应，将计算学科中的设计与实践对应，构建“计算机科学导论”课程的总体结构框架；课程包含计算思维与计算机科学导论；计算学科专业名称的演变，学科的描述、培养侧重点；教学问题的探讨（含BLOOM分类法、SOLO分类法，难度、复杂度与能力的理解）；计算学科的基本问题（算法复杂性中的难解性问题，RSA公开密钥密码系统，组合爆炸问题，程序设计中的结构问题，软硬件资源的管理问题，计算机中的博弈问题等）；计算学科中的抽象、理论和设计三个过程（含计算机语言的发展及其三个过程的内在联系）；计算学科中的核心概念（绑定、大问题的复杂性、概念模型和形式模型、一致性和完备性、效率、演化、抽象层次、按空间排序、按时间排序、重用、安全性、折中与结论）；计算学科中的数学方法（集合，函数和关系，代数系统，定义、定理和证明，必要条件和充分条件，证明方法，递归和迭代，公理化方法）；计算学科中的系统科学方法（系统科学的基本思想，在软件开发中引入系统科学方法的原因，结构化方法，面向对象方法）；社会和职业的问题等内容。",
  "learners": 60000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大学计算机基础",
  "url": "https://www.chinaooc.com.cn/course/6782fb7cb60b1822c50573bd",
  "teacher": "姚怡",
  "school": "广西大学",
  "description": "计算机作为新世纪人们最得心应手的“通用智力工具“，谁不认真学习和掌握这一工具，谁就会落伍。《大学计算机基础》（Windows 10 & Office2016/2019）是面向大一新生开设的公共必修课程，是学习其他计算机相关课程的基础课。本课程没有采取罗列知识点的传统教学方式，而是采用轻松有趣的动画形式去演绎计算机基础理论知识，并通过大量教学案例培养学生办公自动化能力，为今后应用计算机进行学习和研究奠定基础。  课程特色：1.拒绝枯燥的知识轰炸，采用动画的形式去演绎计算机基础和网络等理论性知识，形象生动，易于理解。2.手把手带领大家制作Office办公软件案例，在做的过程中遇到问题再去学习知识点。同时,提供陪伴式反馈，有疑问可以随时联系群内小伙伴和老师。3.训练习题强调针对性、和互联网融合，鼓励大家将所学和自己的专业、感兴趣的领域进行有效结合。",
  "learners": 60000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "VisualBasic.NET程序设计入门",
  "url": "https://www.chinaooc.com.cn/course/630e90bb1fdc0303f43acc8e",
  "teacher": "龚沛曾",
  "school": "同济大学",
  "description": "信息时代，对大学生来说了解计算机是如何工作的？计算机是如何听从人们的指挥工作？如何利用计算机来解决各自专业的问题？程序起着关键的作用。程序设计已成为提高信息素养和计算机应用能力的重要基础课程。程序设计语言很多，琳琅满目各有特色，选择什么语言既能快速入门和触类旁通，又能满足实际应用开发的需要？对于非计算机专业尤其偏文类专业的学生，Visual Basic.NET程序设计语言是不错的选择。   课程教学以“提出问题、解决问题、归纳分析”的问题求解驱动式的教学方法，不仅让学生掌握程序设计的基本概念、思想和方法以及逻辑分析能力，更加训练学生以一种正确的思维方式去解决问题，初步具备在现代编程环境下解决实际问题的能力。   程序设计是实践性很强的课程，程序设计的学习不是听会、看会而是做会的，实践是检验正确的标准。通过实践环节，不仅可激发你的学习兴趣，巩固了所学知识，更重要的是通过实战训练提高你的编程能力、程序调试能力、分析问题和解决问题的能力。    Visual Basic.NET程序设计的学习考虑到MOOC特点和学时安排，现将课程分为“Visual Basic.NET程序设计入门”和““Visual Basic.NET程序设计进阶”（简称“入门”和“进阶”）两门课程。“入门”课程针对程序设计初学者，对课程的完整学习和应用开发还应学习“进阶”课程。本学期先开设“入门”，下学期依次开设“入门”和“进阶”。两门课程分别管理，证书分别发放。",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "嵌入式系统及应用",
  "url": "https://www.chinaooc.com.cn/course/67afc744225d72705e22c32e",
  "teacher": "王宜怀",
  "school": "苏州大学",
  "description": "课程简介：\t\t\t \t\t\t本课程是计算机科学与技术、物联网工程、电子信息等专业的重要技术类课程。嵌入式计算机系统简称为嵌入式系统，其概念最初源于传统测控系统对计算机的需求，是不以计算机面目出现的“计算机”，这个计算机系统隐含在各类具体的产品之中，在这些产品中，计算机程序起到了重要作用。其应用范围可以粗略分为两大类：一类是电子系统智能化（如工业控制、汽车电子、家用电器、物联网应用、嵌入式人工智能等），这类应用也被称为微控制器MCU领域，从形态上看，更类似于早期的电子系统，但内部计算程序起核心控制作用。另一类是计算机应用的延伸（如平板电脑、手机等），这类应用也被称为应用处理器MAP领域。\t\t\t从学习与开发角度，微控制器MCU是学习嵌入式系统的入门环节，且为重要的一环，它注重软件硬件协同，注重底层硬件接口、驱动及软硬件密切结合的开发调试技能等。应用处理器MAP更接近通用计算机系统，学习与开发方式也类似于通用计算机。从学习规律角度看，若是要全面学习掌握嵌入式系统，应该先学习掌握微控制器，然后在此基础上，进一步学习实时操作系统、嵌入式操作系统、应用处理器软件开发等，而不要倒过来学习。\t\t\t微控制器是嵌入式人工智能、工业物联网的“大脑”，是嵌入式系统的技术核心。本课程按照“入门时间较快、硬件成本较少，软硬件资料规范、知识要素较多，学习难度较低”的基本原则，选择流行的32位ARM Cortex-M系列微处理器为蓝本，以嵌入式硬件构件及底层软件构件设计为主线，基于嵌入式软件工程的思想，按照“通用知识—驱动构件使用方法—测试实例—芯片编程结构—构件的设计方法”的线条，逐步阐述电子系统智能化嵌入式应用的软件与硬件设计。使读者逐步掌握嵌入式系统的基本知识要素、基本原理与设计方法，获得嵌入式系统的基本脉络，打好软硬设计基础，逐步学会电子系统智能化嵌入式应用的软硬件设计，强化实践训练。\t\t\t本课程教学用书《嵌入式技术基础与实践（第6版）—基于STM32L431微控制器》，该教材历经十多年凝练，仔细梳理了嵌入式系统的通用基础知识要素，注重把握通用知识与芯片相关知识之间的平衡、把握硬件与软件的关系、对底层驱动进行构件化封装、设计合理的测试用例，教材内含简明实验套件，结合网上电子资源，方便读者进行实践与应用。\t\t\t\t\t\t\t《嵌入式技术基础与实践（第\t6\t版）》（王宜怀主编）\t\t\t【书内含通用嵌入式计算机GEC,型号：AHL-STM32L431，可完成书中基本实验】\t\t\t教材内含开发套件图片：\t\t\t\t\t\t\t\t教材可在 当当、京东等网络销售平台上购买。\t\t\t\t\t电子资源下载地址及路径：\t\t“https://sumcu.suda.edu.cn/”\t→“金葫芦专区”→“嵌入式书6版”，右边为下载索引",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "区块链技术与应用",
  "url": "https://www.chinaooc.com.cn/course/67b7bb67225d72705e48e772",
  "teacher": "赵其刚",
  "school": "西南交通大学",
  "description": "习近平总书记在中央政治局第十八次集体学习时强调：“把区块链作为核心技术自主创新重要突破口，加快推动区块链技术和产业创新发展，积极推进区块链和经济社会融合...”作为第二代互联网技术架构，区别于第一代互联网技术架构以“信息”的传播为核心，区块链以“价值”与“信任”的传递为核心。区块链的出现，不仅带来了全新的一种技术集成、开发与运营架构，而且是一种思维模式、应用模式的全面创新，是智能互联时代的基础性技术。本课程以整体性、系统性地介绍区块链为目标，使学习者避免目前互联网上对区块链的支离破碎的学习与理解，涉及区块链的概念、知识体系、应用场景及典型区块链技术架构。通过本课程的学习，有助于学习者建立对区块链的全面、系统性理解。本课程的诸多观点、知识体系及应用场景的总结相当部分来源于我们自身在信息技术研究、教学与工程实践中的理解，结合区块链的深入思考，具有原创性。关键词：区块链、人工智能、5G、量子计算、云计算、大数据、物联网、词：区块链、人工智能、5G、量子计算、云计算、大数据、物联网、移动互联网、密码学、新经济、现代管理学、马列哲学、社会学、商业模式、经济组织、智慧城市、信息化、数字化、网络工程、计算机原理、计算机网络、互联网关键词：区块链、人工智能、5G、量子计算、云计算、大数据、物联网、移动互联网、密码学、新经济、现代管理学、马列哲学、社会学、商业模式、经济组织、智慧城市、信息化、数字化、网络工程、计算机原理、计算机网络、互联网+、创新与创业、宏观经济学、微观经济学、会计学、制度经济学、审计学、管理学原理、行政学、行政管理学、公共管理学、法学、金融学、法律基础、英语、英语语音、科技英语、主题英语、英语写作、英语演讲、演讲与口才、教育学、教育心理学、人工智能教育、医学、医药学、政治学、管理会计、成本会计、企业会计、现代农业、生物化学、生物信息学、作物育种学、作物栽培学、研究生入学、考研高等数学、研究生入学英语、研究生入学数学、研究生入学政治、研究生入学数据结构、研究生入学离散数学、研究生入学概率论、研究生入学程序设计、研究生考试移",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "现代密码学",
  "url": "https://www.chinaooc.com.cn/course/67b7ad4e225d72705e48e30b",
  "teacher": "聂旭云",
  "school": "电子科技大学",
  "description": "现代密码学是网络空间安全的核心基础。通过本门课程的学习，能够了解现代密码学基本理论，掌握现代密码学基本技术，理解各类密码算法的应用场景和相关的安全需求，培养信息安全意识，掌握安全需求分析的方法，并了解现代密码学的未来发展方向。本课程共分为9章，第1章概述，介绍密码学的基本概念、密码学的发展简史和古典密码算法。第2章到第6章是按照密码算法的设计思路和功能不同来划分，分别是流密码、分组密码、公钥密码、杂凑函数、数字签名，第7章密码协议主要介绍Diffie-Hellman密钥交换和Shamir秘密分享方案，更复杂的一些密码协议可在后续“网络安全协议”课程中学习。第8章将介绍可证明安全理论的初步知识。第9章将介绍一些密码学研究的前沿方向，比如属性基加密、全同态加密、后量子密码学等。",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "App Inventor-零基础Android移动应用开发",
  "url": "https://www.chinaooc.com.cn/course/67ad2cd6225d72705e160d84",
  "teacher": "吴明晖",
  "school": "浙大城市学院",
  "description": "移动互联网技术和智能手机发展迅猛，移动应用Apps的开发备受关注。本课程以 Android 的图形化积木式编程软件 App Inventor 2 中文版 为载体，无需任何编程基础，从零起点开始， 通过案例引导和项目驱动的教学方式，培养学生的计算思维能力，并具备基本的 Android应用开发能力。 本课程为国家精品在线开放课程、Google精品课程。",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "大学信息技术基础",
  "url": "https://www.chinaooc.com.cn/course/6790276a225d72705e8a5e8c",
  "teacher": "陈琼",
  "school": "福建农林大学",
  "description": "本课程冠以“大学信息技术”之名，信息化、网络化、智能化是贯穿课程的主题，内容涵盖极其广泛，也形成了本课程的主要特色。信息化本身指的是信息表示方式与处理方式，课程相关章节较为深入地介绍了信息与信息技术的概念、计算机软硬件系统、媒体数字化、问题解决与程序设计、计算机通信与网络技术、信息安全等内容。作为信息化的公共基础设施，互联网已经成为人们获取信息、利用信息的主要方式，课程拓展视频和拓展阅读材料包含了互联网+、物联网、云计算、大数据等基于互联网的应用技术。“以Python为舟”是本课程的另一个明显特点，“为舟”之意是将Python做为工具，结合信息技术理论与知识的介绍，通过Python程序的演示或示例，将理论学习和实际应用紧密结合，使得“教与学”都变得有趣和高效。学生不必了解Python程序设计语言本身，而只须知道Python程序是如何利用其强大的功能，简洁、有效地解决复杂问题的过程，进而激发学习的兴趣和思考，并为后续准备学习Python程序设计的学习者，结合自身专业需求，解决本领域信息处理的相关问题，打下基础.本课程提供各章Python源代码，同时还提供数据科学、大数据、机器学习等三个完整的综合案例，可以让学习者切实体会到如何借助于Python的计算生态和软件技术解决复杂问题的过程，并体验Python语言的简洁之美。   \t大学信息技术基础各章Python源代码：https://github.com/David-Github-Project/Information-Technology-Course-Resources",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据库技术与程序设计",
  "url": "https://www.chinaooc.com.cn/course/687eb41116c43a09c0e582f3",
  "teacher": "高裴裴",
  "school": "南开大学",
  "description": "无论是专业人士的职场需要，还是在校学生自主学习，本课程都不会让你失望！慕课资源丰富，知识点拼图、思维导图、动画导入、讨论区活动、技术拓展阅读、在线习题都齐全。学员和教师都可以获得全套的教学资源，完全免费学习，随时有南开教学团队答疑。    1. 知识点拼图教学路线：结合课程的教学目标，将软件工程中的数据库系统层次模块分解为“知识点拼图”，每一片拼图对应数据库应用系统开发中的一个模块。知识点拼图能让学习者从总体上把握知识点层次架构，又能够清晰了解各拼图之间的内在关系，从而在学习过程中，逐步解锁新的拼图模块，关联下一层知识点，采用层层递进的方式实现整个数据库系统开发。授课教师采用本课程进行教学时，可采用以下的教学规划，将“知识点拼图”+“问题求解流程”+“软件工程开发教学流程”三者结合到一起。2. 以学习者为中心，阶段性学习目标明确：在每一章MOOC开始告诉学习者新解锁的拼图，知道“我已经学习了什么，我正在学习什么，我将要学习什么”。各章都有详细思维导图，将知识体系思想可视化。               3. 探究式的学习流程：采用二维动画，用故事性的叙事方法，创造了学生“小南”和“老师”两位卡通形象，用实际工程需求启发思考并导入章节内容，以学生为第一视角，设计了探究式的学习流程。每个单元包括：卡通片问题导入——学习里程图——思维导图——视频图文——单元小结——拓展阅读——自我测试——讨论话题。4. 从学生角度看问题，采用“师生问答”：在综合设计章节中加入学生角色，用师生问答的方式，从学生角度发现问题并解决问题。 5．课程受众范围广，教学目标理论与实践并重：让学习者了解数据管理的基本理论，熟悉面向应用的数据库设计流程，具备开发小型数据库应用系统的能力。采用理论讲解+案例操作实践结合的方式，视频呈现多样化。配套教材、实践指导与测试已在清华大学出版社出版。           6. 课程荣誉：2020年南开大学教学创新大赛一等奖。2020年、2017年南开大学教学成果二等奖。2018、2019年建设立项2项，2015、2019年、2020年教学改革立项4项，2018年、2020年国家一级学会立项2项。自2013年以来，经该课程实训培养出的大一新生团队，获得国家级、省部级计算机竞赛一、二、三等奖35项，激发学生学习兴趣并使其保持持续学习的动力。 7. 课程配套教材《数据库与信息系统设计-慕课版》、《数据库与信息系统设计-实践指导与测试 慕课版》清华大学出版社  2021。课程中的理论讲解、例题、图、表，均可以在书中找到详细解释。教材配有实践指导、课件等电子资源，欢迎使用！",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Python语言程序设计",
  "url": "https://www.chinaooc.com.cn/course/62354d7c9906eace0490c303",
  "teacher": "鲁凌云",
  "school": "北京交通大学",
  "description": "Python语言是程序设计语言领域 20 年来最重要的成果之一，在产业界广泛应用，尤其随着人工智能（AI）技术的不断演进，已成为国际上最流行的程序设计语言之一。Python语法简单、但功能强大，编写简洁、且可读性好。Python语言的另外重要优势是能够与各种编程语言对接，俗称“胶水语言”。因此，它能够用简单的语法结构封装其他编程语言最优秀的程序代码，进而非常迅速地成为各专业接口型编程语言。   《Python 语言程序设计》课程是一门基础课，入门课程，适合于没有接触过任何编程语言的同学。本课程的教学目标是通过12周的学习，了解程序设计的基本方法、掌握Python语言基本语法。学习完此门课程，同学们将会设计简单程序，轻松编写百余行代码，为进一步学习Python高阶知识和技能打下坚实基础。学习完此门课程，同学们将构建计算思维，人人要具有初步思考与解决实际问题的编程能力。     授课需24周，共6章教学内容。     (1) 前12周，完成1到6章的学习。由浅入深地引导大家循序渐进地学习与练习。   （2) 后12周，通过大量的实验案例辅助大家完成Python语言的实践环节学习。通过问题求解，提升计算思维。",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "嵌入式软件设计",
  "url": "https://www.chinaooc.com.cn/course/67b66959225d72705e428d0e",
  "teacher": "赖晓晨",
  "school": "大连理工大学",
  "description": "第一次上课前首先看这里啊啊啊啊^0^^^^^^^^^^^^^加入课程：注册中国大学MOOC的账号，通过课程查询找到本课程，加入课程学习课程定位：本课程的定位为混合式课程，关于课程的各方面情况介绍，以先介绍纯线上MOOC课程，后补充SPOC课程建议的方式列出。教学大纲：课程资源组织为16节课的形式（14章内容），大家可在下方看到以章节名目排列的课程大纲。学时安排：本课程按照每周2次课，各2学时设计，8周完成课程全部32学时学习。同学们可以自由选择每周的学习时间。课程资源简介：课程资源包括91集授课视频和拓展学习视频、106份非视频资料、16套课后习题、2套单元测试和1套期末测试，以及全部章节对应的代码资源。大家可以在本网站左边侧的“课件”栏目中找到所有课程资源。教学活动安排：1. 每章均有授课视频、课件等资源每节课后，均有自测题，需要同学们自学完成。2. 每节课后均有作业题，包括5道左右选择题，以及数量不等的讨论题，用于检测学习效果。3. 本课程在进行过程中，安排了两次单元测试，需要大家按时完成。4. 本课程结课之前，需要所有同学按时完成一套期末考试题。教师线上答疑及作业反馈：教师每周上线回复所有讨论问题。课程技术：1.进行本课程的纯线上教学时，须采用本平台的讨论区、作业区；2.进行本课程实验时，同学们须自备计算机，并安装有Linux系统及C语言编辑器、编译器、链接器、调试器，即能够完成对课程实例的调试，对应学习目标2-4及学习目标5的虚拟驱动部分；安装Proteus虚拟仿真软件，能够完成课上虚拟仿真电路的设计与调试，对应学习目标6的Proteus部分。混合式教学：1. 教学模式本课程采用混合式教学时，包括线上教学和线下教学两部分内容。线上环节中，同学们需要在课前自学完成当次课所有教学资源；线下环节中，教师可在自己的SPOC班中组织翻转课堂，进行课程内容讨论、答疑、课上练习、课堂测试、专题报告等内容。2. SPOC教学建议进行混合式SPOC教学的老师，可根据自己学校的实际情况，自行确定授课的时间和地点，推荐每周4学时，采用带有多媒体设备和圆桌教室组织翻转课堂。3. 雨课堂技术本课程推荐使用“雨课堂”软件进行线下翻转课堂教学，同学们可通过弹幕及时向教师提问，并随时解答教师安排的课内练习题。教师课通过对弹幕问题的回答，及时解决学生的问题，以及通过对学生回答问题的即时分析，了解学生的掌握情况，以实时调整教学节奏。4.课程实验技术（1）学生必须配备线上教学所需要的计算机及全部相关软件（如上所述），对应学习目标的2-5（不含实际设备驱动部分）和学习目标6的Proteus部分。（2）在实验环节，进行SPOC教学的学校应配备基于ARM的实验设备，包括但不限于ARM9/10/11,Cortex A系列等处理器，即可完成本课程绝大部分实验，如需进行STM32部分的实际操作，还应配备有基于STM32的实验设备，对应学习目标5的实际设备驱动部分及学习目标6的STM32部分。5.即时联系方式建议教师与学生建立微信群，以方便随时联系。",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "面向对象C++程序设计",
  "url": "https://www.chinaooc.com.cn/course/67afc6b8225d72705e22c22f",
  "teacher": "皮德常",
  "school": "南京航空航天大学",
  "description": "本课程作为大学生学习计算机编程的入门语言，系统地介绍C++语言的基本概念，主要包括：C++基本数据类型、流程控制、函数、数组、指针、结构体、文件操作、类的基础部分、类的高级部分、继承、多态、虚函数、异常处理，课程设计等等。使学生能够掌握常用数据结构、算法以及面向对象程序设计的基本方法，能够对中等规模的问题及其解决方法用计算机语言进行描述。    C++语言是在C语言的基础上发展起来的，它继承了C语言的很多优点，而又加入了面向对象程序设计的特性，大大提高了程序开发和维护的效率。本课程的实验环境是：一台计算机、安装相应的软件（操作系统：如Windows等；C++编程环境：如Visual C++ 6.0、VS2010、DevC++等）。   程序设计是一门实践性很强的课程，该课程的学习有其特点，必须通过大量的编程训练，在实践中掌握编程知识，培养编程能力，并逐步理解和掌握面向对象的程序设计的思想和方法。在这里所提供的，只是基础的知识讲解，程序设计的方法，要想真正学会编程，还需要更多的时间去练习。",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机硬件技术基础",
  "url": "https://www.chinaooc.com.cn/course/67b3c638225d72705e35d642",
  "teacher": "柳秀梅",
  "school": "东北大学",
  "description": "《计算机硬件技术基础》课程是面向非电专业开设一门计算机公共基础课。本课程主要讨论单机系统范围内计算机各部分和系统的组成及内部工作机制。通过对本门课程学习，学生将了解计算机各大部件的工作原理、组成方法以及相互关系，了解计算机系统的层次化结构概念，熟悉一些典型的有代表性的计算机结构，理解硬件与软件直接的接口界面，建立起一个完整的计算机系统的整机概念。这门课可作为《计算机组成原理》的前导课程，为后续课程的学习提供必要的基础知识。《计算机硬件技术基础》课程共包含八个章节，共计60多个知识点。课程以冯．诺依曼计算机模型作为教学起点，介绍计算机的组织结构和工作原理，剖析计算机的运算器、存储器、控制器和输入输出设备的组成、工作原理与相互关系。目标是使学生对计算机的内部结构、功能部件、功能特征、性能以及交互方式全面掌握，通过本课程的学习和课程配套的系列实验之后，学生不应当把计算机看着一个执行程序的黑匣子，可以从计算机的组成原理和系统结构角度，完整说明计算机的工作过程，并能根据计算机的特征编写出更加高效的程序，为计算机系统分析、设计、开发和使用能力奠定基础。",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算思维的结构",
  "url": "https://www.chinaooc.com.cn/course/678844f0225d72705e643ab1",
  "teacher": "董荣胜",
  "school": "桂林电子科技大学",
  "description": "本课程讲授的主要内容有：伟大的计算原理，计算思维的结构，计算机方法论概述，课程评价问题的探讨（BLOOM分类法、SOLO分类法，难度、复杂度与能力）；计算学科的基本问题（算法复杂性中的难解性问题，RSA公开密钥密码系统，组合爆炸问题，程序设计中的结构问题，软硬件资源的管理问题，计算机中的博弈问题等）；计算学科的抽象、理论和设计3个学科形态（计算机语言的发展及其3个学科形态的内在联系）；计算学科的核心概念（算法，数据结构，数据的存储和表示，数据的编码、校验）；计算学科中常用的数学方法（集合，函数和关系，代数系统，定义、定理和证明，必要条件和充分条件，证明方法，递归和迭代，公理化方法，形式化方法）；计算学科中常用的系统科学方法（系统科学的基本思想，软件开发引入系统科学方法的原因，使用系统方法的思考）；\t跨学科的若干计算问题案例，包括社会与职业中的计算问题，数学领域中的割圆术和科赫曲线，地球科学领域中的森林火灾，物理学领域中的多普勒效应，社会学领域中的小世界网络，生物学领域中的向日葵模拟，艺术领域中的烟花模拟，游戏领域中的俄罗斯方块等。除了社会与职业中的3个计算问题外，本课程给出的其他案例均采用了可视化的计算机模拟仿真实现。 本课程还设置了可供学生选修的与课程核心内容相呼应的实验，可以让学生在体会计算机科学编程之美的过程中进一步理解计算机科学的基础概念，提高学生问题求解和系统设计的计算思维能力。“计算思维的结构”课程建设为2014年教育部高教司—微软公司校企合作专业综合改革一类项目，项目得到微软公司的资助。",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "软件测试与质量",
  "url": "https://www.chinaooc.com.cn/course/62354d799906eace0490ab1d",
  "teacher": "武剑洁",
  "school": "华中科技大学",
  "description": "亲爱的同学们：       2021年的春节即将过去，我们将迎来新的一个学期，我们的《软件测试与质量》课程也将迎来第六次开课啦。下面简要介绍一下本课程。软件测试伴随软件开发的出现而出现，随着软件复杂度的不断攀升，人们又进一步提出软件质量的概念，并提出多种软件质量保证的方法。软件测试课程是软件类和计算机类专业的核心课程。本课程是一门关于软件测试与质量的入门课程，面向软件或计算机专业的学生，或对软件测试有兴趣的学习者，围绕软件测试与质量的基本概念、核心方法、管理与应用、软件质量与度量等内容展开讨论。本课程内容主要分为四大组成部分：1、需求篇，讨论软件测试中的几个核心概念，帮助初学者建立软件测试是以用户需求为中心的观点，建立软件测试只能验证软件质量，但无法提高软件质量的思想，并尝试从这些核心概念出发，展开初步的、自由的测试设计；2、技术篇，讨论黑盒和白盒测试技术中的核心方法，传递基于风险和效率的测试用例设计思想，从随意的测试转向规范的测试设计，并将介绍初步的单元测试思想、方法和工具；3、管理与应用篇，介绍行业测试工具，讨论软件测试管理及应用，帮助学习者理解软件测试不仅需要掌握测试技术，而且需要提高测试效率，需要良好的过程管理，但自动化测试不是软件测试的银弹；4、质量篇，讨论软件质量模型和度量的相关内容，帮助学习者在软件开发过程中形成缺陷预防的意识。",
  "learners": 50000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "软件项目管理",
  "url": "https://www.chinaooc.com.cn/course/6866f7c016c43a09c06e7e4f",
  "teacher": "韩万江",
  "school": "北京邮电大学",
  "description": "《软件项目管理》是软件工程专业课，国家级一流本本科课程，国家规划教材、北京市优质教材、150多所高校采用为教材。通过本课程的学习，可以掌握软件项目初始、项目计划、项目执行控制到项目结束的软件项目管理全过程，理论与实践相结合。本课程旨在培养和提高学生的软件开发能力、团队协作能力以及管理好软件项目的能力，使学生逐步具备解决复杂工程问题的能力，为企业输送实用性、创新性人才。课程融入产业新技术、嵌入式思政，实现产教研思融合。课程特色：1、RAE与BOPPPS结合的多维度混合教学模式。实现以“学生为中心”的线上与线下、老师与企业专家、老师与学生、传统与智慧等多维度混合教学模式。2、产教研思一体化框架。实施PBL、案例分析、前沿拓展、轻度翻转、科教融合、产教融合、嵌入式思政、小组讨论等多种教学方法。覆盖Bloom六层教育目标。3、教学资源丰富、共享历史悠久。线上线下教学资源丰富，与国家规划教材、北京市优质教材同步持续改进，百余所高校共享。",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "机器学习与人工智能",
  "url": "https://www.chinaooc.com.cn/course/62354d779906eace0490a1bb",
  "teacher": "张朋",
  "school": "浙江大学",
  "description": "本课程主要讲授机器学习和人工智能的基本概念、方法和应用。主要包括以下内容：1.机器学习概念和常用方法分类2.损失函数、优化方法3.机器学习基本算法，包括决策树、K近邻、支持向量机、线性回归、逻辑回归、感知器、深度学习、KMeans、EM算法4.机器学习合奏学习算法，包括Boosting、AdaBoost、GDB等5.机器学习理论和实验准则，模型复杂度和方差均衡策略，交叉验证方法",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机图形学",
  "url": "https://www.chinaooc.com.cn/course/6515feef374ed23bd75617c5",
  "teacher": "万琳",
  "school": "华中科技大学",
  "description": "计算机图形学是研究怎样利用计算机来显示、生成和处理图形的原理、方法和技术的一门学科，是计算机科学与技术、软件工程、数字媒体技术等专业的必修课。近年来，计算机图形学被广泛应用在影片渲染、计算机游戏、虚拟现实、科学计算可视化等多个方面。 我们的计算机图形学课程有管线视角、理论体系完整、编程框架先进（将对课程中讲解的实验提供配套代码下载，包括完整工程以及工程中用到的资源，如课程团队原创的卡通人物形象的模型资源等）三个特点：第一，管线视角的图形学，按照图形渲染管线的三个概念阶段，即应用程序阶段、几何阶段、光栅化阶段来组织课程内容，将整个课程内容划分为五篇：基础篇、应用程序、几何阶段、光栅化阶段、高级话题。第二，构建完整的理论体系，将传统理论和图形新发展结合起来，既包括朴素的软光栅、经典的造型技术，也包括真实感图形学的光照、纹理、阴影等内容，在这些内容中不仅体现经典的算法，还包括一些新的算法如实时光线追踪、法线贴图、实时动态阴影等。第三，搭建先进实用的编程框架，基于可编程管线进行图形编程，采用主流的图形标准OpenGL，并用采用其着色器语言OpenGL Shading Language（简称GLSL）进行着色器的编写（Shader的编写思想与Unity3D相通）。这个图形编程框架充分利用了日趋强大的GPU的计算能力，和目前工业界的实际做法完全相通。设置了从在一个窗口中绘制多边形到粒子系统、延迟渲染的多个进阶实验，逐步提高学生的图形编程能力。实验将提供配套代码的下载链接。https://github.com/wanlin405/Computer-Graphics为了使对计算机图形学感兴趣的同学们拥有更好的学习体验，本次我们的计算机图形学课程将添加了光栅渲染器何PBR渲染器的演示。",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算概论与程序设计基础",
  "url": "https://www.chinaooc.com.cn/course/62354d7b9906eace0490bdce",
  "teacher": "李戈",
  "school": "北京大学",
  "description": "“计算概论与程序设计基础”（北京大学校内课程名“计算概论A”）是针对“信息科学技术学科一年级本科生”开设的一门专业基础主干课程。本课程的教学目标有二：其一，帮助学习者建立起“学习计算机科学技术知识所需的基本知识背景”；其二，帮助学习者“掌握计算机程序设计的基础知识”，培养学习者“独立设计计算机程序解决问题”的基本技能。    本课程的内容主要分为两个部分：（1）计算概论部分，约占课时量的15%；（2）程序设计基础部分，约占课时量的85%；    计算概论部分，我们将为大家解答一些与计算机程序设计相关的基础问题，例如，“计算机为什么能够进行计算？”，“计算机程序在计算机中是如何运行的？”，“计算机的发展规律是什么？”，“下一代的计算机将会是什么样子？”等等。我们希望通过对这些问题的解答，达到两个目的：其一，培养起大家对计算机科学的兴趣；其二，帮助大家建立起学习计算机科学所需要的“背景知识框架”。    程序设计基础部分，我们将以“C 语言”为主要学习对象，以典型的C++编程环境（如Visual Studio C++, Eclipse等）为工具，学习计算机程序设计的相关知识，并培养程序设计的基本技能。通俗讲，在这个部分，我们将教会大家“如何使用C语言编写计算机程序，甚至编写具有一定技术难度的程序”。    对于第一次学习计算机程序设计的同学而言，通常会觉得学习过程比较困难。在这里，我们特别提示大家：“对于难学的东西，更要循序渐进，更要遵循学习规律——先打好基础，逐步进阶！”为此，我们把“程序设计基础”部分的学习划分为四个迭代周期：        周期一： 感性认识计算机程序；         周期二： 理性认识计算机程序；          周期三： 函数——结构化的程序；         周期四： 一些稍复杂的数据结构（指针、结构体、链表等）；    之所以称为“迭代周期”，是因为我们希望在每个周期中，同学们都能够编写出完整、可运行、能解决问题的计算机程序，而不是仅仅学习计算机程序设计语言的某个部分！所以，学习程序设计的过程，应该是一个“在实战中进阶”的过程，而不是一个“知识堆砌”的过程。希望这个迭代进阶的学习过程可以帮助大家顺利达成学习目标。",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Spark编程基础",
  "url": "https://www.chinaooc.com.cn/course/688bdb0616c43a09c0278fef",
  "teacher": "林子雨",
  "school": "厦门大学",
  "description": "Spark是当前热门的大数据处理技术，本课程重点介绍Spark的技术原理与编程方法。课程由全国高校知名大数据教师厦门大学林子雨老师主讲，采用林子雨等编著的《Spark编程基础（Scala版，第2版）》作为课程教材。Spark支持采用Scala、Java、Python和R语言进行编程，本课程采用Scala语言编写Spark应用程序。课程内容包括大数据技术概述、Scala语言基础、Spark的设计与运行原理、Spark环境搭建和使用方法、RDD编程、Spark SQL、Spark Streaming和Spark MLlib等。通过本课程的学习，将帮助学生形成基础的Spark应用程序编程能力，为学生使用Spark技术解决实际科研问题和未来从事大数据相关工作奠定基础。\t\t\t\t本课程属于“\t进阶级”大数据课程，在学习本课程之前，建议首先学习由林子雨老师主讲的“\t入门级”大数据课程《大数据技术原理与应用》（点击这里在中国大学MOOC平台学习林子雨老师主讲的国家精品在线开放课程《大数据技术原理与应用》）。《Spark编程基础》和《大数据技术原理与应用》两门课程之间，在内容上实现了“无缝隙衔接”，可以帮助大数据学习者顺利完成入门学习和进阶学习。  课程提供了配套的在线教学资源服务平台（https://dblab.xmu.edu.cn/post/bigdata-teaching-platform/），平台上提供了与大数据课程学习相关的各种资料，包括讲义PPT、学习指南、实验指南、课后习题、技术博客等，可以为课程学习者提供全方位一站式免费服务，目前平台每年访问量超过400万次，累计访问量超过2500万次，成为国内高校知名大数据教学品牌。     本课程的具体章节如下：（1）第1章-大数据技术概述（2025年9月1日发布）（2）第2章-Scala语言基础（2025年9月8日发布，本章内容较多，学习时长是3周）（3）第3章-Spark的设计与运行原理（2025年9月29日发布）（4）第4章-Spark环境搭建和使用方法（2025年10月6日发布）（5）第5章-RDD编程（2025年10月13日发布，本章学习内容较多，学习时长是2周）（6）第6章-Spark SQL（2025年10月27日发布）（7）第7章-Spark Streaming（2025年11月3日发布，本章学习内容较多，学习时长是2周）（8）第8章-Spark MLlib（2025年11月17日发布）（9）期末考试（2025年11月24日到12月6日）",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "高级语言程序设计",
  "url": "https://www.chinaooc.com.cn/course/67b517c7225d72705e3c329a",
  "teacher": "高克宁",
  "school": "东北大学",
  "description": "本课程的教学目标是通过学习C语言，建立起程序设计的概念，掌握程序设计的基本方法和技巧，养成良好的程序设计风格，从而具备应用程序设计解决相关专业领域内实际问题的基本能力。本课程在系统介绍程序设计语言基本知识的基础上，注重程序设计思想及能力培养，并引入专业应用的实际问题和工程案例。 现代计算机遵循了艾伦·麦席森·图灵（Alan Mathison Turing）提出的”图灵机\"模型，延续冯·诺依曼（John von Neumann）提出的“存储程序式电子计算机“体系结构。计算机程序（包括指令和数据）在运行时，首先存储到内存中，然后在中央处理器控制下自动执行。在执行过程中，按需从键盘、鼠标等输入设备获取信息，并向显示器、打印机等输出设备输出结果。既然计算机程序运行于“存储程序式电子计算机“中，因此我们有必要了解构成程序的指令和数据如何表示和存储，也就是说为了能够编写计算机程序，首先要学习一门程序设计语言。在众多程序设计语言中，C语言为构建Unix操作系统而设计，后来的Windows、MacOS、Linux、Android等操作系统，以及众多应用软件均使用C语言开发。时到今日，C语言依然保持强大生命力。 因此本门课程选择了C语言作为学习程序设计的基础。计算机作为一种计算系统，其数值计算、非数值计算方法与数学、物理、化学、力学等等领域的方法不同，将专业领域的求解方法转换为计算机领域的算法，掌握典型问题的求解算法，是本门课程的重要任务。本课程围绕如何运算、如何表达逻辑、如何处理集合数据、如何实现代码的分解与重用、如何实现基于内存地址的数据访问、如何表达复杂对象、如何实现数据永久存储、如何实现程序移植，系统介绍表达式运算、输入输出、顺序结构、选择结构、循环结构、数组、函数、指针、结构体、文件、预编译处理等内容。按照课程计划，本课程安排15周的学习任务，每周发布2个学时理论学习任务。建议各位同学另行安排2个学时完成上机实践。",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "网络技术与应用实验",
  "url": "https://www.chinaooc.com.cn/course/688d2ba6f57d20271c3f39ca",
  "teacher": "俞海英",
  "school": "俞海英",
  "description": "由于网络技术是一门实验性很强的技术，需要通过实际网络设计过程来加深教学内容的理解，培养学习者分析、解决问题的能力，但实验又是一大难题，因为很少有学校可以提供设计、实施复杂交换式以太网和互联网络的网络实验室，Cisco Packet Tracer软件实验平台较好地解决了这一难题，因此我们推出基于packet tracer的实验课程《网络技术与应用实验》。   Cisco Packet Tracer软件的人机界面非常接近实际cisco网络设备的配置过程，除了连接线缆等物理动作外，学习者通过Cisco Packet Tracer软件完成实验的过程与通过实际Cisco网络设备完成实验的过程几乎没有差别，更为难得的是，Cisco Packet Tracer软件可以模拟IP分组端到端传输过程中交换机、路由器等网络设备处理IP分组的每一个步骤，显示各个阶段应用层消息、传输层报文、IP分组、封装IP分组的链路层帧的结构、内容和首部中每一个字段的值，可以帮助学习者深入了解协议实现过程和各种协议之间的相互作用过程。   本课程中的每一个实验由实验内容、实验目的、实验原理、关键命令说明和实验步骤v组成。通过这些实验的学习，学习者可以具有以下能力：熟练使用Cisco packet tracer的能力；运用Cisco设备设计、配置和实施复杂交换式以太网的能力；运用Cisco设备设计、配置和实施无线局域网的能力；运用Cisco设备设计、配置和实施以太网和ADSL接入网的能力；运用Cisco设备设计、配置和实施各种类型和规模的互联网的能力；设计、配置和实施各种网络应用系统的能力；运用Cisco设备实施各种安全策略的能力。",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Web开发技术",
  "url": "https://www.chinaooc.com.cn/course/687eb43816c43a09c0e58334",
  "teacher": "王成良",
  "school": "重庆大学",
  "description": "本课程是高等院校工科本科软件工程专业高年级学生学习互联网应用开发技术的一门专业必修课。Web应用系统的开发涉及到.NET、JAVA EE、LAMP等开发平台、涉及到Myeclipse、Visual Stusio等多种开发工具、涉及到Javascript、C#、JAVA、python等多种开发语言。主要开发技术包括HTML、CSS、Javascript、HTML DOM、Jquery、XML、XML DOM等Web前端开发技术，还包括JSP、PHP、ASP.NET、ADO.NET、Web Service、Ajax等Web后端开发技术。Web开发的初学者往往会无所适从，不知道从哪儿下手，本课程将引导学生构建整个Web开发的知识体系，循序渐进地将学生领进Web开发的大门。在学习Web开发基本概念、Web开发环境搭建和Web开发工具的使用基础上，通过实际案例讲授HTML、CSS、DHTML、Jquery、XML、ASP.NET动态服务器页面技术(包括Web form控件、内置服务器对象、ADO.NET数据库访问、Web service）、Ajax等技术，使学生掌握开发一个完整的Web应用系统的基本原则、方法和步骤，提高学生应用Web技术进行软件开发的能力，从而使学生具有扎实的Web开发理论基础和较强的实践动手能力。",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算方法",
  "url": "https://www.chinaooc.com.cn/course/65e10614bb5c5a8025501bc2",
  "teacher": "张宏伟",
  "school": "大连理工大学",
  "description": "《计算方法》有别于通常的公共数学（分析数学）课程，属于数值数学的范畴。也称之为-科学计算。即现代意义下的计算数学。本课程主要研究用计算机求解各种数学问题的现代、行之有效数值计算方法及其理论与软件实现。课程的特点：一、构造计算机可行的有效算法；二、给出可靠的理论分析，即对任意逼近并达到精度要求，保证数值算法的收敛性和数值稳定性，并可进行误差分析。三、有好的计算复杂性，既要时间复杂性好，是指节省时间，又要空间复杂性好，是指节省存储量，这也是建立算法要研究的问题，它关系到算法能否在计算机上实现。四、数值实验，即任何一个算法除了从理论上要满足上述三点外，还要通过数值试验证明是行之有效的。课程内容主要包括：矩阵的LU及其相关分解、奇异值分解、求解线性方程组、非线性方程的数值法；矩阵的分析；函数逼近的Lagrange插值公式及Newton插值公式；三次样条插值；求矩阵特征值对的数值方法；函数和离散数据拟合的最小二乘法；复化的梯形求积公式和复化的simpson求积公式、Gauss型求积公式；求解一阶微分方程初值问题的线性单步法、多步法以及Ronge-kutta法、方法的稳定性、绝对稳定性和绝对稳定区间。    通过《计算方法》课程的教学，使学生掌握计算机现代数值方法的基本概念、基本理论与基本方法，使学生在较好地掌握如何将一种数学问题转化为数值问题的基本方法，提高学生用计算机解决数学问题的能力。通过数值实践环节，提高学生的算法编程实现能力，另一方面，通过数值实验，使学生对所学的方法的实际效果有进一步的了解。培养学生综合的素质和提高学生解决问题的能力是其目标。为今后的工程、软件工程实际应用打下坚实数学数值计算基础。",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机组成原理",
  "url": "https://www.chinaooc.com.cn/course/67a54582225d72705eefed0a",
  "teacher": "姜琳颖",
  "school": "东北大学",
  "description": "《计算机组成原理》课程在计算机类专业的教学计划中占有重要地位和作用，是一门重要技术基础课。学习本课程旨在使学生掌握计算机硬件各子系统的组成原理及实现技术，建立计算机系统的整体概念，对培养学生设计开发计算机系统的能力有重要作用。通过本课程的学习，使学生了解计算机的发展历史和未来发展趋势，掌握数字逻辑设计的基本理论和技术，如数制、码制、逻辑代数、逻辑化简技术。掌握数字电路中的基本逻辑器件的基本工作原理和使用中应注意的各方面问题，掌握各种逻辑部件和逻辑单元的基本逻辑功能，初步掌握运用逻辑器件和逻辑部件实现简单的数字电子系统设计的能力。掌握计算机系统的基本知识，掌握计算机内部的各种信息编码、基本运算的操作原理、基本部件的构造和组织方式、部件和单元电路的设计方法，建立一个完整的整机概念，并深刻理解计算机各子系统之间的相互联系以及各自在计算机整机中的地位和作用。",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "高级大数据系统",
  "url": "https://www.chinaooc.com.cn/course/687eb43716c43a09c0e58332",
  "teacher": "王智",
  "school": "清华大学",
  "description": "近年来，人工智能技术渗透到行业的不同领域迅速增加。因此，大数据系统是实现当今数据驱动AI的基础，因此变得至关重要。本课程致力于引导学生学习大数据系统的基本概念，涵盖数据如何有效存储，处理和分析。我们从分布式系统设计的一般原则出发；然后我们提供有关如何在大数据系统中扩展存储，计算和网络功能的框架;最后，为了使这些设计原则易于遵循，我们的案例研究使用真实的工业系统来演示基本设计原则如何应用于实际系统以及如何分析其性能和限制。",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "网络空间安全概论",
  "url": "https://www.chinaooc.com.cn/course/687eb7e116c43a09c0e58c93",
  "teacher": "董晨",
  "school": "福州大学",
  "description": "国家级一流本科课程《网络空间安全概论》全面介绍了网络空间安全的基础理论与应用实践，内容涉及安全领域的方方面面，着重讲解的是基本概念而不是过于深入的技术细节。侧重点在于勾勒网络空间安全的整体框架，力求使学生对网络空间安全有比较全面的了解，通过本课程的学习，让同学们认识安全隐患、增强安全意识、掌握防范方法，为今后的学习生活基础。   这门网络课程内容新颖前沿，主讲教师由福州大学数学与计算机科学学院常年在教学一线的相关专业老师担任，教学团队成员包括：郭文忠老师、董晨老师、张浩老师、刘西蒙老师、何萧玲老师、杨旸老师、邹剑老师、李应老师、刘延华老师、倪一涛老师、孙及园老师。",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "VisualBasic.NET程序设计进阶",
  "url": "https://www.chinaooc.com.cn/course/6262086cf88c3db5120b14b2",
  "teacher": "龚沛曾",
  "school": "同济大学",
  "description": "在“VisualBasic.NET程序设计入门”课程，大家已经学习了面向对象的基本概念、常用控件的使用、基本语法、三种基本控制结构、数组和常用算法，通过编程训练和程序调试，初步具有解决简单问题的能力。当然这仅仅是学习程序设计的开始，要真正利用计算机解决大量实际问题，还有必须进入本课程即“VisualBasic.NET程序设计进阶”课程的学习。这本课程的学习中主要涉及：1.过程 虽然在VB.NET学习中事件过程大家非常熟悉了，VB.NET窗体应用程序是事件过程构成，用户编写的是事件过程代码；也常用到系统定义的内部函数。在程序设计中，还可由用户定义某种功能的过程（函数过程或子过程）供事件过程调用。过程是将问题分解、模块化设计的基础，使得程序结构清晰、精炼、便于调试。2.界面设计 大家在使用各种应用程序时可能体会到，虽然应用程序的功能不同，但界面基本相似，便于用户的使用，这其中的功劳就是由系统环提供的各种界面设计控件：如菜单、工具栏、各种对话框（文件操作、字体、颜色等），通过属性的设置就可快速地设计个性化界面的应用程序。3.数据文件 虽然数组可以存放大量的数据，但一旦程序退出存放在数组中的数据也就丢失，为了长期保存数据，就可通过文件存取操作来实现对数据的长期保存。4.数据库访问 尽管数据文件可以实现数据的长期保存，但对数据的输入、输出和维护依靠用户编程来实现，而数据库管理系统提供的SQL命令、系统提供的ADO.NET组件便于用户开发数据库应用程序。   　5.图形绘制 “一幅画胜过千言万语”，利用系统提供的画图对象、方法和编程技术，可绘制各种艺术图、函数图等，可以设计出你所喜欢的图形，实现图文并茂的效果。   6.递归和递归图形 递归算法思想体现了计算思维中问题分解、抽象和自动化的本质，是计算思维的经典方法。以“递归模式”为核心的教学方法，以解决常规问题的应用驱动，以分形图为拓展，降低学习递归的难度、激发学习兴趣，训练计算思维的能力。让我们一起来探索、实践、提高、分享！",
  "learners": 40000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "Java核心技术(高阶)",
  "url": "https://www.chinaooc.com.cn/course/6792d065225d72705e971144",
  "teacher": "陈良育",
  "school": "华东师范大学",
  "description": "本课程主要讲授Java核心技术高阶部分，以Java深层次原理和高级特性为主，并结合主流框架展示它们的具体应用。本课程一共包含15章，每章3-7个视频不等。课程主要内容包括：Java语法糖、泛型、反射、代理、嵌套类、Lambda表达式、Stream流、Java字节码、类加载器等。本课程注重Java深层次的原理和高级特性的讲解，结合主流框架的源码，介绍高级原理和特性在框架中的应用。学生学习本课程后，可以了解Java的深层次原理，能够有能力阅读主流框架源码，更好地理解和使用主流框架，并编写属于自己的框架软件。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "游戏引擎原理及应用",
  "url": "https://www.chinaooc.com.cn/course/67d35c88225d72705ece71b1",
  "teacher": "韩红雷",
  "school": "中国传媒大学",
  "description": "游戏引擎是目前游戏开发的最重要手段，每一位有志于从事游戏开发的人员，都需要了解游戏引擎的原理，并熟练掌握至少一款主流游戏引擎的使用方法。该课程将系统讨论游戏引擎中的主要功能的实现原理，以及这些功能在Unity引擎中的使用方法。通过该课程的学习，除了可以系统了解游戏引擎原理之外，还将熟练掌握Unity游戏引擎的使用方法，并了解游戏开发的相关流程和技术特点。该课程的特点是：介绍全面、化繁为简。课程提供了超过820分钟的授课视频，包括手把手式的Unity引擎使用教程。每个案例都使用从零开始的方式搭建，抛开繁复的和所学主题无关的资源，可以让学习目的更加明晰，达到“不为浮云遮望眼,只缘身在最高层”的学习成果。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "人工智能基础：数据结构与算法",
  "url": "https://www.chinaooc.com.cn/course/687eb44e16c43a09c0e58367",
  "teacher": "张小艳",
  "school": "西安科技大学",
  "description": "在计算机学科中，“数据结构与算法”是一门研究非数值计算的程序设计问题中计算机的操作对象（数据元素）以及它们之间的关系和基本操作的学科，是人工智能（AI）的底层支撑。AI系统需要处理大量数据（如图像、文本、音频等），高效的数据结构（如哈希表、树、图）能够优化数据的存储与检索，提升算法效率。例如：图结构用于知识图谱，树结构用于决策树算法。许多经典AI算法（如搜索、排序、动态规划）直接依赖于数据结构与算法课程中的知识。例如：A*算法（路径规划）依赖于优先队列，KNN算法（分类）依赖于距离计算与搜索。该慕课旨在将复杂的知识点简单化处理，运用通俗易懂的实例，采取文字、图片动态展现数据结构与算法执行过程，向学习者介绍基础的数据组织、算法设计、时间和空间效率的概念和通用分析方法。帮助学员学会数据的组织方法和一些典型算法的实现，能够针对问题的应用背景分析，选择合适的数据结构，从而培养高级程序设计的技能。在课程教学过程中，坚持立德树人，挖掘课程的思政元素（比如：“一带一路”、“工匠精神”、”抓主要矛盾”），并将其融入教学过程，实现“知识传授与价值引领相结合”的课程教学目标。课程分为四大模块：基本概念、线性结构、非线性结构、基本技术（排序和查找）。44个知识点，68个长度为10分钟左右的视频。基本概念部分重点讲述数据结构定义及相关术语、研究内容、算法评价方法，使学员明白数据结构是什么、学什么、怎么学数据结构；线性结构中重点讲述线性表、栈、队列、数组、广义表的逻辑特性、存储方法、基本操作的实现技巧及算法分析；非线性结构介绍树、图的逻辑特性、存储结构、基本算法的实现策略以及算法设计与分析；基本技术部分包括查找和排序两类经典技术。每个视频均附有相应的学习资料，每章均有典型题例，便于总结提高。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "嵌入式系统及应用",
  "url": "https://www.chinaooc.com.cn/course/67b517c5225d72705e3c3299",
  "teacher": "罗蕾",
  "school": "电子科技大学",
  "description": "本课程是计算机科学与技术专业的一门专业核心课程，属必修学科专业课。它以嵌入式微处理器及嵌入式实时操作系统为重点讲授嵌入式系统相关的知识，培养学生基本的嵌入式系统程序设计与开发的能力，为学生进一步学习和实践嵌入式系统相关知识打下基础。课程配套有深度有内容的实验实践活动，由浅入深，实用性强，具有较强的产业开发背景，加深学生对理论知识的理解和掌握，提高嵌入式系统相关工程软件的开发能力。嵌入式微处理器方面，我们详细解读了ARM处理器的编程模型并配合基于Keil4的相关实验。嵌入式实时操作系统方面，我们以uC/OS-II为例，分析了其在任务管理、同步和通信以及中断、时间、内存方面的设计思路和代码，能够让学生系统性地快速掌握嵌入式系统的核心原理，具备基本的嵌入式系统软件开发能力。注意：课程中还大量穿插了嵌入式领域的业界动态。但由于市场的瞬息万变，某些情况已发生改变。尽管课程组已尽量的进行了补充和更新，但疏漏之处再所难免，请各位学员谅解。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "算法设计与问题求解",
  "url": "https://www.chinaooc.com.cn/course/66d8e727711dc30c34a6eecf",
  "teacher": "李清勇",
  "school": "北京交通大学",
  "description": "“软件 = 算法 + 数据结构”，算法是软件的灵魂。在信息时代，计算思维是分析复杂工程问题的重要思维方式， 计算机则是求解问题的重要工具。本课程以计算机经典问题求解为导向，通用算法思维和编码能力培养为目标，引入ACM 国际大学生程序设计竞赛的有益元素，精心安排课程的理论教学和编程实践。本课程主要讲授计算机问题求解的经典算法设计方法和算法复杂度分析方法，主要内容包括算法复杂度分析，枚举算法，递归与分治策略，动态规划，贪心算法和通用搜索技术。本课程除了强调经典的算法理论和模型，亦兼顾编程实践能力。力图使得学员面对复杂问题时，既能“想到”还能“做到”。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "机器人制作与创客综合能力实训",
  "url": "https://www.chinaooc.com.cn/course/680189ebb836e5522a7c118d",
  "teacher": "贾翠玲",
  "school": "内蒙古工业大学",
  "description": "《机器人制作与创客综合能力实训》课程是以学习机器人基础知识为主，学生动手制作机器人为辅的实践类课程。通过该课程的学习，学生能够了解与机器人有关的科学问题，熟悉机器人的基本工作原理，掌握用程序控制机器人的基本思路和方法；学生通过对简易机器人的设计制作、编程驱动、调试等训练，能够激发学生学习兴趣，提高学生综合知识应用能力、创新能力和动手能力，为进一步学习专业课以及毕业后从事专业工作打下必要的基础。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "集合论与图论（上）",
  "url": "https://www.chinaooc.com.cn/course/674a4f3216d8a05eeda9cc14",
  "teacher": "姜守旭",
  "school": "哈尔滨工业大学",
  "description": "要想用计算机解决问题就要为它建立数学模型，即描述研究对象及对象与对象之间的联系，并通过事物之间的联系找出事物的运动规律。集合论与图论为此提供了强有力的描述工具与推理理论。本课程的目标是通过理论学习，使学生正确地理解概念，正确地使用概念进行推理，养成一个好的思维习惯，理解理论与实践的关系。引导学生观察生活、社会和大自然，分析事物间的联系，建立系统的模型，提出和解决其中的复杂工程问题。本课程主要包含二部分内容：集合论与图论。集合论是整个数学的基础，也是计算机科学的基础，计算机科学领域中的大多数基本概念和理论，几乎均采用集合论的有关术语来描述和论证，而图论的基本知识则将始终陪伴着每一个计算机工作者的职业生涯。计算学科以抽象、理论、设计为其学科形态，以数学方法和系统方法为其学科方法，本课程的核心目标就是在抽象和理论的基础上提供数学方法，因此，本课程是整个专业的基础课程，是计算机专业最重要的课程之一。《集合论与图论》（上）主要讲述集合论部分，《集合论与图论》（下）主要讲述图论部分。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "物联网工程导论",
  "url": "https://www.chinaooc.com.cn/course/65d7ceb8bb5c5a802527e1d7",
  "teacher": "刘海波",
  "school": "哈尔滨工程大学",
  "description": "物联网引领了继计算机、互联网之后世界信息产业发展的第三次浪潮。物联网工程是国家战略性新兴产业相关专业。此课程是物联网工程专业的导论课程，将向学习者大视角展现物联网技术体系、知识体系和课程体系的概貌，内容精炼、覆盖面宽、难度适中，旨在引导学习者入门，培养物理空间与信息空间一体化的计算思维能力和创新意识，为后续专业课程学习奠定基础。对于非物联网工程专业的学生或在职人员，通过学习此课程，可以快速对物联网技术有一个系统全面的了解。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "IT项目管理",
  "url": "https://www.chinaooc.com.cn/course/62354d639906eace04903582",
  "teacher": "吴清锋",
  "school": "厦门大学",
  "description": "项目管理是现代管理学科中一个日显突出其地位的新分支。项目管理学科主要探索、研究和发现项目管理的理论、方法和最佳实践。本课程在介绍现代项目和项目管理的基本概念、定义和特征基础上，以IT项目为研究对象，针对IT项目管理的特点，遵循项目生命周期和项目管理知识体系两条主线，对IT项目管理中涉及的思想、理论、技术、方法和工具进行较为系统地探讨，对项目的十大知识域和IT项目全过程管理等环节进行全面地阐述。    课程将基于业界通用的项目管理知识体系PMBOK的最新内容，同时结合科研工作，及时吸纳和采用国内外近年来在项目管理研究领域的新进展、新成果等，对于奠定专业技术与管理复合型人才的理论基础和动手实践能力起着重要的引领作用。    课程的特色和亮点有：    1、课程注重IT项目管理理论与实践紧密结合、经典理论传承与管理知识创新紧密结合、西方现代项目管理理论与中国古典管理智慧紧密结合、知识性与趣味性紧密结合。    2、课程内容充实、案例丰富、实用性高，重视将课程内容体系融入到实际工作生活中，以理论化解实践难题，以经验带动知识形成。    3、课程选取“高阶”项目实例，遵循IT项目生命周期，将项目管理知识域，根据其内在逻辑进行重新编排，在推演中依次嵌入，应用“富媒体化”呈现，重塑成为一个有机整体，既符合“模块化、碎片化”泛在学习特点，更体现了课程知识体系的系统化学习本质。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "信息安全数学基础",
  "url": "https://www.chinaooc.com.cn/course/6872cd4716c43a09c0a9ef09",
  "teacher": "陈恭亮",
  "school": "上海交通大学",
  "description": "网络空间安全是一级学科。信息安全是一门新兴的交叉学科，涉及通信学科、计算机学科、数学、物理、生物、法律和管理学科等多个学科，其核心技术是密码技术。而密码技术的基础是数学，主要是数论, 代数和椭圆曲线论等数学理论。本课程结合信息安全和密码学的理论和工程实践，用严格的数学语言对信息安全和密码学所涉及的数学理论给出了详细的推理和说明，包括一些具体的例子，为学生以及从事信息安全工作的人打下坚实的理论基础，有助于跟上信息安全和密码学的最新进展，并提高创新能力和做出创新工作。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机组织与结构",
  "url": "https://www.chinaooc.com.cn/course/67b517c2225d72705e3c3296",
  "teacher": "赖晓晨",
  "school": "大连理工大学",
  "description": "各位同学，大家好： 感谢大家选择《计算机组织与结构》慕课课程，希望这种新的教学方式能够对大家有所帮助。 一、课程简介“计算机组织与结构”又称为“计算机组成原理”，是计算机科学技术、软件工程专业的一门重要公共基础课，是一门理论性、技术性很强的主干课程。本课程的主要任务是全面介绍计算机内部各部件的组成结构与工作原理、各部件间联系，以及并行体系结构等前沿知识。通过本课程的学习，使学生掌握计算机硬件的基本特征和实现机制，为后续计算机、软件工程专业课的学习，以及未来从事计算机软硬件研究与开发，打下一个良好的基础。 自2021年秋季学期起，本课程加入了教育部-华为“智能基座”精品慕课建设项目，在课程的各章节中融入了华为鲲鹏处理器和TaiShan服务器的相关内容。此外，单独设置了课程的第11章，华为鲲鹏处理器的全部内容，在第11章中有全面集中的介绍。 在阿里平头哥的支持下，本课程也融入了基于RISC V架构的“玄铁”处理器内容，以玄铁E906处理器为案例，介绍指令集、中断、流水线等相关内容，并在课程的第12章中有全面集中的介绍。 二、课程组织形式1、本课程采用慕课形式教学，教学环节以知识点为单位组织，知识点分为核心知识点和基础知识点两类，核心知识点是授课内容的主体部分，基础知识点为补充内容；2、每节课安排大约1-3个核心知识点，以及1个基础知识点。 三、课程实施形式每节课的教学过程分为2个阶段：1、线上学习阶段：按照教学进度安排，学生进行线上的核心知识点教学视频学习（总时长约为24学时，每学时45分钟），通过课件学习基础知识点，以及阅读推荐资料、实验实践材料等，并完成习题。2、翻转课堂学习阶段：按照教学进度安排，教师组织线下的翻转课堂学习，主要教学内容为组织知识点讨论，以及答疑，随堂测试等； 四、课程资源本课程所有授课资源按照“章-节-知识点”组织，基本单元为知识点。对应每个核心知识点，将提供知识点授课视频（约10-20分钟）、推荐阅读材料、习题；对应每个基础知识点，将提供自学ppt课件；同时还将提供翻转课堂实施建议（含讨论内容、测试内容等）。 五、学习要求：1、基本要求：按照教学大纲及考核标准，完成课程学习，基本达到学习目标。2、中级要求：在达到基本要求的基础上，对课程核心知识点有深入理解，能提出有价值的问题，了解解决问题的一般流程，并能付诸实施。3、高级要求：在达到中级要求的基础上，能对课程进行宏观全面的思考，能对课程内容建设提出建议，并能落实建议内容。 六、考核方式：讨论（20％）：获取满分学生需要在“课堂交流区”中参加老师发起的讨论，发帖和回帖的数量总共达10条及以上。MOOC平台默认只有这个部分的讨论才能计算成绩。本课程每一章节都会指定讨论题目，学生可根据兴趣选择参与。本部分总分为20分，这部分成绩最易获得，请同学们重视。测验（20％）：每章均有测试题。每次测验时间不限，允许尝试2次，有效得分为最后一次得分值。本部分总分20分。考试（60％）：包括两个单元测试（分别于3月24日和5月5日开始）和一个期末考试（2025年6月9日开始）。单元测试均为10个判断题和10个单选题，需要在1小时内完成；期末考试为25个单选题和25个判断题，需要在120分钟内完成，只允许尝试1次。考试成绩总分为60分。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "物联网技术概论",
  "url": "https://www.chinaooc.com.cn/course/686d91d216c43a09c08f7cd8",
  "teacher": "桂小林",
  "school": "西安交通大学",
  "description": "本课程系统介绍了物联网的起源与发展、物联网的概念与特征、物联网的体系结构与关键技术，并从物联网的“全面感知-可靠传递-智能处理”三个维度出发，深入讲解了传感与检测技术、标识与定位技术、物联网通信技术、物联网数据处理技术、物联网信息安全技术等。课程兼顾通识性知识和专业性技术，内容丰富、覆盖面广、难易适度，既可作为物联网工程专业的基础课程，也可作为其他专业的信息技术类通识课程，并可作为高职高专等相关专业的物联网技术课程，还可为广大物联网工程技术人员、物联网用户及物联网爱好者提供学习参考。    课程负责人桂小林教授为国家级教学名师，曾获得2018年国家教学成果一等奖（物联网），考虑到“物联网作为战略新兴产业”和“物联网工程专业作为新工科专业”的特点，在对专业内涵、专业知识领域和知识单元等方面进行研究和分析的基础上，科学安排课程内容。线上讲解深入浅出，体现层次性、递阶性、科学性，线下教学资源丰富，包含指导书、PPT、章节习题等，能够进一步激发学生的学习兴趣。课程于2023年获批国家级线上一流课程。    本次课程吸取了多方面的宝贵意见和建议，对部分核心内容进行二次更新，进一步保证教学资源的先进性，更加符合高校和企业对物联网人才培养的需求。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数字媒体技术概论",
  "url": "https://www.chinaooc.com.cn/course/687ffe5b16c43a09c0ec3310",
  "teacher": "严明",
  "school": "中国传媒大学",
  "description": "数字媒体技术是融合了数字信息处理技术、计算机技术、数字通信和网络技术等多种技术的交叉学科和技术领域。数字媒体技术是通过现代计算和通信手段，综合处理文字、声音、图形、图像、视频等信息，使抽象的信息变成可感知、可管理和可交互的一种技术。通过本门课程的学习，可以让你了解数字媒体技术的前沿研究进展和发展方向，领略数字媒体技术领域的魅力，培养学习相关技术的兴趣和动力。为后续数字媒体技术专业课程的学习和开展相关科学研究打下良好的认识基础。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数字图像处理",
  "url": "https://www.chinaooc.com.cn/course/62354d679906eace04904aaa",
  "teacher": "顾力栩",
  "school": "上海交通大学",
  "description": "本课程主要研究内容是医学影像处理与分析, 致力于运用信息科学的基本理论和方法，与临床医学相结合，探索新方法和新技术。针对医学图像的特征，结合临床需求，由浅入深地讲解医学图像的种类、特征、应用领域、数字化存储形式，并分类讲解图像处理的理论和算法，具体包括两个方面：数字图像分析与处理技术与医学影像数据应用技术。前者包括：图像增强、分割、配准、融合以及三维重建等；后者则包含人体解剖结构和病变区域定位、提取、三维再现与量化分析等。教学上通过结合应用案例和课程实践使学生熟练掌握相关领域的知识和技能，使其具备一定的动手能力，为进一步学习医学图像领域其他课程奠定基础。该课程的特色：针对医学影像的特殊受众,为精准手术和治疗提供专业知识，内容上突出科学性和实用性，教学上引进现代教育理念和信息技术。相比传统国内外课程，该课程是以医学影像为特殊受众，且与医学图像处理相结合。课程内容涉及许多针对医学影像问题的专门解法，故而有着突出的科学性。与此同时，该课程内容将结合该领域相关最新研究，着重强调医学图像处理在现代医学影像实践。能有效为精准手术和治疗提供专业知识，有着较强的实用性。另一方面该课程还能为现今热门人工智能诊断读片提供基础知识，故而有着较强的前瞻性。",
  "learners": 20000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "集合论与图论（下）",
  "url": "https://www.chinaooc.com.cn/course/674a4f3416d8a05eeda9cc15",
  "teacher": "姜守旭",
  "school": "哈尔滨工业大学",
  "description": "要想用计算机解决问题就要为它建立数学模型，即描述研究对象及对象与对象之间的联系，并通过事物之间的联系找出事物的运动规律。集合论与图论为此提供了强有力的描述工具与推理理论。本课程的目标是通过理论学习，使学生正确地理解概念，正确地使用概念进行推理，养成一个好的思维习惯，理解理论与实践的关系。引导学生观察生活、社会和大自然，分析事物间的联系，建立系统的模型，提出和解决其中的复杂工程问题。本课程主要包含二部分内容：集合论与图论。集合论是整个数学的基础，也是计算机科学的基础，计算机科学领域中的大多数基本概念和理论，几乎均采用集合论的有关术语来描述和论证，而图论的基本知识则将始终陪伴着每一个计算机工作者的职业生涯。计算学科以抽象、理论、设计为其学科形态，以数学方法和系统方法为其学科方法，本课程的核心目标就是在抽象和理论的基础上提供数学方法，因此，本课程是整个专业的基础课程，是计算机专业最重要的课程之一。《集合论与图论》（上）主要讲述集合论部分，《集合论与图论》（下）主要讲述图论部分。",
  "learners": 20000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "二维动画制作",
  "url": "https://www.chinaooc.com.cn/course/6876c27816c43a09c0bdcf4b",
  "teacher": "伍丽媛",
  "school": "湖南科技学院",
  "description": "Flash是著名的网页三剑客之一，也是最流行的二维矢量动画制作软件。2015年12月，Adobe宣布Flash更名为Animate CC，在支持Flash SWF文件的基础上，加入了对HTML5的支持。我们这门课将以Animate CC软件为例，你也可以使用Flash软件跟着操作。我们在教学中从零开始，由浅入深进行讲解，突出实用，全面详细地介绍二维动画制作的各种工具的用法以及综合应用，让学习者能循序渐进的学习掌握二维动画设计制作的技能。本课程主要内容有：1、二维动画制作基础篇，包括动画的起源与发展、动画原理及制作方式。2、软件的基本介绍及图形绘制与编辑篇，包括应用领域介绍、基本工具的使用，矢量图的绘制与编辑，文本以及相应工作菜单面板的使用。3、动画制作基础篇，包括元件的建立以及不同类型动画制作的基本步骤。4、动画制作提高篇。包括声音视频的添加，运用 ActionScript 3.0脚本语言制作交互性动画，综合案例的制作。    本课程根据课程特点和性质，采用问题解决法、案例、任务驱动、项目相结合的教学方法，让学生最后达到能够制作出有自己创意的作品。课程形成了自己独有的特色和优势, 经过十年课程建设，本课程拥有了一支实力雄厚的师资队伍，形成了一套完善的教学管理体制。该课程负责人及骨干教师有着丰富的教学经验和科研经验，课程教学成员长期讲授本课程， 为课程体系建设做了大量的工作，形成了鲜明的特色。",
  "learners": 20000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "面向对象分析与设计",
  "url": "https://www.chinaooc.com.cn/course/686edd4a16c43a09c0961798",
  "teacher": "姜宁康",
  "school": "华东师范大学",
  "description": "优秀的软件需要精心的设计！如何设计软件，使其不仅能满足当前的需要，还能适应今后变化的需要，这是IT企业迫切需要的技能。\t\t\t《面向对象分析与设计》是软件工程专业重要的专业基础课，适合具备了一定的面向对象语言\t（如\tJava\t、\tC++\t等）编程能力的同学进一步深造，在开发实际的软件项目时，给出良好的设计方案。\t\t\t《面向对象分析与设计》课程讲解的核心：    -面向对象的思维方式；    -如何对问题领域进行分析，抽象出领域概念、关系等，并设计领域模型；    -如何定义待开发系统的软件类、软件类的属性，如何在软件类之间分配系统职责、如何定义软件类之间的关系。课程会讲解一些专业的技术、方法，如名词法、CRC（类-关系-协作）方法等；    -面向对象分析设计的原则、职责分配原则GRASP、常用设计模式。同时，通过UML工具，如类图、顺序图、状态图等，展示、验证设计方案的可行性、合理性。                软件设计是一门艺术，设计师的理念、经验、知识、灵感都会映射到设计方案上。通过课程的学习，帮助同学们在设计理念、设计能力等方面得到提升，为若干年之后成为优秀的软件设计师打下基础。",
  "learners": 20000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "信息安全技术",
  "url": "https://www.chinaooc.com.cn/course/687eb4a416c43a09c0e5841c",
  "teacher": "孙建国",
  "school": "哈尔滨工程大学",
  "description": "随着互联网的发展和普及，网络病毒、网络攻击以及网络犯罪迅速达到空前猖獗的程度，今天的病毒已能在十几分钟内迅速传遍全球，能在瞬间扰乱全球经济。网络安全已成为全球关注的焦点，黑客入侵和计算机病毒正威胁着各部门的正常运转。当人们日益依赖计算机网络的同时，却发现计算机网络如此脆弱。于是，网络信息安全日益得到全世界的高度重视，信息安全已经成为衡量一个信息系统是否完善的重要标志。",
  "learners": 20000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "软件理论基础",
  "url": "https://www.chinaooc.com.cn/course/688157b016c43a09c0f2cf3b",
  "teacher": "罗贵明",
  "school": "清华大学",
  "description": "本课程介绍形式语言、自动机、文法、可判定性问题及计算复杂性，内容包括：基础知识；确定性有限自动机、非确定性有限自动机；正则表示与语言；正则语言与正则文法；正则语言的性质、Pumping引理及应用；上下文无关文法与语言；下推自动机、确定性下推自动机；上下文无关语言的性质、上下文无关语言的Pumping 引理及应用；图灵机；不可判定问题、NP问题等。",
  "learners": 20000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机组成与系统结构",
  "url": "https://www.chinaooc.com.cn/course/674a4f3a16d8a05eeda9cc16",
  "teacher": "邓倩妮",
  "school": "上海交通大学",
  "description": "课程具有如下特点： 1. 满足差异化的学习需求2.教学内容兼顾基础和扩展课程前十周的内容，可以作为研究生入学考试的参考资料。课程最后几周的内容，发挥授课教师的研究特长，以并行处理 、人工智能等需求驱动，介绍计算机系统结构的发展动态，有利于激发学习者的学习热情和创新意识。",
  "learners": 20000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "信息安全",
  "url": "https://www.chinaooc.com.cn/course/67b3c6ca225d72705e35d6ba",
  "teacher": "李景涛",
  "school": "复旦大学",
  "description": "本课程不是一门密码学课程，也不是网络攻防安全课程，而是学生进入信息安全科学领域的入门课。课程用一种最易于理解的语言描述信息安全的基本需求，保密性、完整性、可用性等等。用这些安全需求作为分析主线，以经典的安全解决方案为实例，在安全需求提炼和解答过程中，使学生掌握信息安全的基本概念和原理；使学生能够分析常见的信息系统的安全性问题，并能够提出合理的解决方案。 课程主要特色包括：ü 力求零基础。尽量避免涉及计算机专业背景，有一定理工科基础知识即可修读；ü 以“问题”为导向。改变传统的按知识点讲解的做法，以领域内经典科学问题为导向组织教学内容；ü 安全思维训练。教会学生用一套系统化的分析信息安全问题的方法来描述和解决问题。",
  "learners": 20000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "软件定义网络技术 Software Defined Networking，SDN",
  "url": "https://www.chinaooc.com.cn/course/66d0fe39711dc30c3482ead3",
  "teacher": "黄辉",
  "school": "温州大学",
  "description": "软件定义网络（Software Defined Network，SDN）作为新一代网络架构，近年来得到了学术界和产业界的广泛关注，随着SDN技术的发展及其在产业界的落地，网络工程人才需求已发生重大变化，SDN技术人才出现明显短缺。本课程顺应网络工程新技术发展与新人才需求，以培养网络工程新工科人才为目标，同时，本课程还支持中国高校计算机大赛网络技术挑战赛，以赛促学。\t本课程视频主要内容包括：SDN概述、基本原理、南向接口协议、数据平面、控制平面、北向接口和SDN应用开发等内容；除教学视频外，本课程还设计了实验和课后练习等环节，实验内容包括Mininet应用实践、OpenFlow协议分析、 Open vSwitch应用实践、 OpenFlow交换机应用实践、数据平面编程实践、POX与RYU控制器编程实践等内容。\t通过本课程的学习，能够将软件定义网络的基础知识、主流技术与方法，用于具体网络工程项目需求的分析；能够形成软件定义网络技术的思想方法，并用于分析或理解复杂网络问题，指导网络的规划与设计；能够利用控制器提供的开放接口，开发网络应用程序。\t本课程由高校教师与企业工程师共同开设，注重理论与实践相结合，知识讲授与案例分析相结合，入门学习与高阶开发相结合，为你带来全新学习体验。",
  "learners": 20000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "智能交互技术",
  "url": "https://www.chinaooc.com.cn/course/67a543bf225d72705eefecfa",
  "teacher": "马楠",
  "school": "北京联合大学",
  "description": "当今社会科学技术的进步推动了人工智能的飞速发展，使之成为研究热点，它不断革新人与机器的互动方式。纵观科学技术发展史，每一次变革都伴随着交互技术的革新，鼠标和键盘打开了我们使用PC机时代的大门；触摸屏打开了我们移动互联时代的大门；语音交互、人脸识别、手势识别等多模态智能交互技术带我们走进全新的AI时代。本课程在制作过程中得到了中国工程院院士、中国人工智能学会理事长、北京联合大学机器人学院院长李德毅院士，中国人工智能学会智能驾驶专委会副主任、人工智能与机器人系列教材编委会主任、北京联合大学鲍泓教授等专家的指导和支持，课程将较全面地讲解智能交互技术及其应用，包括基本概念、智能交互原型设计、基于移动设备的智能交互软件开发、智能语音交互、交互技术设计与评价方法以及智能交互技术的前沿应用领域等内容，充分体现“智能+交互”。本课程配有机械工业出版社出版“十三五”国家重点出版物规划项目教材《智能交互技术与应用》，并以自动驾驶作为主要应用场景介绍智能交互技术，设计了大量实践教学环节和习题，帮助同学们在学习完理论内容后进行复习并通过实践环节加深对智能交互技术的掌握与应用，特别适合智能科学与技术、人工智能、计算机科学与技术、软件工程、机器人工程、数字媒体等专业本科生学习，也可作为从事交互设计、人工智能应用、用户界面设计、移动软件开发等相关技术人员学习的课程。课程主讲教师为北京联合大学机器人学院马楠、工科中心徐歆恺和智慧城市学院张欢，三位教师是学校无人车智能交互团队骨干成员，在交互设计与实现方面具有一定的科研和实践教学经验。“智创未来，未来已来”，让我们张开双臂迎接人工智能时代，并衷心地希望同学们通过对《智能交互技术》课程的学习，学有所获。",
  "learners": 20000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "FPGA设计与应用",
  "url": "https://www.chinaooc.com.cn/course/67b7bba3225d72705e48e78a",
  "teacher": "王洁",
  "school": "大连理工大学",
  "description": "本课程的学习目标是使学生更深入地理解和掌握FPGA程序分析与设计的基本方法，熟练运用Verilog HDL硬件描述语言，应用可综合设计和层次化设计方法，熟练运用ISE、ModelSim、Synplify、ChipScope等软件工具。课程立足于FPGA逻辑设计与可综合方法，为FPGA优化设计奠定基础，能够为未来软硬件协同设计提供底层优化方案。通过本课程的学习，能够进一步掌握数字逻辑的设计与实现方法，实现全数字化的大规模并行化硬件程序设计和FPGA项目开发。",
  "learners": 20000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "软件体系结构",
  "url": "https://www.chinaooc.com.cn/course/687eb93216c43a09c0e590ac",
  "teacher": "李青山",
  "school": "西安电子科技大学",
  "description": "在计算机类，软件工程专业的课程体系中，《软件体系结构》课程是聚焦软件生命周期中的软件设计阶段，直接面向提升我国软件工程专业人才的软件设计能力的核心专业课程。在该课程的学习中，同学们将学习软件架构设计的基础知识、架构风格和模式、质量属性分析和设计策略，以及架构评估方法等完整的软件架构知识体系。同时，通过实际软件项目架构设计任务驱动学生运用理论知识主动思考软件架构方案，引导学生应用辅助工具软件完成系统架构建模、评估和实现，体验软件架构师的任务、角色，搭建软件架构“学与用”的桥梁。",
  "learners": 10000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "形式语言与自动机理论",
  "url": "https://www.chinaooc.com.cn/course/67bfa4da225d72705e6f0335",
  "teacher": "王春宇",
  "school": "哈尔滨工业大学",
  "description": "计算理论是关于计算知识的有系统的整体，本是数学的一个研究领域，诞生于数理逻辑学家对计算本质的探索。这里的计算 (Computation) 并不是指纯粹的算术 (Calculation)，而是指一种以 “机械而有效的” 方式获取问题答案的过程。随着计算理论的发展最终促使了计算机的发明，计算理论的重心也从数学转到了计算机科学，而计算理论关心的核心问题是：计算（机）的基本能力和限制究竟是什么?这个问题中包含了两个内容，分别对应计算理论的两个研究方向：可计算性理论和计算复杂性理论, 而形式语言与自动机理论正是这两个重要的研究方向的理论基础。为了能够严谨的研究这种机械而有效的计算过程，我们需要严格定义的概念去描述它，需要严谨的计算模型去分析它。这个概念，其实就是已经被我们大家所熟知的“算法”(Algorithm)；而这些模型呢，就是我们将要在课程中主要学习的自动机理论，包括有穷自动机、下推自动机和图灵机等几种自动机装置，还包括一些与自动机形式上不相似但能力上却完全相同的模型，如正则表达式和文法等。",
  "learners": 10000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "软件需求工程",
  "url": "https://www.chinaooc.com.cn/course/67941b16225d72705e9d699a",
  "teacher": "李尤丰",
  "school": "金陵科技学院",
  "description": "随着计算机技术应用的深入，人们需要收集和处理的信息急剧增大，通过软件收集和处理数据成为必然。然而，软件的开发和预期效果，没有达到人们对软件高质量的要求。软件需求工程指应用工程化的方法、技术和规格来开发和管理系统需求，充分理解客户要求。软件需求工程的目标就是获取高质量的软件需求。与传统需求分析概念相比，软件需求工程突出了工程化的原则，强调以系统化、条理化和可重用的方法和技术进行软件需求相关活动，从而有利于提高与软件需求相关的一切活动及其过程的管理，降低了软件需求开发和管理的难度和成本。\t\t\t\t\t\t本课程是软件工程专业系列核心课程之一，是软件工程课程体系的最前端课程，主要介绍需求的基本概念，需求的分类，需求工程的过程，需求获取的方法、步骤、技巧，需求建模技术，需求定义和验证的方法和技术，需求管理等内容。后续多门课程均已本课程为基础。学生需求工程能力具有了，对后续课程的理解和学习是一个基础，更增加学生就业时的多种能力——工程能力，文档能力，以及相关职业素养。\t\t\t\t\t\t学习本课程，第一掌握理论知识基础，第二实际项目演练，第三阅读大量参考资料，第四阅读和分析相关案例及相关文档，第五，尝试规范地编写相关文档。对于理论知识，可以从教师课堂讲授、线上慕课、参考文献资料、网络视频等多途径获得，实验项目需要自己从生活或已有软件中发现问题从而进行提炼。实验效果的好坏需要进行评审，可以提请教师或相关专家，或行业专家评审，从而获得相应工程能力的训练。",
  "learners": 10000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机科学基础",
  "url": "https://www.chinaooc.com.cn/course/67c62db3225d72705e8ec7ec",
  "teacher": "詹涛",
  "school": "西北工业大学",
  "description": "为什么要学习这门课程？      计算机科学技术的兴起与发展，不仅带来了全新的研究方法和手段，还极大推动了其他学科的拓展与进步。掌握计算机相关知识与技能，已不再局限于信息类专业学生，而是成为新时代人才必备的基础素养。本课程面向社会及高校各专业学习者，定位为面向智能时代的计算机通识课程。贯彻国家“立德树人”的教育方针，结合团队多年的教学与科研成果，设计了从“科学、技术、素养、交叉”四个维度出发的课程内容，具体特点如下：多维覆盖：课程涵盖科学、技术、素养及交叉四大领域，帮助学习者全面掌握计算机科学的不同层面，培养具备全方位数字素养的复合型人才。计算思维培养：通过系统化训练，帮助学习者建立计算思维这一关键能力，培养他们在复杂社会环境中解决问题与创新的核心竞争力。实践与思维训练相结合，促使学习者具备批判性思维与问题解决能力。理论与实践结合：课程注重理论知识的背景与实际应用，不仅传授知识，更介绍其来源与应用场景，激发学习者的学习兴趣，提升其自主构建知识的能力。创新能力塑造：课程旨在培养创新型人才，通过批判性思维与问题解决能力的提升，激发学习者的创新意识，促使他们在实践中不断探索、突破与创新。总体而言，本课程致力于培养兼具计算思维与跨学科创新能力的人才，为其在智能时代的学习与职业发展提供全方位的支持与引导。欢迎大家与我们一起开启这门课程的学习旅程！",
  "learners": 0,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机病毒与恶意代码",
  "url": "https://www.chinaooc.com.cn/course/66f9e0b14220cd272a6fbcd6",
  "teacher": "刘功申",
  "school": "上海交通大学",
  "description": "（1）我为什么要学习这门课？  恶意代码作为信息安全领域的重要一环，近年来在组织对抗、国家博弈、社会稳定方面发挥了双刃剑的作用，引起了社会各界的广泛重视。通过这门课同学们可以了解勒索软件、APT等最新的恶意代码，也会学到传统恶意代码的原理。（2）这门课的主题是关于什么？  本课程主要讲解恶意代码的基本概念、技术发展和运行机制。在分析恶意代码技术的基础上，讲解了恶意代码的检测和清除技术。此外，还对预防恶意代码的策略和防治方案进行了讲述。（3）学习这门课可以获得什么？特别是对自己有什么帮助和应用。    本课程总共12个章节，包括恶意代码的概述，模型及传播机理，传统计算机病毒，Linux系统下的恶意代码，移动终端恶意代码，也包括新颖的蠕虫、木马、僵尸网络、APT等；此外，也包括恶意代码的防范技术及防范策略等。    通过学习本课程，同学能够掌握恶意代码的基本技术，在日常的系统维护中，能够游刃有余地应对由恶意代码引发的各种安全威胁，并能给出合理的防范恶意代码的方法和方案。（4）这门课有什么特色和亮点。    课程主要内容来源于本人大学本科计算机病毒和恶意代码10多年教学经验，多年恶意代码及其防范研究基础，以及前期编写的4本教材。课程的参考教材《计算机病毒与恶意代码（第4版）》被多所高校作为教材，得到了大家的支持和认可。该教材也分别获得了“上海交通大学优秀教材特等奖”、“上海市高等教育教材一等奖”。",
  "learners": 0,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机系统结构",
  "url": "https://www.chinaooc.com.cn/course/68003b5ab836e5522a755973",
  "teacher": "张晨曦",
  "school": "同济大学",
  "description": "本课程的目标是提高学生从总体结构、系统分析这一层次来研究和分析计算机系统的能力，帮助学生建立整机系统的概念；使学生掌握计算机系统结构的基本知识和方法，掌握量化分析方法。本课程采用抽象分析和具象解析想结合的方法，采用了大量生动的动画解析教学内容。本课程强调系统地讲解，自顶向下，构建完整的系统结构知识体系。",
  "learners": 0,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "计算机系统局限性",
  "url": "https://www.chinaooc.com.cn/course/681bdf60b836e5522afd8f6e",
  "teacher": "何积丰",
  "school": "华东师范大学",
  "description": "自上世纪中叶计算机发明以来，芯片、体系结构、算法、编程语言以及网络通信等领域技术都得到了突飞猛进的发展。计算机已经深度融入了人类社会的方方面面，上至宇宙探索、量子物理，下至移动终端、手机支付，都离不开计算机系统。计算机科学目前仍处在高速发展中，特别是在高性能处理器、大数据与人工智能技术的推动下，近年来许多过去的科幻故事变成了现实。那么，计算机系统是否是万能的？在本课程《计算机系统的局限性》中，何积丰院士采用深入浅出、浅显易懂的教学方式，带领听众从非计算机专业角度来看计算机系统。在好奇心的驱使下，学习计算机系统的局限性有助于我们清楚假设与空想、探索计算机系统的边界、发展新的计算范式以及解决未知问题与新型应用。本课程介绍计算机系统的软硬件构成、软件与计算过程、软件设计的困难、计算模型与图灵机、有限问题与无限问题、可计算性与难解性、时间与空间复杂度、并行计算、量子计算等内容。计算机系统的应用与局限性的真实案例将贯穿于整部课程，包括芯片设计、航空航天、物流规划、金融计算等领域中问题。",
  "learners": 0,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "软件安全之恶意代码机理与防护",
  "url": "https://www.chinaooc.com.cn/course/687ffeda16c43a09c0ec3317",
  "teacher": "彭国军",
  "school": "武汉大学",
  "description": "本课程将在软件安全基础知识（如磁盘结构与系统启动、内存管理机制、PE文件结构等）讲解的基础上，解析当前典型恶意软件（如PE病毒、宏病毒、脚本病毒、网络蠕虫、网络木马等）的功能、实现机制，以及对应的防护手段和分析技术。 特色：理论与实践并重，解析安全对抗博弈本质。受众：信息安全专业高年级本科生，对软件安全感兴趣的计算机类专业在校本科生、研究生或爱好者。",
  "learners": 0,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "操作系统原理",
  "url": "https://www.chinaooc.com.cn/course/660c89fbbb5c5a80250e0dbd",
  "teacher": "陈向群",
  "school": "北京大学",
  "description": "《操作系统原理》是针对计算机科学技术专业三年级本科生开设的一门专业基础课程。本课程着重学生系统观的培养，通过重点讲述操作系统的内部结构、工作原理及典型技术的实现，使学生建立起对操作系统的整体及各个功能模块的认识，从而系统掌握计算机的专业知识，进一步提升学生的软件开发能力乃至系统软件开发能力。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "数据科学导论",
  "url": "https://www.chinaooc.com.cn/course/623c6da5edd41d4c76612cd1",
  "teacher": "朝乐门",
  "school": "中国人民大学",
  "description": "本课程为数据科学的入门性、导论类课程，主要探讨大数据时代及其背后的科学问题——数据科学的理念、理论、方法、技术、工具、应用及数据产品开发，为进一步学习数据科学理论打下较好基础。本课程分为两大专题，分别为：专题一、数据科学的基础理论；专题二、数据产品开发。本课课程对学生专业背景和知识基础不做严格限制，鼓励跨学科选修。",
  "learners": 30000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "WEB前端技术-17期（2025春季）",
  "url": "https://www.chinaooc.com.cn/course/67d214b0225d72705ec8128d",
  "teacher": "范玉玲",
  "school": "济南大学",
  "description": "互联网普及的今天，Web前端成为炙手可热的职业，其内容主要包括HTML5、CSS3、JavaScript和主流框架。本课程采用项目驱动的方式，让学习者由浅入深、循序渐进地掌握Web前端开发技术。主要介绍Web前端的核心技术和前沿框架，包括超文本标记语言HTML5、层叠样式表CSS3属性和Bootstrap框架。\n教学计划：\n根据课程特点，课程采用分层次教学的方法。\n第一层示例：通过400余个示例，通过视频详细的讲授每个知识点，让学习者由浅入深的掌握HTML5标记和层叠样式表CSS3属性的使用规则，并能够运用BootStrap框架开发响应式页面；\n第二层项目：通过拆解一个完整的网站，形成15个项目作业，循序渐进引导学习者掌握网站设计及开发流程，并巩固视频部分讲解的知识点；\n第三层拓展：通过拓展习题，分析其重点难点，是对所学知识点的引申，要求学习者能够具有查阅资料、解决问题的能力。",
  "learners": 20000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
},
{
  "title": "C语言程序设计",
  "url": "https://www.chinaooc.com.cn/course/62354d7c9906eace0490cb7e",
  "teacher": "翁恺",
  "school": "浙江大学",
  "description": "程序设计是一门基础课程。对于计算机相关专业而言，程序设计是专业基础知识，是进一步学习其他专业知识的第一步阶梯；对于非计算机专业而言，程序设计的学习有助于理解计算机的能力所在，理解哪些是计算机擅长解决的问题，怎样的方式方法是计算机擅长的手段，从而能更好地利用计算机来解决本专业领域内的问题。C语言是古老而长青的编程语言，它具备了现代程序设计的基础要求，它的语法是很多其他编程语言的基础，在系统程序、嵌入式系统等领域依然是无可替代的编程语言，在各类编程语言排行榜上常年占据前两名的位置。对于非计算机专业的学生，学习本课程的主要目的是掌握程序设计的基本方法，C语言是教学媒介。但是对于计算机专业的学生，本课程是向后续的计算机组成、操作系统、编译原理、体系结构等课程前进的基石，对于C语言本身甚至程序设计语言基础原理的深入理解都是应该掌握的。程序设计是实践性很强的课程，该课程的学习有其自身的特点，听不会，也看不会，只能练会。你必须通过大量的编程训练，在实践中掌握编程知识，培养编程能力，并逐步理解和掌握程序设计的思想和方法。在这里所提供的，只是基础的知识讲解，要想学会编程，还需要更多时间的投入和努力。为了学习编程，你需要有一台计算机，安装必要的编程软件。无论是MS Windows、Mac OS X还是Linux，都有适合C语言编程的软件。",
  "learners": 900000,
  "platform": "国家高等教育智慧教育平台",
  "tags": "",
  "rating": null
}
]